{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int[10]",
   "referenced_type" : "_ZTIi",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_Du",
   "name" : "char8_t[11]",
   "referenced_type" : "_ZTIDu",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char[11]",
   "referenced_type" : "_ZTIc",
   "size" : 11,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char[120]",
   "referenced_type" : "_ZTIc",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA128_m",
   "name" : "unsigned long[128]",
   "referenced_type" : "_ZTIm",
   "size" : 512,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA12_y",
   "name" : "unsigned long long[12]",
   "referenced_type" : "_ZTIy",
   "size" : 96,
   "source_file" : "bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA13_i",
   "name" : "int[13]",
   "referenced_type" : "_ZTIi",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",

   "referenced_type" : "_ZTISt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "size" : 8,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "size" : 8,
   "source_file" : "external/skia/include/private/base/SkFloatingPoint.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "size" : 1,
   "source_file" : "external/skia/include/core/SkData.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "size" : 2,
   "source_file" : "external/skia/include/private/base/SkMath.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "size" : 8,
   "source_file" : "external/skia/include/private/base/SkMath.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkPixmap.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTI10SkNVRefCntI12SkColorSpaceE",
   "name" : "SkNVRefCnt<SkColorSpace>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTI12SkColorSpace"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTI10SkNVRefCntI6SkDataE",
   "name" : "SkNVRefCnt<SkData>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTI6SkData"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fDimensions",
     "referenced_type" : "_ZTI7SkISize"
    },
    {
     "access" : "private",
     "field_name" : "fPlaneConfig",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10SkYUVAInfo11PlaneConfigE"
    },
    {
     "access" : "private",
     "field_name" : "fSubsampling",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN10SkYUVAInfo11SubsamplingE"
    },
    {
     "access" : "private",
     "field_name" : "fYUVColorSpace",
     "field_offset" : 128,
     "referenced_type" : "_ZTI15SkYUVColorSpace"
    },
    {
     "access" : "private",
     "field_name" : "fOrigin",
     "field_offset" : 160,
     "referenced_type" : "_ZTI15SkEncodedOrigin"
    },
    {
     "access" : "private",
     "field_name" : "fSitingX",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN10SkYUVAInfo6SitingE"
    },
    {
     "access" : "private",
     "field_name" : "fSitingY",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN10SkYUVAInfo6SitingE"
    }
   ],
   "linker_set_key" : "_ZTI10SkYUVAInfo",
   "name" : "SkYUVAInfo",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "external/skia/include/core/SkYUVAInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10f_owner_ex",
   "name" : "f_owner_ex",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/fcntl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "color_primaries",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "transfer_characteristics",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "matrix_coefficients",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "video_full_range_flag",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI10skcms_CICP",
   "name" : "skcms_CICP",
   "size" : 4,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorSpace",
     "referenced_type" : "_ZTI5sk_spI12SkColorSpaceE"
    },
    {
     "access" : "private",
     "field_name" : "fColorType",
     "field_offset" : 32,
     "referenced_type" : "_ZTI11SkColorType"
    },
    {
     "access" : "private",
     "field_name" : "fAlphaType",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11SkAlphaType"
    }
   ],
   "linker_set_key" : "_ZTI11SkColorInfo",
   "name" : "SkColorInfo",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/skia/include/core/SkImageInfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fColorInfo",
     "referenced_type" : "_ZTI11SkColorInfo"
    },
    {
     "access" : "private",
     "field_name" : "fDimensions",
     "field_offset" : 96,
     "referenced_type" : "_ZTI7SkISize"
    }
   ],
   "linker_set_key" : "_ZTI11SkImageInfo",
   "name" : "SkImageInfo",
   "size" : 20,
   "source_file" : "external/skia/include/core/SkImageInfo.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11skcms_CurveUt_E"
    },
    {
     "referenced_type" : "_ZTIN11skcms_CurveUt0_E"
    }
   ],
   "linker_set_key" : "_ZTI11skcms_Curve",
   "name" : "skcms_Curve",
   "record_kind" : "union",
   "size" : 32,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpsr",
     "field_offset" : 768,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpcr",
     "field_offset" : 800,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI10SkNVRefCntI12SkColorSpaceE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fTransferFnHash",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fToXYZD50Hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fTransferFn",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22skcms_TransferFunction"
    },
    {
     "access" : "private",
     "field_name" : "fToXYZD50",
     "field_offset" : 320,
     "referenced_type" : "_ZTI15skcms_Matrix3x3"
    },
    {
     "access" : "private",
     "field_name" : "fInvTransferFn",
     "field_offset" : 608,
     "referenced_type" : "_ZTI22skcms_TransferFunction"
    },
    {
     "access" : "private",
     "field_name" : "fFromXYZD50",
     "field_offset" : 832,
     "referenced_type" : "_ZTI15skcms_Matrix3x3"
    },
    {
     "access" : "private",
     "field_name" : "fLazyDstFieldsOnce",
     "field_offset" : 1120,
     "referenced_type" : "_ZTI6SkOnce"
    }
   ],
   "linker_set_key" : "_ZTI12SkColorSpace",
   "name" : "SkColorSpace",
   "record_kind" : "class",
   "size" : 144,
   "source_file" : "external/skia/include/core/SkColorSpace.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13SkStreamAsset"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fFILE",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__110shared_ptrI7__sFILEEE"
    },
    {
     "access" : "private",
     "field_name" : "fEnd",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fStart",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fCurrent",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12SkFILEStream",
   "name" : "SkFILEStream",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkFILEStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkFILEStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkFILEStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN12SkFILEStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK12SkFILEStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fRefCnt",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTI12SkRefCntBase",
   "name" : "SkRefCntBase",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI12SkRefCntBase"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN12SkRefCntBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fWidth",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "fColor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN13SkEncodedInfo5ColorE"
    },
    {
     "access" : "private",
     "field_name" : "fAlpha",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN13SkEncodedInfo5AlphaE"
    },
    {
     "access" : "private",
     "field_name" : "fBitsPerComponent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "private",
     "field_name" : "fColorDepth",
     "field_offset" : 136,
     "referenced_type" : "_ZTIh"
    },
    {
     "access" : "private",
     "field_name" : "fProfile",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__110unique_ptrIN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTI13SkEncodedInfo",
   "name" : "SkEncodedInfo",
   "size" : 24,
   "source_file" : "external/skia/include/private/SkEncodedInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fFILE",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7__sFILE"
    }
   ],
   "linker_set_key" : "_ZTI13SkFILEWStream",
   "name" : "SkFILEWStream",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkFILEWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkFILEWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkFILEWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13SkFILEWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN13SkFILEWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK13SkFILEWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI13SkNoncopyable",
   "name" : "SkNoncopyable",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/skia/include/private/base/SkNoncopyable.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fBytesWritten",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13SkNullWStream",
   "name" : "SkNullWStream",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkNullWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkNullWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkNullWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13SkNullWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN13SkNullWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK13SkNullWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI16SkStreamSeekable"
    }
   ],
   "linker_set_key" : "_ZTI13SkStreamAsset",
   "name" : "SkStreamAsset",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13SkStreamAsset"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13SkStreamAssetD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13SkStreamAssetD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPlanes",
     "referenced_type" : "_ZTINSt3__15arrayI8SkPixmapLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "fData",
     "field_offset" : 896,
     "referenced_type" : "_ZTI5sk_spI6SkDataE"
    },
    {
     "access" : "private",
     "field_name" : "fYUVAInfo",
     "field_offset" : 928,
     "referenced_type" : "_ZTI10SkYUVAInfo"
    },
    {
     "access" : "private",
     "field_name" : "fDataType",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIN16SkYUVAPixmapInfo8DataTypeE"
    }
   ],
   "linker_set_key" : "_ZTI13SkYUVAPixmaps",
   "name" : "SkYUVAPixmaps",
   "record_kind" : "class",
   "size" : 152,
   "source_file" : "external/skia/include/core/SkYUVAPixmaps.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "size" : 56,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI13sk_strip_enumIivE",
   "name" : "sk_strip_enum<int>",
   "size" : 1,
   "source_file" : "external/skia/include/private/base/SkTFitsIn.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI13sk_strip_enumIxvE",
   "name" : "sk_strip_enum<long long>",
   "size" : 1,
   "source_file" : "external/skia/include/private/base/SkTFitsIn.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI13sk_strip_enumIyvE",
   "name" : "sk_strip_enum<unsigned long long>",
   "size" : 1,
   "source_file" : "external/skia/include/private/base/SkTFitsIn.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTI13SkNoncopyable"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIK11SkImageInfo"
    },
    {
     "access" : "private",
     "field_name" : "fCodec",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__110unique_ptrI7SkCodecNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTI14SkAndroidCodec",
   "name" : "SkAndroidCodec",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "external/skia/include/codec/SkAndroidCodec.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14SkAndroidCodec"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14SkAndroidCodecD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14SkAndroidCodecD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkAndroidCodec22onGetSampledDimensionsEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkAndroidCodec20onGetSupportedSubsetEP7SkIRect"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN14SkAndroidCodec18onGetAndroidPixelsERK11SkImageInfoPvjRKNS_14AndroidOptionsE"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI14SkStreamMemory"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fData",
     "field_offset" : 32,
     "referenced_type" : "_ZTI5sk_spI6SkDataE"
    },
    {
     "access" : "private",
     "field_name" : "fOffset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14SkMemoryStream",
   "name" : "SkMemoryStream",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14SkMemoryStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14SkMemoryStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14SkMemoryStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream7getDataEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK14SkMemoryStream6onForkEv"
    },
    {
     "mangled_component_name" : "_ZN14SkMemoryStream9setMemoryEPKvjb"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI13SkStreamAsset"
    }
   ],
   "linker_set_key" : "_ZTI14SkStreamMemory",
   "name" : "SkStreamMemory",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI14SkStreamMemory"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN14SkStreamMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN14SkStreamMemoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK13SkStreamAsset9hasLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK13SkStreamAsset9getLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN14SkStreamMemory13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkStreamMemory11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK14SkStreamMemory6onForkEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vals",
     "referenced_type" : "_ZTIA3_A3_f"
    }
   ],
   "linker_set_key" : "_ZTI15skcms_Matrix3x3",
   "name" : "skcms_Matrix3x3",
   "size" : 36,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vals",
     "referenced_type" : "_ZTIA3_A4_f"
    }
   ],
   "linker_set_key" : "_ZTI15skcms_Matrix3x4",
   "name" : "skcms_Matrix3x4",
   "size" : 48,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15statx_timestamp",
   "name" : "statx_timestamp",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "B",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "C",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16SkCubicResampler",
   "name" : "SkCubicResampler",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkSamplingOptions.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8SkRefCnt"
    }
   ],
   "linker_set_key" : "_ZTI16SkPngChunkReader",
   "name" : "SkPngChunkReader",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/codec/SkPngChunkReader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16SkPngChunkReader"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16SkPngChunkReaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16SkPngChunkReaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkPngChunkReader9readChunkEPKcPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI18SkStreamRewindable"
    }
   ],
   "linker_set_key" : "_ZTI16SkStreamSeekable",
   "name" : "SkStreamSeekable",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16SkStreamSeekable"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16SkStreamSeekableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16SkStreamSeekableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK16SkStreamSeekable11hasPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11getPositionEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4seekEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN16SkStreamSeekable4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable11onDuplicateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK16SkStreamSeekable6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fYUVAInfo",
     "referenced_type" : "_ZTI10SkYUVAInfo"
    },
    {
     "access" : "private",
     "field_name" : "fPlaneInfos",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__15arrayI11SkImageInfoLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 896,
     "referenced_type" : "_ZTINSt3__15arrayIjLj4EEE"
    },
    {
     "access" : "private",
     "field_name" : "fDataType",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN16SkYUVAPixmapInfo8DataTypeE"
    }
   ],
   "linker_set_key" : "_ZTI16SkYUVAPixmapInfo",
   "name" : "SkYUVAPixmapInfo",
   "record_kind" : "class",
   "size" : 132,
   "source_file" : "external/skia/include/core/SkYUVAPixmaps.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "size" : 8,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffer",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_color_space",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pcs",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tag_count",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "has_trc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "trc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA3_11skcms_Curve"
    },
    {
     "field_name" : "has_toXYZD50",
     "field_offset" : 960,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "toXYZD50",
     "field_offset" : 992,
     "referenced_type" : "_ZTI15skcms_Matrix3x3"
    },
    {
     "field_name" : "has_A2B",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "A2B",
     "field_offset" : 1312,
     "referenced_type" : "_ZTI9skcms_A2B"
    },
    {
     "field_name" : "has_B2A",
     "field_offset" : 4448,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "B2A",
     "field_offset" : 4480,
     "referenced_type" : "_ZTI9skcms_B2A"
    },
    {
     "field_name" : "has_CICP",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "CICP",
     "field_offset" : 7624,
     "referenced_type" : "_ZTI10skcms_CICP"
    }
   ],
   "linker_set_key" : "_ZTI16skcms_ICCProfile",
   "name" : "skcms_ICCProfile",
   "size" : 960,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17AndroidBitmapInfo",
   "name" : "AndroidBitmapInfo",
   "size" : 20,
   "source_file" : "frameworks/native/include/android/bitmap.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxAniso",
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "useCubic",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "cubic",
     "field_offset" : 64,
     "referenced_type" : "_ZTIK16SkCubicResampler"
    },
    {
     "field_name" : "filter",
     "field_offset" : 128,
     "referenced_type" : "_ZTIK12SkFilterMode"
    },
    {
     "field_name" : "mipmap",
     "field_offset" : 160,
     "referenced_type" : "_ZTIK12SkMipmapMode"
    }
   ],
   "linker_set_key" : "_ZTI17SkSamplingOptions",
   "name" : "SkSamplingOptions",
   "size" : 24,
   "source_file" : "external/skia/include/core/SkSamplingOptions.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "size" : 32,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDxE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDxE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFPxP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPxiE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPxE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKxE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvxE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "size" : 932,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8SkStream"
    }
   ],
   "linker_set_key" : "_ZTI18SkStreamRewindable",
   "name" : "SkStreamRewindable",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18SkStreamRewindable"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18SkStreamRewindableD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18SkStreamRewindableD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN18SkStreamRewindable6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK18SkStreamRewindable11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "size" : 32,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI18SkStreamRewindable"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mAAsset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP6AAsset"
    }
   ],
   "linker_set_key" : "_ZTI19AAssetStreamAdaptor",
   "name" : "AAssetStreamAdaptor",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "frameworks/base/native/graphics/jni/aassetstreamadaptor.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI19AAssetStreamAdaptor"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN19AAssetStreamAdaptorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN19AAssetStreamAdaptorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4seekEj"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN19AAssetStreamAdaptor13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "mangled_component_name" : "_ZNK19AAssetStreamAdaptor11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "size" : 12,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "size" : 36,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRX",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fRY",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fGX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fGY",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fBX",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fBY",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fWX",
     "field_offset" : 192,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fWY",
     "field_offset" : 224,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI21SkColorSpacePrimaries",
   "name" : "SkColorSpacePrimaries",
   "size" : 32,
   "source_file" : "external/skia/include/core/SkColorSpace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI9SkWStream"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fHead",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN22SkDynamicMemoryWStream5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "fTail",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN22SkDynamicMemoryWStream5BlockE"
    },
    {
     "access" : "private",
     "field_name" : "fBytesWrittenBeforeTail",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22SkDynamicMemoryWStream",
   "name" : "SkDynamicMemoryWStream",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI22SkDynamicMemoryWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStreamD0Ev"
    },
    {
     "mangled_component_name" : "_ZN22SkDynamicMemoryWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN9SkWStream5flushEv"
    },
    {
     "mangled_component_name" : "_ZNK22SkDynamicMemoryWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "a",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "c",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "e",
     "field_offset" : 160,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "f",
     "field_offset" : 192,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI22skcms_TransferFunction",
   "name" : "skcms_TransferFunction",
   "size" : 28,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI4stat",
   "name" : "stat",
   "size" : 104,
   "source_file" : "bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5iovec",
   "name" : "iovec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/uio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIP12SkColorSpace"
    }
   ],
   "linker_set_key" : "_ZTI5sk_spI12SkColorSpaceE",
   "name" : "sk_sp<SkColorSpace>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTI12SkColorSpace"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIP16SkPngChunkReader"
    }
   ],
   "linker_set_key" : "_ZTI5sk_spI16SkPngChunkReaderE",
   "name" : "sk_sp<SkPngChunkReader>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTI16SkPngChunkReader"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIP6SkData"
    }
   ],
   "linker_set_key" : "_ZTI5sk_spI6SkDataE",
   "name" : "sk_sp<SkData>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTI6SkData"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIPN7android6BitmapE"
    }
   ],
   "linker_set_key" : "_ZTI5sk_spIN7android6BitmapEE",
   "name" : "sk_sp<android::Bitmap>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "template_args" :
   [
    "_ZTIN7android6BitmapE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stx_mask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_blksize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_attributes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_nlink",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_uid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_gid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_mode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__spare0",
     "field_offset" : 240,
     "referenced_type" : "_ZTIA1_t"
    },
    {
     "field_name" : "stx_ino",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_blocks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_attributes_mask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_atime",
     "field_offset" : 512,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_btime",
     "field_offset" : 640,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_ctime",
     "field_offset" : 768,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_mtime",
     "field_offset" : 896,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_rdev_major",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_rdev_minor",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_major",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_minor",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_mnt_id",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_dio_mem_align",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dio_offset_align",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__spare3",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIA12_y"
    }
   ],
   "linker_set_key" : "_ZTI5statx",
   "name" : "statx",
   "size" : 256,
   "source_file" : "bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI10SkNVRefCntI6SkDataE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fReleaseProc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPKvPvE"
    },
    {
     "access" : "private",
     "field_name" : "fReleaseProcContext",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "fPtr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "fSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6SkData",
   "name" : "SkData",
   "record_kind" : "class",
   "size" : 20,
   "source_file" : "external/skia/include/core/SkData.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fState",
     "referenced_type" : "_ZTINSt3__16atomicIhEE"
    }
   ],
   "linker_set_key" : "_ZTI6SkOnce",
   "name" : "SkOnce",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/skia/include/private/base/SkOnce.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI6SkRect",
   "name" : "SkRect",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkRect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI6SkSize",
   "name" : "SkSize",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkSize.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPtr",
     "referenced_type" : "_ZTIPKN8SkCodecs7DecoderE"
    },
    {
     "access" : "private",
     "field_name" : "fSize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6SkSpanIKN8SkCodecs7DecoderEE",
   "name" : "SkSpan<const SkCodecs::Decoder>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/private/base/SkSpan_impl.h",
   "template_args" :
   [
    "_ZTIKN8SkCodecs7DecoderE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI6stat64",
   "name" : "stat64",
   "size" : 104,
   "source_file" : "bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTI13SkNoncopyable"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fEncodedInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIK13SkEncodedInfo"
    },
    {
     "access" : "private",
     "field_name" : "fSrcXformFormat",
     "field_offset" : 224,
     "referenced_type" : "_ZTI17skcms_PixelFormat"
    },
    {
     "access" : "private",
     "field_name" : "fStream",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__110unique_ptrI8SkStreamNS_14default_deleteIS1_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "fNeedsRewind",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "fOrigin",
     "field_offset" : 320,
     "referenced_type" : "_ZTIK15SkEncodedOrigin"
    },
    {
     "access" : "private",
     "field_name" : "fDstInfo",
     "field_offset" : 352,
     "referenced_type" : "_ZTI11SkImageInfo"
    },
    {
     "access" : "private",
     "field_name" : "fOptions",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN7SkCodec7OptionsE"
    },
    {
     "access" : "private",
     "field_name" : "fXformTime",
     "field_offset" : 640,
     "referenced_type" : "_ZTIN7SkCodec9XformTimeE"
    },
    {
     "access" : "private",
     "field_name" : "fDstXformFormat",
     "field_offset" : 672,
     "referenced_type" : "_ZTI17skcms_PixelFormat"
    },
    {
     "access" : "private",
     "field_name" : "fDstProfile",
     "field_offset" : 704,
     "referenced_type" : "_ZTI16skcms_ICCProfile"
    },
    {
     "access" : "private",
     "field_name" : "fDstXformAlphaFormat",
     "field_offset" : 8384,
     "referenced_type" : "_ZTI17skcms_AlphaFormat"
    },
    {
     "access" : "private",
     "field_name" : "fCurrScanline",
     "field_offset" : 8416,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "fStartedIncrementalDecode",
     "field_offset" : 8448,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "fUsingCallbackForHandleFrameIndex",
     "field_offset" : 8456,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI7SkCodec",
   "name" : "SkCodec",
   "record_kind" : "class",
   "size" : 1060,
   "source_file" : "external/skia/include/codec/SkCodec.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI7SkCodec"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7SkCodecD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7SkCodecD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec14getEncodedDataEv"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec16onGetGainmapInfoEP13SkGainmapInfoPNSt3__110unique_ptrI8SkStreamNS2_14default_deleteIS4_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec21onGetScaledDimensionsEf"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec21onDimensionsSupportedERK7SkISize"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7SkCodec18onGetEncodedFormatEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7SkCodec11onGetPixelsERK11SkImageInfoPvjRKNS_7OptionsEPi"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec15onQueryYUVAInfoERKN16SkYUVAPixmapInfo18SupportedDataTypesEPS0_"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec15onGetYUVAPlanesERK13SkYUVAPixmaps"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec16onGetValidSubsetEP7SkIRect"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec8onRewindEv"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec18onGetScanlineOrderEv"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec16onOutputScanlineEi"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec19conversionSupportedERK11SkImageInfobb"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec14usesColorXformEv"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec15onGetFrameCountEv"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec14onGetFrameInfoEiPNS_9FrameInfoE"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec20onGetRepetitionCountEv"
    },
    {
     "mangled_component_name" : "_ZNK7SkCodec14getFrameHolderEv"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec21onStartScanlineDecodeERK11SkImageInfoRKNS_7OptionsE"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec24onStartIncrementalDecodeERK11SkImageInfoPvjRKNS_7OptionsE"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec19onIncrementalDecodeEPi"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec15onSkipScanlinesEi"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec14onGetScanlinesEPvij"
    },
    {
     "mangled_component_name" : "_ZN7SkCodec10getSamplerEb"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fLeft",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fTop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fRight",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fBottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7SkIRect",
   "name" : "SkIRect",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkRect.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fWidth",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fHeight",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7SkISize",
   "name" : "SkISize",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkSize.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI7SkPoint",
   "name" : "SkPoint",
   "size" : 8,
   "source_file" : "external/skia/include/private/base/SkPoint_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7flock64",
   "name" : "flock64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fX",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fY",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8SkIPoint",
   "name" : "SkIPoint",
   "size" : 8,
   "source_file" : "external/skia/include/private/base/SkPoint_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fMat",
     "referenced_type" : "_ZTIA9_f"
    },
    {
     "access" : "private",
     "field_name" : "fTypeMask",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8SkMatrix",
   "name" : "SkMatrix",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "external/skia/include/core/SkMatrix.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fPixels",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "fRowBytes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "fInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11SkImageInfo"
    }
   ],
   "linker_set_key" : "_ZTI8SkPixmap",
   "name" : "SkPixmap",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "external/skia/include/core/SkPixmap.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI8SkRGBA4fIL11SkAlphaType2EE",
   "name" : "SkRGBA4f<kPremul_SkAlphaType>",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkColor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fR",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fG",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fB",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "fA",
     "field_offset" : 96,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI8SkRGBA4fIL11SkAlphaType3EE",
   "name" : "SkRGBA4f<kUnpremul_SkAlphaType>",
   "size" : 16,
   "source_file" : "external/skia/include/core/SkColor.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI12SkRefCntBase"
    }
   ],
   "linker_set_key" : "_ZTI8SkRefCnt",
   "name" : "SkRefCnt",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/skia/include/core/SkRefCnt.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkRefCnt"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkRefCntD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK12SkRefCntBase16internal_disposeEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI8SkStream",
   "name" : "SkStream",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8SkStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8SkStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8SkStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8SkStream4readEPvj"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream4peekEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK8SkStream7isAtEndEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream6rewindEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11hasPositionEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11getPositionEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4seekEj"
    },
    {
     "mangled_component_name" : "_ZN8SkStream4moveEl"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9hasLengthEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream9getLengthEv"
    },
    {
     "mangled_component_name" : "_ZN8SkStream13getMemoryBaseEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream7getDataEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream11onDuplicateEv"
    },
    {
     "mangled_component_name" : "_ZNK8SkStream6onForkEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "mode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "resolve",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI8open_how",
   "name" : "open_how",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/openat2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/timespec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 64,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10sigcontext"
    },
    {
     "field_offset" : 832,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_regspace",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIA128_m"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "size" : 744,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA32_y"
    },
    {
     "field_name" : "fpscr",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8user_vfp",
   "name" : "user_vfp",
   "size" : 264,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI9SkWStream",
   "name" : "SkWStream",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkStream.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI9SkWStream"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9SkWStreamD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9SkWStreamD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9SkWStream5writeEPKvj"
    },
    {
     "mangled_component_name" : "_ZN9SkWStream5flushEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9SkWStream12bytesWrittenEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI9imaxdiv_t",
   "name" : "imaxdiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/inttypes.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI9mallinfo2",
   "name" : "mallinfo2",
   "size" : 40,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "input_curves",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_11skcms_Curve"
    },
    {
     "field_name" : "grid_points",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "grid_8",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "grid_16",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "matrix_channels",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "matrix_curves",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIA3_11skcms_Curve"
    },
    {
     "field_name" : "matrix",
     "field_offset" : 1952,
     "referenced_type" : "_ZTI15skcms_Matrix3x4"
    },
    {
     "field_name" : "output_channels",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "output_curves",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIA3_11skcms_Curve"
    }
   ],
   "linker_set_key" : "_ZTI9skcms_A2B",
   "name" : "skcms_A2B",
   "size" : 392,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input_channels",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "input_curves",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA3_11skcms_Curve"
    },
    {
     "field_name" : "matrix_channels",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "matrix",
     "field_offset" : 832,
     "referenced_type" : "_ZTI15skcms_Matrix3x4"
    },
    {
     "field_name" : "matrix_curves",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIA3_11skcms_Curve"
    },
    {
     "field_name" : "output_channels",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "grid_points",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "grid_8",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "grid_16",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "output_curves",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIA4_11skcms_Curve"
    }
   ],
   "linker_set_key" : "_ZTI9skcms_B2A",
   "name" : "skcms_B2A",
   "size" : 392,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_m"
    }
   ],
   "linker_set_key" : "_ZTI9user_regs",
   "name" : "user_regs",
   "size" : 72,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(unnamed)",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_trapno",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    },
    {
     "field_name" : "_perf",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)",
   "record_kind" : "union",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_data",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "table_entries",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "table_8",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "table_16",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11skcms_CurveUt0_E",
   "name" : "skcms_Curve::(anonymous)",
   "size" : 12,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "alias_of_table_entries",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parametric",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22skcms_TransferFunction"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11skcms_CurveUt_E",
   "name" : "skcms_Curve::(anonymous)",
   "size" : 32,
   "source_file" : "external/skia/modules/skcms/src/skcms_public.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "bit_width" : 1,
     "field_name" : "sign1",
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 15,
     "field_name" : "unused",
     "field_offset" : 1,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "sign2",
     "field_offset" : 16,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 14,
     "field_name" : "exponent",
     "field_offset" : 17,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "j",
     "field_offset" : 31,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 31,
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 32,
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN11user_fpregs6fp_regE",
   "name" : "user_fpregs::fp_reg",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fProfile",
     "referenced_type" : "_ZTI16skcms_ICCProfile"
    },
    {
     "access" : "private",
     "field_name" : "fData",
     "field_offset" : 7680,
     "referenced_type" : "_ZTI5sk_spI6SkDataE"
    }
   ],
   "linker_set_key" : "_ZTIN13SkEncodedInfo10ICCProfileE",
   "name" : "SkEncodedInfo::ICCProfile",
   "record_kind" : "class",
   "size" : 964,
   "source_file" : "external/skia/include/private/SkEncodedInfo.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7SkCodec7OptionsE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "fSampleSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN14SkAndroidCodec14AndroidOptionsE",
   "name" : "SkAndroidCodec::AndroidOptions",
   "size" : 20,
   "source_file" : "external/skia/include/codec/SkAndroidCodec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fDataTypeSupport",
     "referenced_type" : "_ZTINSt3__16bitsetILj16EEE"
    }
   ],
   "linker_set_key" : "_ZTIN16SkYUVAPixmapInfo18SupportedDataTypesE",
   "name" : "SkYUVAPixmapInfo::SupportedDataTypes",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/skia/include/core/SkYUVAPixmaps.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN18__kernel_sigactionUt_E",
   "name" : "__kernel_sigaction::(unnamed)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fZeroInitialized",
     "referenced_type" : "_ZTIN7SkCodec15ZeroInitializedE"
    },
    {
     "field_name" : "fSubset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPK7SkIRect"
    },
    {
     "field_name" : "fFrameIndex",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fPriorFrame",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7SkCodec7OptionsE",
   "name" : "SkCodec::Options",
   "size" : 16,
   "source_file" : "external/skia/include/codec/SkCodec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fRequiredFrame",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fDuration",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fFullyReceived",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "fAlphaType",
     "field_offset" : 96,
     "referenced_type" : "_ZTI11SkAlphaType"
    },
    {
     "field_name" : "fHasAlphaWithinBounds",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "fDisposalMethod",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN16SkCodecAnimation14DisposalMethodE"
    },
    {
     "field_name" : "fBlend",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN16SkCodecAnimation5BlendE"
    },
    {
     "field_name" : "fFrameRect",
     "field_offset" : 224,
     "referenced_type" : "_ZTI7SkIRect"
    }
   ],
   "linker_set_key" : "_ZTIN7SkCodec9FrameInfoE",
   "name" : "SkCodec::FrameInfo",
   "size" : 44,
   "source_file" : "external/skia/include/codec/SkCodec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "L",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "a",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "b",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android10uirenderer3LabE",
   "name" : "android::uirenderer::Lab",
   "size" : 12,
   "source_file" : "frameworks/base/libs/hwui/utils/Color.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mCodec",
     "referenced_type" : "_ZTINSt3__110unique_ptrI14SkAndroidCodecNS_14default_deleteIS1_EEEE"
    },
    {
     "field_name" : "mPeeker",
     "field_offset" : 32,
     "referenced_type" : "_ZTI5sk_spI16SkPngChunkReaderE"
    },
    {
     "access" : "private",
     "field_name" : "mTargetSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7SkISize"
    },
    {
     "access" : "private",
     "field_name" : "mDecodeSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7SkISize"
    },
    {
     "access" : "private",
     "field_name" : "mOutColorType",
     "field_offset" : 192,
     "referenced_type" : "_ZTI11SkColorType"
    },
    {
     "access" : "private",
     "field_name" : "mUnpremultipliedRequired",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOutColorSpace",
     "field_offset" : 256,
     "referenced_type" : "_ZTI5sk_spI12SkColorSpaceE"
    },
    {
     "access" : "private",
     "field_name" : "mOptions",
     "field_offset" : 288,
     "referenced_type" : "_ZTIN14SkAndroidCodec14AndroidOptionsE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentFrameIsIndependent",
     "field_offset" : 448,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentFrameIsOpaque",
     "field_offset" : 456,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHandleRestorePrevious",
     "field_offset" : 464,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRestoreState",
     "field_offset" : 480,
     "referenced_type" : "_ZTIN7android12ImageDecoder12RestoreStateE"
    },
    {
     "access" : "private",
     "field_name" : "mRestoreFrame",
     "field_offset" : 512,
     "referenced_type" : "_ZTI5sk_spIN7android6BitmapEE"
    },
    {
     "access" : "private",
     "field_name" : "mCropRect",
     "field_offset" : 544,
     "referenced_type" : "_ZTINSt3__18optionalI7SkIRectEE"
    },
    {
     "access" : "private",
     "field_name" : "mOverrideOrigin",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__18optionalI15SkEncodedOriginEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12ImageDecoderE",
   "name" : "android::ImageDecoder",
   "record_kind" : "class",
   "size" : 96,
   "source_file" : "frameworks/base/libs/hwui/hwui/ImageDecoder.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBitmap",
     "referenced_type" : "_ZTIP7ABitmap"
    }
   ],
   "linker_set_key" : "_ZTIN7android8graphics6BitmapE",
   "name" : "android::graphics::Bitmap",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "frameworks/base/libs/hwui/apex/include/android/graphics/bitmap.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous)",
   "record_kind" : "union",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous)::(anonymous)",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
    },
    {
     "field_name" : "isFormat",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFbPKvjE"
    },
    {
     "field_name" : "makeFromStream",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFNSt3__110unique_ptrI7SkCodecNS_14default_deleteIS1_EEEENS0_I8SkStreamNS2_IS5_EEEEPNS1_6ResultEPvE"
    }
   ],
   "linker_set_key" : "_ZTIN8SkCodecs7DecoderE",
   "name" : "SkCodecs::Decoder",
   "size" : 16,
   "source_file" : "external/skia/include/codec/SkCodec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA13_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(unnamed)",
   "record_kind" : "union",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(unnamed)::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN8ucontextUt_Ut_E"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__padding_rt_sigset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_Ut_E",
   "name" : "ucontext::(anonymous)::(anonymous)",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILj12ELj8EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS2_7OptionsEiEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS2_7OptionsEiEEE",
   "name" : "std::__function::__value_func<Result (const SkImageInfo &, void *, unsigned int, const Options &, int)>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS_7OptionsEiE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS2_7OptionsEiEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<Result (const SkImageInfo &, void *, unsigned int, const Options &, int)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS_7OptionsEiE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS2_7OptionsEiEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<Result (const SkImageInfo &, void *, unsigned int, const Options &, int)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFN7SkCodec6ResultERK11SkImageInfoPvjRKNS_7OptionsEiE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj0EEE",
   "name" : "std::__get_pair<0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILj1EEE",
   "name" : "std::__get_pair<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkFILEStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamAsset>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI13SkStreamAssetEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI14SkAndroidCodecEEEE",
   "name" : "std::__identity<std::default_delete<SkAndroidCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkAndroidCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkMemoryStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkMemoryStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamMemory>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkStreamMemoryEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamSeekable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI16SkStreamSeekableEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::__identity<std::default_delete<SkStreamRewindable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI19AAssetStreamAdaptorEEEE",
   "name" : "std::__identity<std::default_delete<AAssetStreamAdaptor>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI19AAssetStreamAdaptorEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI7SkCodecEEEE",
   "name" : "std::__identity<std::default_delete<SkCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI7SkCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::__identity<std::default_delete<SkStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI8SkStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEEEE",
   "name" : "std::__identity<std::default_delete<SkEncodedInfo::ICCProfile>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIiJRKNS_12__tuple_leafILj0EiLb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILj0EiLb0EEES4_EEEEJNS_16is_constructibleIiJRKS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<0, int, false>, std::__tuple_leaf<0, int, false>>>, is_constructible<int, const __tuple_leaf<0, int, false> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj0EiLb0EEES3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIiJNS_12__tuple_leafILj0EiLb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILj0EiLb0EEES4_EEEEJNS_16is_constructibleIiJS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<0, int, false>, std::__tuple_leaf<0, int, false>>>, is_constructible<int, __tuple_leaf<0, int, false>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj0EiLb0EEES3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIiJRKNS_12__tuple_leafILj1EiLb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILj1EiLb0EEES4_EEEEJNS_16is_constructibleIiJRKS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<1, int, false>, std::__tuple_leaf<1, int, false>>>, is_constructible<int, const __tuple_leaf<1, int, false> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj1EiLb0EEES3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleIiJNS_12__tuple_leafILj1EiLb0EEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_12__tuple_leafILj1EiLb0EEES4_EEEEJNS_16is_constructibleIiJS4_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::__tuple_leaf<1, int, false>, std::__tuple_leaf<1, int, false>>>, is_constructible<int, __tuple_leaf<1, int, false>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj1EiLb0EEES3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb1EJNS_13__invokable_rIvRDnJRK11SkImageInfoPvjRKN7SkCodec7OptionsEiEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb1EEEJNS_13__invokable_rIvRDnJRK11SkImageInfoPvjRKN7SkCodec7OptionsEiEEEEEE",
   "name" : "std::__lazy_and<std::integral_constant<bool, true>, __invokable_r<void, std::nullptr_t &, const SkImageInfo &, void *, unsigned int, const Options &, int>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117integral_constantIbLb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj0EiLb0EEES3_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::__tuple_leaf<0, int, false>, std::__tuple_leaf<0, int, false>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_12__tuple_leafILj0EiLb0EEES2_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_12__tuple_leafILj1EiLb0EEES3_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::__tuple_leaf<1, int, false>, std::__tuple_leaf<1, int, false>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_12__tuple_leafILj1EiLb0EEES2_EE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerI11SkAlphaTypeEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerI11SkAlphaTypeEE",
   "name" : "std::is_pointer<SkAlphaType>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI11SkAlphaType"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerI15SkEncodedOriginEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerI15SkEncodedOriginEE",
   "name" : "std::is_pointer<SkEncodedOrigin>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI15SkEncodedOrigin"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerI7SkIRectEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerI7SkIRectEE",
   "name" : "std::is_pointer<SkIRect>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI7SkIRect"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI12SkFILEStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkFILEStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI13SkStreamAssetEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI13SkStreamAssetEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamAsset>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI13SkStreamAssetEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI14SkAndroidCodecEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkAndroidCodecEEEE",
   "name" : "std::is_pointer<std::default_delete<SkAndroidCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkAndroidCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI14SkMemoryStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkMemoryStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkMemoryStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkMemoryStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI14SkStreamMemoryEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI14SkStreamMemoryEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamMemory>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkStreamMemoryEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI16SkStreamSeekableEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI16SkStreamSeekableEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamSeekable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI16SkStreamSeekableEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI18SkStreamRewindableEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStreamRewindable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI19AAssetStreamAdaptorEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI19AAssetStreamAdaptorEEEE",
   "name" : "std::is_pointer<std::default_delete<AAssetStreamAdaptor>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI19AAssetStreamAdaptorEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI7SkCodecEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI7SkCodecEEEE",
   "name" : "std::is_pointer<std::default_delete<SkCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI7SkCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteI8SkStreamEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteI8SkStreamEEEE",
   "name" : "std::is_pointer<std::default_delete<SkStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI8SkStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEEEE",
   "name" : "std::is_pointer<std::default_delete<SkEncodedInfo::ICCProfile>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDuEE",
   "name" : "std::is_trivial<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTIP7__sFILE"
    },
    {
     "access" : "private",
     "field_name" : "__cntrl_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPNSt3__119__shared_weak_countE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110shared_ptrI7__sFILEEE",
   "name" : "std::shared_ptr<__sFILE>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI7__sFILE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI12SkFILEStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkFILEStream, std::default_delete<SkFILEStream>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI12SkFILEStream",
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI13SkStreamAssetNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamAsset, std::default_delete<SkStreamAsset>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI13SkStreamAsset",
    "_ZTINSt3__114default_deleteI13SkStreamAssetEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14SkAndroidCodecNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkAndroidCodec, std::default_delete<SkAndroidCodec>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI14SkAndroidCodec",
    "_ZTINSt3__114default_deleteI14SkAndroidCodecEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14SkMemoryStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkMemoryStream, std::default_delete<SkMemoryStream>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI14SkMemoryStream",
    "_ZTINSt3__114default_deleteI14SkMemoryStreamEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI14SkStreamMemoryNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamMemory, std::default_delete<SkStreamMemory>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI14SkStreamMemory",
    "_ZTINSt3__114default_deleteI14SkStreamMemoryEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI16SkStreamSeekableNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamSeekable, std::default_delete<SkStreamSeekable>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI16SkStreamSeekable",
    "_ZTINSt3__114default_deleteI16SkStreamSeekableEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI18SkStreamRewindableNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStreamRewindable, std::default_delete<SkStreamRewindable>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI18SkStreamRewindable",
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI19AAssetStreamAdaptorNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<AAssetStreamAdaptor, std::default_delete<AAssetStreamAdaptor>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI19AAssetStreamAdaptor",
    "_ZTINSt3__114default_deleteI19AAssetStreamAdaptorEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP7SkCodecNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI7SkCodecNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkCodec, std::default_delete<SkCodec>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI7SkCodec",
    "_ZTINSt3__114default_deleteI7SkCodecEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrI8SkStreamNS_14default_deleteIS1_EEEE",
   "name" : "std::unique_ptr<SkStream, std::default_delete<SkStream>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI8SkStream",
    "_ZTINSt3__114default_deleteI8SkStreamEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE",
   "name" : "std::unique_ptr<SkEncodedInfo::ICCProfile, std::default_delete<SkEncodedInfo::ICCProfile>>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN13SkEncodedInfo10ICCProfileE",
    "_ZTINSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constI11SkAlphaTypeLb0EEE",
   "name" : "std::__add_const<SkAlphaType>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI11SkAlphaType"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constI15SkEncodedOriginLb0EEE",
   "name" : "std::__add_const<SkEncodedOrigin>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI15SkEncodedOrigin"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constI7SkIRectLb0EEE",
   "name" : "std::__add_const<SkIRect>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI7SkIRect"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIiLb0EEE",
   "name" : "std::__add_const<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDiEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDsEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDuEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char8_t>, int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDuEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIcEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEEiLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIwEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__nat>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__nat>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS_5__natEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__unique_ifI19AAssetStreamAdaptorEE",
   "name" : "std::__unique_if<AAssetStreamAdaptor>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTI19AAssetStreamAdaptor"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__unique_ifIN13SkEncodedInfo10ICCProfileEEE",
   "name" : "std::__unique_if<SkEncodedInfo::ICCProfile>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIN13SkEncodedInfo10ICCProfileE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerI11SkAlphaTypeEE",
   "name" : "std::add_pointer<SkAlphaType>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI11SkAlphaType"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerI15SkEncodedOriginEE",
   "name" : "std::add_pointer<SkEncodedOrigin>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI15SkEncodedOrigin"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerI7SkIRectEE",
   "name" : "std::add_pointer<SkIRect>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTI7SkIRect"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIDnEE",
   "name" : "std::add_pointer<std::nullptr_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIK11SkAlphaTypeEE",
   "name" : "std::add_pointer<const SkAlphaType>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIK11SkAlphaType"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIK11SkImageInfoEE",
   "name" : "std::add_pointer<const SkImageInfo>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIK11SkImageInfo"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIK15SkEncodedOriginEE",
   "name" : "std::add_pointer<const SkEncodedOrigin>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIK15SkEncodedOrigin"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIK7SkIRectEE",
   "name" : "std::add_pointer<const SkIRect>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIK7SkIRect"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkAndroidCodec *, std::default_delete<SkAndroidCodec>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<AAssetStreamAdaptor *, std::default_delete<AAssetStreamAdaptor>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP7SkCodecNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkCodec *, std::default_delete<SkCodec>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP7SkCodecNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS3_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<SkEncodedInfo::ICCProfile *, std::default_delete<SkEncodedInfo::ICCProfile>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkAndroidCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP7SkCodecLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI12SkFILEStreamEEEE",
   "name" : "std::add_pointer<std::default_delete<SkFILEStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI14SkAndroidCodecEEEE",
   "name" : "std::add_pointer<std::default_delete<SkAndroidCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI14SkAndroidCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI18SkStreamRewindableEEEE",
   "name" : "std::add_pointer<std::default_delete<SkStreamRewindable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI19AAssetStreamAdaptorEEEE",
   "name" : "std::add_pointer<std::default_delete<AAssetStreamAdaptor>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI19AAssetStreamAdaptorEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteI7SkCodecEEEE",
   "name" : "std::add_pointer<std::default_delete<SkCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteI7SkCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEEEE",
   "name" : "std::add_pointer<std::default_delete<SkEncodedInfo::ICCProfile>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkAndroidCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP7SkCodecLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP12SkFILEStreamEE",
   "name" : "std::add_pointer<SkFILEStream *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP12SkFILEStream"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP13SkStreamAssetEE",
   "name" : "std::add_pointer<SkStreamAsset *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP13SkStreamAsset"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14SkAndroidCodecEE",
   "name" : "std::add_pointer<SkAndroidCodec *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP14SkAndroidCodec"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14SkMemoryStreamEE",
   "name" : "std::add_pointer<SkMemoryStream *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP14SkMemoryStream"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP14SkStreamMemoryEE",
   "name" : "std::add_pointer<SkStreamMemory *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP14SkStreamMemory"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP16SkStreamSeekableEE",
   "name" : "std::add_pointer<SkStreamSeekable *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP16SkStreamSeekable"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP18SkStreamRewindableEE",
   "name" : "std::add_pointer<SkStreamRewindable *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP18SkStreamRewindable"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP19AAssetStreamAdaptorEE",
   "name" : "std::add_pointer<AAssetStreamAdaptor *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP19AAssetStreamAdaptor"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP7SkCodecEE",
   "name" : "std::add_pointer<SkCodec *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP7SkCodec"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIP8SkStreamEE",
   "name" : "std::add_pointer<SkStream *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP8SkStream"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIPN13SkEncodedInfo10ICCProfileEEE",
   "name" : "std::add_pointer<SkEncodedInfo::ICCProfile *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPN13SkEncodedInfo10ICCProfileE"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDuEE",
   "name" : "std::char_traits<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDiE5__natE",
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDsE5__natE",
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDuE5__natEDuEE",
   "name" : "std::conditional<false, std::pointer_traits<char8_t *>::__nat, char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDuE5__natE",
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPcE5__natE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPwE5__natE",
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_17integral_constantIbLb1EEENS1_IbLb0EEEEE",
   "name" : "std::conditional<false, std::integral_constant<bool, true>, std::integral_constant<bool, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117integral_constantIbLb1EEE",
    "_ZTINSt3__117integral_constantIbLb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_21__bit_const_referenceINS_8__bitsetILj0ELj0EEEEENS_15__bit_referenceIS3_Lb1EEEEE",
   "name" : "std::conditional<false, std::__bit_const_reference<std::__bitset<0, 0>>, std::__bit_reference<std::__bitset<0, 0>, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__bit_const_referenceINS_8__bitsetILj0ELj0EEEEE",
    "_ZTINSt3__115__bit_referenceINS_8__bitsetILj0ELj0EEELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPDnDnEE",
   "name" : "std::conditional<false, std::nullptr_t *, std::nullptr_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPDn",
    "_ZTIDn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPK11SkImageInfoS1_EE",
   "name" : "std::conditional<false, const SkImageInfo *, SkImageInfo>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPK11SkImageInfo",
    "_ZTI11SkImageInfo"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP12SkFILEStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>> *, std::__compressed_pair<SkFILEStream *, std::default_delete<SkFILEStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP12SkFILEStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP13SkStreamAssetNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>> *, std::__compressed_pair<SkStreamAsset *, std::default_delete<SkStreamAsset>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP13SkStreamAssetNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkAndroidCodec *, std::default_delete<SkAndroidCodec>> *, std::__compressed_pair<SkAndroidCodec *, std::default_delete<SkAndroidCodec>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP14SkAndroidCodecNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>> *, std::__compressed_pair<SkMemoryStream *, std::default_delete<SkMemoryStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP14SkMemoryStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>> *, std::__compressed_pair<SkStreamMemory *, std::default_delete<SkStreamMemory>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP14SkStreamMemoryNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>> *, std::__compressed_pair<SkStreamSeekable *, std::default_delete<SkStreamSeekable>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP16SkStreamSeekableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>> *, std::__compressed_pair<SkStreamRewindable *, std::default_delete<SkStreamRewindable>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP18SkStreamRewindableNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<AAssetStreamAdaptor *, std::default_delete<AAssetStreamAdaptor>> *, std::__compressed_pair<AAssetStreamAdaptor *, std::default_delete<AAssetStreamAdaptor>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP19AAssetStreamAdaptorNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP7SkCodecNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkCodec *, std::default_delete<SkCodec>> *, std::__compressed_pair<SkCodec *, std::default_delete<SkCodec>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP7SkCodecNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP7SkCodecNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIP8SkStreamNS_14default_deleteIS2_EEEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkStream *, std::default_delete<SkStream>> *, std::__compressed_pair<SkStream *, std::default_delete<SkStream>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE",
    "_ZTINSt3__117__compressed_pairIP8SkStreamNS_14default_deleteIS1_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_17__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS3_EEEES7_EE",
   "name" : "std::conditional<false, const std::__compressed_pair<SkEncodedInfo::ICCProfile *, std::default_delete<SkEncodedInfo::ICCProfile>> *, std::__compressed_pair<SkEncodedInfo::ICCProfile *, std::default_delete<SkEncodedInfo::ICCProfile>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__117__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE",
    "_ZTINSt3__117__compressed_pairIPN13SkEncodedInfo10ICCProfileENS_14default_deleteIS2_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true> *, std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkFILEStream *, 0, false> *, std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamAsset *, 0, false> *, std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkAndroidCodec *, 0, false> *, std::__compressed_pair_elem<SkAndroidCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkMemoryStream *, 0, false> *, std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamMemory *, 0, false> *, std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamSeekable *, 0, false> *, std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStreamRewindable *, 0, false> *, std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false> *, std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP7SkCodecLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkCodec *, 0, false> *, std::__compressed_pair_elem<SkCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkStream *, 0, false> *, std::__compressed_pair_elem<SkStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false> *, std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKjPjEE",
   "name" : "std::conditional<false, const unsigned int *, unsigned int *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKj",
    "_ZTIPj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI12SkFILEStreamEES3_EE",
   "name" : "std::conditional<false, std::default_delete<SkFILEStream> *, std::default_delete<SkFILEStream>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI12SkFILEStreamEE",
    "_ZTINSt3__114default_deleteI12SkFILEStreamEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI14SkAndroidCodecEES3_EE",
   "name" : "std::conditional<false, std::default_delete<SkAndroidCodec> *, std::default_delete<SkAndroidCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI14SkAndroidCodecEE",
    "_ZTINSt3__114default_deleteI14SkAndroidCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI18SkStreamRewindableEES3_EE",
   "name" : "std::conditional<false, std::default_delete<SkStreamRewindable> *, std::default_delete<SkStreamRewindable>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI18SkStreamRewindableEE",
    "_ZTINSt3__114default_deleteI18SkStreamRewindableEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI19AAssetStreamAdaptorEES3_EE",
   "name" : "std::conditional<false, std::default_delete<AAssetStreamAdaptor> *, std::default_delete<AAssetStreamAdaptor>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI19AAssetStreamAdaptorEE",
    "_ZTINSt3__114default_deleteI19AAssetStreamAdaptorEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteI7SkCodecEES3_EE",
   "name" : "std::conditional<false, std::default_delete<SkCodec> *, std::default_delete<SkCodec>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteI7SkCodecEE",
    "_ZTINSt3__114default_deleteI7SkCodecEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_14default_deleteIN13SkEncodedInfo10ICCProfileEEES4_EE",
   "name" : "std::conditional<false, std::default_delete<SkEncodedInfo::ICCProfile> *, std::default_delete<SkEncodedInfo::ICCProfile>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE",
    "_ZTINSt3__114default_deleteIN13SkEncodedInfo10ICCProfileEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkFILEStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI12SkFILEStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamAsset>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI13SkStreamAssetEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkAndroidCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkAndroidCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkMemoryStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkMemoryStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamMemory>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI14SkStreamMemoryEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamSeekable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI16SkStreamSeekableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStreamRewindable>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI18SkStreamRewindableEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true> *, std::__compressed_pair_elem<std::default_delete<AAssetStreamAdaptor>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI19AAssetStreamAdaptorEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkCodec>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI7SkCodecEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkStream>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteI8SkStreamEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEES6_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true> *, std::__compressed_pair_elem<std::default_delete<SkEncodedInfo::ICCProfile>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_14default_deleteIN13SkEncodedInfo10ICCProfileEEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkFILEStream *, 0, false> *, std::__compressed_pair_elem<SkFILEStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP12SkFILEStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamAsset *, 0, false> *, std::__compressed_pair_elem<SkStreamAsset *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP13SkStreamAssetLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkAndroidCodec *, 0, false> *, std::__compressed_pair_elem<SkAndroidCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkAndroidCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkMemoryStream *, 0, false> *, std::__compressed_pair_elem<SkMemoryStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkMemoryStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamMemory *, 0, false> *, std::__compressed_pair_elem<SkStreamMemory *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP14SkStreamMemoryLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamSeekable *, 0, false> *, std::__compressed_pair_elem<SkStreamSeekable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP16SkStreamSeekableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStreamRewindable *, 0, false> *, std::__compressed_pair_elem<SkStreamRewindable *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP18SkStreamRewindableLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false> *, std::__compressed_pair_elem<AAssetStreamAdaptor *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP19AAssetStreamAdaptorLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP7SkCodecLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkCodec *, 0, false> *, std::__compressed_pair_elem<SkCodec *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP7SkCodecLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIP8SkStreamLi0ELb0EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkStream *, 0, false> *, std::__compressed_pair_elem<SkStream *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIP8SkStreamLi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEES5_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false> *, std::__compressed_pair_elem<SkEncodedInfo::ICCProfile *, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemIPN13SkEncodedInfo10ICCProfileELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP12SkFILEStreamS2_EE",
   "name" : "std::conditional<false, SkFILEStream **, SkFILEStream *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPP12SkFILEStream",
    "_ZTIP12SkFILEStream"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP13SkStreamAssetS2_EE",
   "name" : "std::conditional<false, SkStreamAsset **, SkStreamAsset *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPP13SkStreamAsset",
    "_ZTIP13SkStreamAsset"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14SkAndroidCodecS2_EE",
   "name" : "std::conditional<false, SkAndroidCodec **, SkAndroidCodec *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPP14SkAndroidCodec",
    "_ZTIP14SkAndroidCodec"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14SkMemoryStreamS2_EE",
   "name" : "std::conditional<false, SkMemoryStream **, SkMemoryStream *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPP14SkMemoryStream",
    "_ZTIP14SkMemoryStream"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPP14SkStreamMemoryS2_EE",
   "name" : "std::conditional<false, SkStreamMemory **, SkStreamMemory *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
