{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char[1024]",
   "referenced_type" : "_ZTIc",
   "size" : 1024,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_c",
   "name" : "char[128]",
   "referenced_type" : "_ZTIc",
   "size" : 128,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_PKc",
   "name" : "const char *[12]",
   "referenced_type" : "_ZTIPKc",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA13_c",
   "name" : "char[13]",
   "referenced_type" : "_ZTIc",
   "size" : 13,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA14_c",
   "name" : "char[14]",
   "referenced_type" : "_ZTIc",
   "size" : 14,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA15_c",
   "name" : "char[15]",
   "referenced_type" : "_ZTIc",
   "size" : 15,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA18_c",
   "name" : "char[18]",
   "referenced_type" : "_ZTIc",
   "size" : 18,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA19_c",
   "name" : "char[19]",

   "is_const" : true,
   "linker_set_key" : "_ZTIKPKN3art7DexFileE",
   "name" : "const art::DexFile *const",
   "referenced_type" : "_ZTIPKN3art7DexFileE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKh",
   "name" : "const unsigned char *const",
   "referenced_type" : "_ZTIPKh",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKj",
   "name" : "const unsigned int *const",
   "referenced_type" : "_ZTIPKj",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKt",
   "name" : "const unsigned short *const",
   "referenced_type" : "_ZTIPKt",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "size" : 1,
   "source_file" : "art/libartbase/base/array_ref.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "path",
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_dir_and_contents_",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI12TemporaryDir",
   "name" : "TemporaryDir",
   "record_kind" : "class",
   "size" : 1025,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "path",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1024_c"
    },
    {
     "access" : "private",
     "field_name" : "remove_file_",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI13TemporaryFile",
   "name" : "TemporaryFile",
   "record_kind" : "class",
   "size" : 1032,
   "source_file" : "system/libbase/include/android-base/file.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "size" : 32,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPcE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDxE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPcE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDxE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFPxP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPxiE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPxE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKxE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvxE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "size" : 932,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art10FreeDeleteE",
   "name" : "art::FreeDelete",
   "size" : 1,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handle_",
     "referenced_type" : "_ZTIP10ZipArchive"
    }
   ],
   "linker_set_key" : "_ZTIN3art10ZipArchiveE",
   "name" : "art::ZipArchive",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libartbase/base/zip_archive.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "element_width",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "element_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA_Kh"
    }
   ],
   "linker_set_key" : "_ZTIN3art11Instruction16ArrayDataPayloadE",
   "name" : "art::Instruction::ArrayDataPayload",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "case_count",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "first_key",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "targets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA_Ki"
    }
   ],
   "linker_set_key" : "_ZTIN3art11Instruction19PackedSwitchPayloadE",
   "name" : "art::Instruction::PackedSwitchPayload",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "case_count",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKt"
    },
    {
     "field_name" : "keys_and_targets",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA_Ki"
    }
   ],
   "linker_set_key" : "_ZTIN3art11Instruction19SparseSwitchPayloadE",
   "name" : "art::Instruction::SparseSwitchPayload",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "verify_flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art11Instruction6FormatE"
    },
    {
     "field_name" : "index_type",
     "field_offset" : 40,
     "referenced_type" : "_ZTIN3art11Instruction9IndexTypeE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "size_in_code_units",
     "field_offset" : 56,
     "referenced_type" : "_ZTIa"
    }
   ],
   "linker_set_key" : "_ZTIN3art11Instruction21InstructionDescriptorE",
   "name" : "art::Instruction::InstructionDescriptor",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11InstructionE",
   "name" : "art::Instruction",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11ScopedTraceE",
   "name" : "art::ScopedTrace",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11ValueObjectE",
   "name" : "art::ValueObject",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/value_object.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "msg_",
     "referenced_type" : "_ZTINSt3__17variantIJN7android4base10LogMessageENS_19basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art11VlogMessageE",
   "name" : "art::VlogMessage",
   "record_kind" : "class",
   "size" : 140,
   "source_file" : "art/libartbase/base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art11VoidFunctorE",
   "name" : "art::VoidFunctor",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/utils.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "class_linker",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "collector",
     "field_offset" : 8,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "compiler",
     "field_offset" : 16,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "deopt",
     "field_offset" : 24,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "gc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "heap",
     "field_offset" : 40,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "interpreter",
     "field_offset" : 48,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "jdwp",
     "field_offset" : 56,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "jit",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "jni",
     "field_offset" : 72,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "monitor",
     "field_offset" : 80,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "oat",
     "field_offset" : 88,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "profiler",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "signals",
     "field_offset" : 104,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "simulator",
     "field_offset" : 112,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "startup",
     "field_offset" : 120,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "third_party_jni",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "threads",
     "field_offset" : 136,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "verifier",
     "field_offset" : 144,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "verifier_debug",
     "field_offset" : 152,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "image",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "systrace_lock_logging",
     "field_offset" : 168,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "agents",
     "field_offset" : 176,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "dex",
     "field_offset" : 184,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "plugin",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art12LogVerbosityE",
   "name" : "art::LogVerbosity",
   "size" : 25,
   "source_file" : "art/libartbase/base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3art13ClassAccessor5FieldE"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "partition_pos_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "iterator_end_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_5FieldEEE",
   "name" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Field>",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "art/libdexfile/dex/class_accessor.h",
   "template_args" :
   [
    "_ZTIN3art13ClassAccessor5FieldE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3art13ClassAccessor6MethodE"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "partition_pos_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "iterator_end_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_6MethodEEE",
   "name" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Method>",
   "record_kind" : "class",
   "size" : 44,
   "source_file" : "art/libdexfile/dex/class_accessor.h",
   "template_args" :
   [
    "_ZTIN3art13ClassAccessor6MethodE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art13ClassAccessor8BaseItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "is_static_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessor5FieldE",
   "name" : "art::ClassAccessor::Field",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libdexfile/dex/class_accessor.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art13ClassAccessor8BaseItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "is_static_or_direct_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "code_off_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessor6MethodE",
   "name" : "art::ClassAccessor::Method",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "art/libdexfile/dex/class_accessor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_pos_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_ptr_pos_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "index_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "access_flags_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_flags_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessor8BaseItemE",
   "name" : "art::ClassAccessor::BaseItem",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/class_accessor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "class_def_index_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_pos_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_ptr_pos_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "num_static_fields_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "num_instance_fields_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "num_direct_methods_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "num_virtual_methods_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassAccessorE",
   "name" : "art::ClassAccessor",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "art/libdexfile/dex/class_accessor.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3art17ClassIteratorDataE"
    }
   ],
   "linker_set_key" : "_ZTIN3art13ClassIteratorE",
   "name" : "art::ClassIterator",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/class_iterator.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "file_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN9unix_file6FdFileE"
    },
    {
     "access" : "protected",
     "field_name" : "owned_file_",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__18optionalIN9unix_file6FdFileEEE"
    },
    {
     "access" : "protected",
     "field_name" : "root_container_",
     "field_offset" : 416,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3art16DexFileContainerEEE"
    },
    {
     "access" : "protected",
     "field_name" : "location_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art13DexFileLoaderE",
   "name" : "art::DexFileLoader",
   "record_kind" : "class",
   "size" : 72,
   "source_file" : "art/libdexfile/dex/dex_file_loader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art13DexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "feature_flags_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_pos_",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_table_offset_",
     "field_offset" : 960,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_base_",
     "field_offset" : 992,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_begin_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_end_",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile6HeaderE",
   "name" : "art::CompactDexFile::Header",
   "record_kind" : "class",
   "size" : 136,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fields_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_count_and_flags_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFile8CodeItemE",
   "name" : "art::CompactDexFile::CodeItem",
   "size" : 6,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_",
     "field_offset" : 800,
     "referenced_type" : "_ZTIN3art18CompactOffsetTable8AccessorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14CompactDexFileE",
   "name" : "art::CompactDexFile",
   "record_kind" : "class",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/compact_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art14CompactDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art14DefaultEmptyFnINSt3__112basic_stringIcNS1_11char_traitsIcEENS1_9allocatorIcEEEEEE",
   "name" : "art::DefaultEmptyFn<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/hash_set.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_5FieldEEE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_5FieldEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_13ClassAccessor12DataIteratorINS1_5FieldEEEEE",
   "name" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Field>>",
   "record_kind" : "class",
   "size" : 80,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art13ClassAccessor12DataIteratorINS0_5FieldEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_6MethodEEE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIN3art13ClassAccessor12DataIteratorINS0_6MethodEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_13ClassAccessor12DataIteratorINS1_6MethodEEEEE",
   "name" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Method>>",
   "record_kind" : "class",
   "size" : 88,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art13ClassAccessor12DataIteratorINS0_6MethodEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art13ClassIteratorE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art13ClassIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_13ClassIteratorEEE",
   "name" : "art::IterationRange<art::ClassIterator>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art13ClassIteratorE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3art15SplitStringIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_15SplitStringIterEEE",
   "name" : "art::IterationRange<art::SplitStringIter>",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art15SplitStringIterE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art22DexInstructionIteratorE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art22DexInstructionIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_22DexInstructionIteratorEEE",
   "name" : "art::IterationRange<art::DexInstructionIterator>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art22DexInstructionIteratorE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIN3art9CountIterE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art9CountIterE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeINS_9CountIterEEE",
   "name" : "art::IterationRange<art::CountIter>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIN3art9CountIterE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "_ZTIPKN3art3dex7TryItemE"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN3art3dex7TryItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14IterationRangeIPKNS_3dex7TryItemEEE",
   "name" : "art::IterationRange<const art::dex::TryItem *>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libartbase/base/iteration_range.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7TryItemE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art16DexFileReferenceE"
    }
   ],
   "linker_set_key" : "_ZTIN3art14ProtoReferenceE",
   "name" : "art::ProtoReference",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/proto_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "hash_set_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN3art7HashSetINSt3__14pairIjtEENS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS5_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS8_EENS1_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15HashSetIteratorINSt3__14pairIjtEENS_7HashSetIS3_NS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS6_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS9_EENS1_9allocatorIS3_EEEEEE",
   "name" : "art::HashSetIterator<std::pair<unsigned int, unsigned short>, art::HashSet<std::pair<unsigned int, unsigned short>, art::dex::DexFileVerifier::OffsetTypeMapEmptyFn, art::HashMapHashWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, art::HashMapPredWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, std::allocator<std::pair<unsigned int, unsigned short>>>>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libartbase/base/hash_set.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIjtEE",
    "_ZTIN3art7HashSetINSt3__14pairIjtEENS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS5_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS8_EENS1_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art16DexFileReferenceE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15MethodReferenceE",
   "name" : "art::MethodReference",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/method_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "cur_index_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "split_on_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    },
    {
     "access" : "private",
     "field_name" : "sv_",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15SplitStringIterE",
   "name" : "art::SplitStringIter",
   "size" : 16,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile6HeaderE",
   "name" : "art::StandardDexFile::Header",
   "record_kind" : "class",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8CodeItemE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_t"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFile8CodeItemE",
   "name" : "art::StandardDexFile::CodeItem",
   "size" : 20,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFileE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15StandardDexFileE",
   "name" : "art::StandardDexFile",
   "record_kind" : "class",
   "size" : 100,
   "source_file" : "art/libdexfile/dex/standard_dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art15StandardDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "str_offset_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art15TypeLookupTable5EntryE",
   "name" : "art::TypeLookupTable::Entry",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/type_lookup_table.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_data_begin_",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "mask_bits_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "entries_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKN3art15TypeLookupTable5EntryE"
    },
    {
     "access" : "private",
     "field_name" : "owned_entries_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__110unique_ptrIA_N3art15TypeLookupTable5EntryENS_14default_deleteIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art15TypeLookupTableE",
   "name" : "art::TypeLookupTable",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/type_lookup_table.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art13DexFileLoaderE"
    }
   ],
   "linker_set_key" : "_ZTIN3art16ArtDexFileLoaderE",
   "name" : "art::ArtDexFileLoader",
   "record_kind" : "class",
   "size" : 72,
   "source_file" : "art/libdexfile/dex/art_dex_file_loader.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16ArtDexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16ArtDexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16ArtDexFileLoaderD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "is_zip_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art16DexFileContainerE",
   "name" : "art::DexFileContainer",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16DexFileContainerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art16DexFileContainer10IsReadOnlyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer11EnableWriteEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer12DisableWriteEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art16DexFileContainer5BeginEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art16DexFileContainer3EndEv"
    },
    {
     "mangled_component_name" : "_ZNK3art16DexFileContainer4DataEv"
    },
    {
     "mangled_component_name" : "_ZNK3art16DexFileContainer9IsFileMapEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art16DexFileReference10ComparatorE",
   "name" : "art::DexFileReference::Comparator",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dex_file",
     "referenced_type" : "_ZTIPKN3art7DexFileE"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art16DexFileReferenceE",
   "name" : "art::DexFileReference",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_offset_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "end_offset_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art16DexLayoutSection10SubsectionE",
   "name" : "art::DexLayoutSection::Subsection",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_layout.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "parts_",
     "referenced_type" : "_ZTIA5_N3art16DexLayoutSection10SubsectionE"
    }
   ],
   "linker_set_key" : "_ZTIN3art16DexLayoutSectionE",
   "name" : "art::DexLayoutSection",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "art/libdexfile/dex/dex_file_layout.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "class_def_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art17ClassIteratorDataE",
   "name" : "art::ClassIteratorData",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/class_iterator.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sections_",
     "referenced_type" : "_ZTIA2_N3art16DexLayoutSectionE"
    }
   ],
   "linker_set_key" : "_ZTIN3art17DexLayoutSectionsE",
   "name" : "art::DexLayoutSections",
   "record_kind" : "class",
   "size" : 80,
   "source_file" : "art/libdexfile/dex/dex_file_layout.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "table_",
     "referenced_type" : "_ZTIKPKj"
    },
    {
     "access" : "private",
     "field_name" : "minimum_offset_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "data_begin_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKh"
    }
   ],
   "linker_set_key" : "_ZTIN3art18CompactOffsetTable8AccessorE",
   "name" : "art::CompactOffsetTable::Accessor",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art18CompactOffsetTableE",
   "name" : "art::CompactOffsetTable",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/compact_offset_table.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "hash_fn_",
     "referenced_type" : "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE"
    }
   ],
   "linker_set_key" : "_ZTIN3art18HashMapHashWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE",
   "name" : "art::HashMapHashWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/hash_map.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIt",
    "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pred_fn_",
     "referenced_type" : "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE"
    }
   ],
   "linker_set_key" : "_ZTIN3art18HashMapPredWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE",
   "name" : "art::HashMapPredWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/hash_map.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIt",
    "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTINSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art18ScopedTraceNoStart24ScopedTraceMessageHelperE",
   "name" : "art::ScopedTraceNoStart::ScopedTraceMessageHelper",
   "record_kind" : "class",
   "size" : 136,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art18ScopedTraceNoStartE",
   "name" : "art::ScopedTraceNoStart",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art19Arc4RandomGeneratorE",
   "name" : "art::Arc4RandomGenerator",
   "size" : 1,
   "source_file" : "art/libartbase/base/utils.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art19DefaultStringEqualsE",
   "name" : "art::DefaultStringEquals",
   "size" : 1,
   "source_file" : "art/libartbase/base/hash_set.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_operands_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN3art19InstructionOperandsE",
   "name" : "art::InstructionOperands",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art19InstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art19InstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art19InstructionOperandsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art19InstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "address_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art20CatchHandlerIterator16CatchHandlerItemE",
   "name" : "art::CatchHandlerIterator::CatchHandlerItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_exception_helpers.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handler_",
     "referenced_type" : "_ZTIN3art20CatchHandlerIterator16CatchHandlerItemE"
    },
    {
     "access" : "private",
     "field_name" : "current_data_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "remaining_count_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "catch_all_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art20CatchHandlerIteratorE",
   "name" : "art::CatchHandlerIterator",
   "record_kind" : "class",
   "size" : 20,
   "source_file" : "art/libdexfile/dex/dex_file_exception_helpers.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art27CodeItemInstructionAccessorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art20CodeItemDataAccessorE",
   "name" : "art::CodeItemDataAccessor",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/code_item_accessors.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "instructions_",
     "referenced_type" : "_ZTIPKt"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art20DexInstructionPcPairE",
   "name" : "art::DexInstructionPcPair",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction_iterator.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art26DexInstructionIteratorBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN3art22DexInstructionIteratorE",
   "name" : "art::DexInstructionIterator",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction_iterator.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art16DexFileContainerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "private",
     "field_name" : "end_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKPKh"
    }
   ],
   "linker_set_key" : "_ZTIN3art22MemoryDexFileContainerE",
   "name" : "art::MemoryDexFileContainer",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art22MemoryDexFileContainerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art22MemoryDexFileContainerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art22MemoryDexFileContainerD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art22MemoryDexFileContainer10IsReadOnlyEv"
    },
    {
     "mangled_component_name" : "_ZN3art22MemoryDexFileContainer11EnableWriteEv"
    },
    {
     "mangled_component_name" : "_ZN3art22MemoryDexFileContainer12DisableWriteEv"
    },
    {
     "mangled_component_name" : "_ZNK3art22MemoryDexFileContainer5BeginEv"
    },
    {
     "mangled_component_name" : "_ZNK3art22MemoryDexFileContainer3EndEv"
    },
    {
     "mangled_component_name" : "_ZNK3art16DexFileContainer4DataEv"
    },
    {
     "mangled_component_name" : "_ZNK3art16DexFileContainer9IsFileMapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "type_list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN3art3dex8TypeListE"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art24DexFileParameterIteratorE",
   "name" : "art::DexFileParameterIterator",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art19InstructionOperandsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "first_operand_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    }
   ],
   "linker_set_key" : "_ZTIN3art24RangeInstructionOperandsE",
   "name" : "art::RangeInstructionOperands",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_instruction.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art24RangeInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art24RangeInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art24RangeInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art24RangeInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art20CodeItemDataAccessorE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offset_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art25CodeItemDebugInfoAccessorE",
   "name" : "art::CodeItemDebugInfoAccessor",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/code_item_accessors.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIRKN3art7DexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "array_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "pos_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "protected",
     "field_name" : "type_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
    },
    {
     "access" : "protected",
     "field_name" : "jval_",
     "field_offset" : 160,
     "referenced_type" : "_ZTI6jvalue"
    }
   ],
   "linker_set_key" : "_ZTIN3art25EncodedArrayValueIteratorE",
   "name" : "art::EncodedArrayValueIterator",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art26CallSiteArrayValueIteratorE",
   "name" : "art::CallSiteArrayValueIterator",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3art20DexInstructionPcPairE"
    }
   ],
   "linker_set_key" : "_ZTIN3art26DexInstructionIteratorBaseE",
   "name" : "art::DexInstructionIteratorBase",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_instruction_iterator.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art26DexInstructionIteratorBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_code_units_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "error_state_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art26SafeDexInstructionIteratorE",
   "name" : "art::SafeDexInstructionIterator",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_instruction_iterator.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art19InstructionOperandsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "operands_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIRA5_Kj"
    }
   ],
   "linker_set_key" : "_ZTIN3art26VarArgsInstructionOperandsE",
   "name" : "art::VarArgsInstructionOperands",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_instruction.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art26VarArgsInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art26VarArgsInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art26VarArgsInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art26VarArgsInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKt"
    }
   ],
   "linker_set_key" : "_ZTIN3art27CodeItemInstructionAccessorE",
   "name" : "art::CodeItemInstructionAccessor",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/code_item_accessors.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art19InstructionOperandsE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "inner_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPKN3art19InstructionOperandsE"
    }
   ],
   "linker_set_key" : "_ZTIN3art29NoReceiverInstructionOperandsE",
   "name" : "art::NoReceiverInstructionOperands",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_instruction.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art29NoReceiverInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art29NoReceiverInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art29NoReceiverInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art29NoReceiverInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art29ProtoReferenceValueComparatorE",
   "name" : "art::ProtoReferenceValueComparator",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/proto_reference.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art2OSE",
   "name" : "art::OS",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/os.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art30MethodReferenceValueComparatorE",
   "name" : "art::MethodReferenceValueComparator",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/method_reference.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIteratorE"
    }
   ],
   "linker_set_key" : "_ZTIN3art31EncodedStaticFieldValueIteratorE",
   "name" : "art::EncodedStaticFieldValueIterator",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex10ProtoIndexE",
   "name" : "art::dex::ProtoIndex",
   "record_kind" : "class",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex11StringIndexE",
   "name" : "art::dex::StringIndex",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "visibility_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "annotation_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14AnnotationItemE",
   "name" : "art::dex::AnnotationItem",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex14CallSiteIdItemE",
   "name" : "art::dex::CallSiteIdItem",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "method_handle_type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "field_or_method_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved2_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex16MethodHandleItemE",
   "name" : "art::dex::MethodHandleItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entries_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex17AnnotationSetItemE",
   "name" : "art::dex::AnnotationSetItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags_offset_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_j"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex18HiddenapiClassDataE",
   "name" : "art::dex::HiddenapiClassData",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "annotations_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefItemE",
   "name" : "art::dex::AnnotationSetRefItem",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex20AnnotationSetRefItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20AnnotationSetRefListE",
   "name" : "art::dex::AnnotationSetRefList",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "field_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex20FieldAnnotationsItemE",
   "name" : "art::dex::FieldAnnotationsItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex21MethodAnnotationsItemE",
   "name" : "art::dex::MethodAnnotationsItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_annotations_off_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fields_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "methods_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "parameters_size_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24AnnotationsDirectoryItemE",
   "name" : "art::dex::AnnotationsDirectoryItem",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex24ParameterAnnotationsItemE",
   "name" : "art::dex::ParameterAnnotationsItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "descriptor_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex6TypeIdE",
   "name" : "art::dex::TypeId",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "type_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7FieldIdE",
   "name" : "art::dex::FieldId",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "unused_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapItemE",
   "name" : "art::dex::MapItem",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex7MapItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7MapListE",
   "name" : "art::dex::MapList",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shorty_idx_",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "return_type_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "parameters_off_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7ProtoIdE",
   "name" : "art::dex::ProtoId",
   "size" : 12,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_addr_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "insn_count_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "handler_off_",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex7TryItemE",
   "name" : "art::dex::TryItem",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad1_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "access_flags_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "superclass_idx_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "pad2_",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "interfaces_off_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_idx_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_data_off_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "static_values_off_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8ClassDefE",
   "name" : "art::dex::ClassDef",
   "size" : 32,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art3dex8CodeItemE",
   "name" : "art::dex::CodeItem",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexIjEE",
   "name" : "art::dex::DexIndex<unsigned int>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8DexIndexItEE",
   "name" : "art::dex::DexIndex<unsigned short>",
   "record_kind" : "class",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    },
    {
     "field_name" : "proto_idx_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex10ProtoIndexE"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8MethodIdE",
   "name" : "art::dex::MethodId",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "string_data_off_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8StringIdE",
   "name" : "art::dex::StringId",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type_idx_",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeItemE",
   "name" : "art::dex::TypeItem",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_N3art3dex8TypeItemE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8TypeListE",
   "name" : "art::dex::TypeList",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "range_values_",
     "referenced_type" : "_ZTINSt3__15dequeINS_5tupleIJPKvjbEEENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKN3art7DexFileE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex8tracking24DexFileTrackingRegistrarE",
   "name" : "art::dex::tracking::DexFileTrackingRegistrar",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libdexfile/dex/dex_file_tracking_registrar.h"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art3dex8DexIndexItEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art3dex9TypeIndexE",
   "name" : "art::dex::TypeIndex",
   "record_kind" : "class",
   "size" : 2,
   "source_file" : "art/libdexfile/dex/dex_file_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "name_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "begin_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "base_begin_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "base_size_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "prot_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "reuse_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "already_unmapped_",
     "field_offset" : 264,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "redzone_size_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art6MemMapE",
   "name" : "art::MemMap",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "art/libartbase/base/mem_map.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "address_",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "line_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "source_file_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "prologue_end_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "epilogue_begin_",
     "field_offset" : 104,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile12PositionInfoE",
   "name" : "art::DexFile::PositionInfo",
   "size" : 16,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__15arrayIhLj20EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile4Sha1E",
   "name" : "art::DexFile::Sha1",
   "size" : 20,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic_",
     "referenced_type" : "_ZTINSt3__15arrayIhLj8EEE"
    },
    {
     "field_name" : "checksum_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN3art7DexFile4Sha1E"
    },
    {
     "field_name" : "file_size_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "header_size_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "endian_tag_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_size_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_off_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "map_off_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_size_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "string_ids_off_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_size_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_ids_off_",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_size_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "proto_ids_off_",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_size_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "field_ids_off_",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_size_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "method_ids_off_",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_size_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "class_defs_off_",
     "field_offset" : 800,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_size_",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data_off_",
     "field_offset" : 864,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile6HeaderE",
   "name" : "art::DexFile::Header",
   "size" : 112,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7DexFile6HeaderE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "container_size_",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "header_offset_",
     "field_offset" : 928,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile9HeaderV41E",
   "name" : "art::DexFile::HeaderV41",
   "size" : 120,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "descriptor_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "start_address_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "end_address_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reg_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "is_live_",
     "field_offset" : 176,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFile9LocalInfoE",
   "name" : "art::DexFile::LocalInfo",
   "size" : 24,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "begin_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPKh"
    },
    {
     "access" : "protected",
     "field_name" : "unused_size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "data_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKN3art8ArrayRefIKhEE"
    },
    {
     "access" : "protected",
     "field_name" : "location_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "location_checksum_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "header_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKPKN3art7DexFile6HeaderE"
    },
    {
     "access" : "protected",
     "field_name" : "string_ids_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIKPKN3art3dex8StringIdE"
    },
    {
     "access" : "protected",
     "field_name" : "type_ids_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKPKN3art3dex6TypeIdE"
    },
    {
     "access" : "protected",
     "field_name" : "field_ids_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIKPKN3art3dex7FieldIdE"
    },
    {
     "access" : "protected",
     "field_name" : "method_ids_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIKPKN3art3dex8MethodIdE"
    },
    {
     "access" : "protected",
     "field_name" : "proto_ids_",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKPKN3art3dex7ProtoIdE"
    },
    {
     "access" : "protected",
     "field_name" : "class_defs_",
     "field_offset" : 480,
     "referenced_type" : "_ZTIKPKN3art3dex8ClassDefE"
    },
    {
     "access" : "protected",
     "field_name" : "method_handles_",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPKN3art3dex16MethodHandleItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_method_handles_",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "call_site_ids_",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPKN3art3dex14CallSiteIdItemE"
    },
    {
     "access" : "protected",
     "field_name" : "num_call_site_ids_",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_class_data_",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPKN3art3dex18HiddenapiClassDataE"
    },
    {
     "access" : "protected",
     "field_name" : "oat_dex_file_",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPKN3art10OatDexFileE"
    },
    {
     "access" : "protected",
     "field_name" : "container_",
     "field_offset" : 704,
     "referenced_type" : "_ZTINSt3__110shared_ptrIN3art16DexFileContainerEEE"
    },
    {
     "access" : "protected",
     "field_name" : "is_compact_dex_",
     "field_offset" : 768,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_domain_",
     "field_offset" : 776,
     "referenced_type" : "_ZTIN3art9hiddenapi6DomainE"
    }
   ],
   "linker_set_key" : "_ZTIN3art7DexFileE",
   "name" : "art::DexFile",
   "record_kind" : "class",
   "size" : 100,
   "source_file" : "art/libdexfile/dex/dex_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art7DexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile12IsMagicValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile14IsVersionValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile22SupportsDefaultMethodsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile18GetDequickenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art7HashSetINSt3__14pairIjtEENS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS5_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS8_EENS1_9allocatorIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art7HashMapIjtNS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS2_26OffsetTypeMapHashCompareFnES4_NSt3__19allocatorINS5_4pairIjtEEEEEE",
   "name" : "art::HashMap<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapEmptyFn, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn, std::allocator<std::pair<unsigned int, unsigned short>>>",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "art/libartbase/base/hash_map.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIt",
    "_ZTIN3art3dex15DexFileVerifier20OffsetTypeMapEmptyFnE",
    "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE",
    "_ZTIN3art3dex15DexFileVerifier26OffsetTypeMapHashCompareFnE",
    "_ZTINSt3__19allocatorINS_4pairIjtEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "allocfn_",
     "referenced_type" : "_ZTINSt3__19allocatorINS_4pairIjtEEEE"
    },
    {
     "access" : "private",
     "field_name" : "hashfn_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIN3art18HashMapHashWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE"
    },
    {
     "access" : "private",
     "field_name" : "emptyfn_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIN3art3dex15DexFileVerifier20OffsetTypeMapEmptyFnE"
    },
    {
     "access" : "private",
     "field_name" : "pred_",
     "field_offset" : 24,
     "referenced_type" : "_ZTIN3art18HashMapPredWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE"
    },
    {
     "access" : "private",
     "field_name" : "num_elements_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "num_buckets_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "elements_until_expand_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "owns_data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPNSt3__14pairIjtEE"
    },
    {
     "access" : "private",
     "field_name" : "min_load_factor_",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "access" : "private",
     "field_name" : "max_load_factor_",
     "field_offset" : 256,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN3art7HashSetINSt3__14pairIjtEENS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS5_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS8_EENS1_9allocatorIS3_EEEE",
   "name" : "art::HashSet<std::pair<unsigned int, unsigned short>, art::dex::DexFileVerifier::OffsetTypeMapEmptyFn, art::HashMapHashWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, art::HashMapPredWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, std::allocator<std::pair<unsigned int, unsigned short>>>",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "art/libartbase/base/hash_set.h",
   "template_args" :
   [
    "_ZTINSt3__14pairIjtEE",
    "_ZTIN3art3dex15DexFileVerifier20OffsetTypeMapEmptyFnE",
    "_ZTIN3art18HashMapHashWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE",
    "_ZTIN3art18HashMapPredWrapperIjtNS_3dex15DexFileVerifier26OffsetTypeMapHashCompareFnEEE",
    "_ZTINSt3__19allocatorINS_4pairIjtEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "array_",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art8ArrayRefIKhEE",
   "name" : "art::ArrayRef<const unsigned char>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libartbase/base/array_ref.h",
   "template_args" :
   [
    "_ZTIKh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art8DataHashE",
   "name" : "art::DataHash",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/data_hash.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIRKN3art9hiddenapi7ApiListE"
    }
   ],
   "linker_set_key" : "_ZTIN3art8DumpableINS_9hiddenapi7ApiListEEE",
   "name" : "art::Dumpable<art::hiddenapi::ApiList>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libartbase/base/dumpable.h",
   "template_args" :
   [
    "_ZTIN3art9hiddenapi7ApiListE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art8IdentityIjEE",
   "name" : "art::Identity<unsigned int>",
   "size" : 1,
   "source_file" : "art/libartbase/base/stl_util_identity.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "handle_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP10ZipArchive"
    },
    {
     "access" : "private",
     "field_name" : "zip_entry_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKP8ZipEntry"
    },
    {
     "access" : "private",
     "field_name" : "entry_name_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3art8ZipEntryE",
   "name" : "art::ZipEntry",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "art/libartbase/base/zip_archive.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art8ZipEntryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art8ZipEntryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art8ZipEntryD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art9CountIterE",
   "name" : "art::CountIter",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art9LogHelperE",
   "name" : "art::LogHelper",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art9PrimitiveE",
   "name" : "art::Primitive",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/primitive.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3art11ValueObjectE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "_ZTIPKN3art7DexFileE"
    },
    {
     "access" : "private",
     "field_name" : "proto_id_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN3art3dex7ProtoIdE"
    }
   ],
   "linker_set_key" : "_ZTIN3art9SignatureE",
   "name" : "art::Signature",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "art/libdexfile/dex/signature.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_flags_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3art9hiddenapi7ApiListE",
   "name" : "art::hiddenapi::ApiList",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libartbase/base/hiddenapi_flags.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3art9hiddenapi8ApiStubsE",
   "name" : "art::hiddenapi::ApiStubs",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "art/libartbase/base/hiddenapi_stubs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIA22_c"
    },
    {
     "access" : "private",
     "field_name" : "str_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1010format_intE",
   "name" : "fmt::format_int",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1012format_errorE",
   "name" : "fmt::format_error",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1012format_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3fmt3v1012format_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "precision",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017presentation_typeE"
    },
    {
     "bit_width" : 4,
     "field_name" : "align",
     "field_offset" : 72,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIN3fmt3v105align4typeE"
    },
    {
     "bit_width" : 3,
     "field_name" : "sign",
     "field_offset" : 76,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIN3fmt3v104sign4typeE"
    },
    {
     "bit_width" : 1,
     "field_name" : "alt",
     "field_offset" : 79,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    },
    {
     "bit_width" : 1,
     "field_name" : "localized",
     "field_offset" : 80,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "fill",
     "field_offset" : 88,
     "referenced_type" : "_ZTIN3fmt3v106detail6fill_tIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1012format_specsIcEE",
   "name" : "fmt::format_specs<>",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1013is_contiguousINS0_6detail6bufferIcEEEE",
   "name" : "fmt::is_contiguous<fmt::detail::buffer<char>>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail6bufferIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v1014year_month_dayE",
   "name" : "fmt::year_month_day",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "type_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v106detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::basic_format_arg<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "width_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "fill_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt3v106detail6fill_tIcEE"
    },
    {
     "access" : "private",
     "bit_width" : 4,
     "field_name" : "align_",
     "field_offset" : 72,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIN3fmt3v105align4typeE"
    },
    {
     "access" : "private",
     "field_name" : "formatter_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN3fmt3v109formatterINS0_17basic_string_viewIcEEcvEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1016nested_formatterINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::nested_formatter<fmt::basic_string_view<char>>",
   "size" : 52,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "desc_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "values_",
     "referenced_type" : "_ZTIPKN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "field_name" : "args_",
     "referenced_type" : "_ZTIPKN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "name" : "fmt::basic_format_args<fmt::basic_format_context<fmt::appender, char>>::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKDi"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIDiEE",
   "name" : "fmt::basic_string_view<char32_t>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKN3fmt3v106detail10char8_typeE"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewINS0_6detail10char8_typeEEE",
   "name" : "fmt::basic_string_view<fmt::detail::char8_type>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail10char8_typeE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIcEE",
   "name" : "fmt::basic_string_view<char>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIPKw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1017basic_string_viewIwEE",
   "name" : "fmt::basic_string_view<wchar_t>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA128_c"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__19allocatorIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj128ENSt3__19allocatorIcEEEE",
   "name" : "fmt::basic_memory_buffer<char, 128, std::allocator<char>>",
   "record_kind" : "class",
   "size" : 148,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__19allocatorIcEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj128ENSt3__19allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIcLj128ENSt3__19allocatorIcEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA500_c"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 4128,
     "referenced_type" : "_ZTINSt3__19allocatorIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE",
   "name" : "fmt::basic_memory_buffer<char, 500, std::allocator<char>>",
   "record_kind" : "class",
   "size" : 520,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__19allocatorIcEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIcLj500ENSt3__19allocatorIcEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIiEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA500_i"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 16128,
     "referenced_type" : "_ZTINSt3__19allocatorIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIiLj500ENSt3__19allocatorIiEEEE",
   "name" : "fmt::basic_memory_buffer<int, 500, std::allocator<int>>",
   "record_kind" : "class",
   "size" : 2020,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTINSt3__19allocatorIiEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIiLj500ENSt3__19allocatorIiEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIiLj500ENSt3__19allocatorIiEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIjEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__19allocatorIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "name" : "fmt::basic_memory_buffer<unsigned int, 32, std::allocator<unsigned int>>",
   "record_kind" : "class",
   "size" : 148,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTINSt3__19allocatorIjEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIwEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "store_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA500_w"
    },
    {
     "access" : "private",
     "field_name" : "alloc_",
     "field_offset" : 16128,
     "referenced_type" : "_ZTINSt3__19allocatorIwEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1019basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE",
   "name" : "fmt::basic_memory_buffer<wchar_t, 500, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "size" : 2020,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw",
    "_ZTINSt3__19allocatorIwEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v1019basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v1019basic_memory_bufferIwLj500ENSt3__19allocatorIwEEE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "out_",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "access" : "private",
     "field_name" : "args_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt3v1017basic_format_argsINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "loc_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt3v106detail10locale_refE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "name" : "fmt::basic_format_context<fmt::appender, char>",
   "record_kind" : "class",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1021runtime_format_stringIcEE",
   "name" : "fmt::runtime_format_string<>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "format_str_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    },
    {
     "access" : "private",
     "field_name" : "next_arg_id_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE",
   "name" : "fmt::basic_format_parse_context<char>",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v105bytesE",
   "name" : "fmt::bytes",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN3fmt3v106detail10get_localeUt_E"
    },
    {
     "access" : "private",
     "field_name" : "has_locale_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail10get_localeE",
   "name" : "fmt::detail::get_locale",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "locale_",
     "referenced_type" : "_ZTINSt3__16localeE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v106detail10get_localeUt_E",
   "name" : "fmt::detail::get_locale::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "locale_",
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail10locale_refE",
   "name" : "fmt::detail::locale_ref",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "precision",
     "referenced_type" : "_ZTIi"
    },
    {
     "bit_width" : 8,
     "field_name" : "format",
     "field_offset" : 32,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIN3fmt3v106detail12float_formatE"
    },
    {
     "bit_width" : 8,
     "field_name" : "sign",
     "field_offset" : 40,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIN3fmt3v104sign4typeE"
    },
    {
     "bit_width" : 1,
     "field_name" : "upper",
     "field_offset" : 48,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    },
    {
     "bit_width" : 1,
     "field_name" : "locale",
     "field_offset" : 49,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    },
    {
     "bit_width" : 1,
     "field_name" : "binary32",
     "field_offset" : 50,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    },
    {
     "bit_width" : 1,
     "field_name" : "showpoint",
     "field_offset" : 51,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11float_specsE",
   "name" : "fmt::detail::float_specs",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11int_checkerILb1EEE",
   "name" : "fmt::detail::int_checker<true>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralINS1_10int128_optEEE",
   "name" : "fmt::detail::is_integral<fmt::detail::int128_opt>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail10int128_optE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralINS1_16uint128_fallbackEEE",
   "name" : "fmt::detail::is_integral<fmt::detail::uint128_fallback>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail16uint128_fallbackE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIjEE",
   "name" : "fmt::detail::is_integral<unsigned int>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111is_integralIyEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_integralIyEE",
   "name" : "fmt::detail::is_integral<unsigned long long>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail11is_zero_intE",
   "name" : "fmt::detail::is_zero_int",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvRN3fmt3v1026basic_format_parse_contextIcEERNS1_20basic_format_contextINS1_8appenderEcEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::custom_value<fmt::basic_format_context<fmt::appender, char>>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail12string_valueIcEE",
   "name" : "fmt::detail::string_value<char>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail12vformat_argsIcEE",
   "name" : "fmt::detail::vformat_args<char>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13buffer_traitsE",
   "name" : "fmt::detail::buffer_traits",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13error_handlerE",
   "name" : "fmt::detail::error_handler",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13has_format_asINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::has_format_as<fmt::basic_string_view<char>>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIN3fmt3v106detail4typeELS4_13EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13type_constantINS0_17basic_string_viewIcEEcEE",
   "name" : "fmt::detail::type_constant<fmt::basic_string_view<char>, char>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13unformattableE",
   "name" : "fmt::detail::unformattable",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIwLj500ENSt3__19allocatorIwEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail13utf8_to_utf16E",
   "name" : "fmt::detail::utf8_to_utf16",
   "record_kind" : "class",
   "size" : 2020,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail13width_checkerE",
   "name" : "fmt::detail::width_checker",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "significand_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14big_decimal_fpE",
   "name" : "fmt::detail::big_decimal_fp",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA32_Di"
    },
    {
     "field_name" : "end",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPDi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14codecvt_resultIDiEE",
   "name" : "fmt::detail::codecvt_result<char32_t>",
   "size" : 132,
   "source_file" : "external/fmtlib/include/fmt/chrono.h",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail14compile_stringE",
   "name" : "fmt::detail::compile_string",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "grouping_",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "thousands_sep_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail14digit_groupingIcEE",
   "name" : "fmt::detail::digit_grouping<char>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail6bufferIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    },
    {
     "access" : "private",
     "field_name" : "count_",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail15counting_bufferIcEE",
   "name" : "fmt::detail::counting_buffer<>",
   "record_kind" : "class",
   "size" : 276,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail15counting_bufferIcEE"
    },
    {
     "mangled_component_name" : "_ZN3fmt3v106detail15counting_bufferIcE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKN3fmt3v106detail14named_arg_infoIcEE"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE",
   "name" : "fmt::detail::named_arg_value<char>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail16format_as_resultINS0_17basic_string_viewIcEEEE",
   "name" : "fmt::detail::format_as_result<fmt::basic_string_view<char>>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lo_",
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "hi_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail16uint128_fallbackE",
   "name" : "fmt::detail::uint128_fallback",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail17counting_iterator10value_typeE",
   "name" : "fmt::detail::counting_iterator::value_type",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17counting_iteratorE",
   "name" : "fmt::detail::counting_iterator",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail17precision_checkerE",
   "name" : "fmt::detail::precision_checker",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail24null_chrono_spec_handlerINS1_17tm_format_checkerEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail17tm_format_checkerE",
   "name" : "fmt::detail::tm_format_checker",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "cp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail18find_escape_resultIcEE",
   "name" : "fmt::detail::find_escape_result<char>",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13unformattableE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail18unformattable_charE",
   "name" : "fmt::detail::unformattable_char",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "count_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "limit_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail19fixed_buffer_traitsE",
   "name" : "fmt::detail::fixed_buffer_traits",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v1012format_specsIcEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "width_ref",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcEE"
    },
    {
     "field_name" : "precision_ref",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE",
   "name" : "fmt::detail::dynamic_format_specs<>",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "grouping",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 96,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20thousands_sep_resultIcEE",
   "name" : "fmt::detail::thousands_sep_result<char>",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "grouping",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 96,
     "referenced_type" : "_ZTIw"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail20thousands_sep_resultIwEE",
   "name" : "fmt::detail::thousands_sep_result<wchar_t>",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail24null_chrono_spec_handlerINS1_21chrono_format_checkerEEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "has_precision_integral",
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21chrono_format_checkerE",
   "name" : "fmt::detail::chrono_format_checker",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v1026basic_format_parse_contextIcEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_args_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "types_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN3fmt3v106detail4typeE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21compile_parse_contextIcEE",
   "name" : "fmt::detail::compile_parse_context<char>",
   "record_kind" : "class",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt3v108appenderE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_decimal_resultINS0_8appenderEEE",
   "name" : "fmt::detail::format_decimal_result<fmt::appender>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v108appenderE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "begin",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21format_decimal_resultIPcEE",
   "name" : "fmt::detail::format_decimal_result<char *>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail21make_unsigned_or_boolIbEE",
   "name" : "fmt::detail::make_unsigned_or_bool<bool>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail13unformattableE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail21unformattable_pointerE",
   "name" : "fmt::detail::unformattable_pointer",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctx",
     "referenced_type" : "_ZTIRN3fmt3v1026basic_format_parse_contextIcEE"
    },
    {
     "field_name" : "ref",
     "field_offset" : 32,
     "referenced_type" : "_ZTIRN3fmt3v106detail7arg_refIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail23dynamic_spec_id_handlerIcEE",
   "name" : "fmt::detail::dynamic_spec_id_handler<char>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail24null_chrono_spec_handlerINS1_17tm_format_checkerEEE",
   "name" : "fmt::detail::null_chrono_spec_handler<fmt::detail::tm_format_checker>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail17tm_format_checkerE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail24null_chrono_spec_handlerINS1_21chrono_format_checkerEEE",
   "name" : "fmt::detail::null_chrono_spec_handler<fmt::detail::chrono_format_checker>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail21chrono_format_checkerE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail24printf_precision_handlerE",
   "name" : "fmt::detail::printf_precision_handler",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/printf.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail4nullIvEE",
   "name" : "fmt::detail::null<>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail4viewE",
   "name" : "fmt::detail::view",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEE",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "no_value",
     "referenced_type" : "_ZTIN3fmt3v109monostateE"
    },
    {
     "field_name" : "int_value",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uint_value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "long_long_value",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "ulong_long_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "int128_value",
     "referenced_type" : "_ZTIN3fmt3v106detail10int128_optE"
    },
    {
     "field_name" : "uint128_value",
     "referenced_type" : "_ZTIN3fmt3v106detail11uint128_optE"
    },
    {
     "field_name" : "bool_value",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "char_value",
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "float_value",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "double_value",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "long_double_value",
     "referenced_type" : "_ZTIe"
    },
    {
     "field_name" : "pointer",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "string",
     "referenced_type" : "_ZTIN3fmt3v106detail12string_valueIcEE"
    },
    {
     "field_name" : "custom",
     "referenced_type" : "_ZTIN3fmt3v106detail12custom_valueINS0_20basic_format_contextINS0_8appenderEcEEEE"
    },
    {
     "field_name" : "named_args",
     "referenced_type" : "_ZTIN3fmt3v106detail15named_arg_valueIcEE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN3fmt3v106detail5valueINS0_20basic_format_contextINS0_8appenderEcEEEUt_E",
   "name" : "fmt::detail::value<fmt::basic_format_context<fmt::appender, char>>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bigits_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE"
    },
    {
     "access" : "private",
     "field_name" : "exp_",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bigintE",
   "name" : "fmt::detail::bigint",
   "record_kind" : "class",
   "size" : 152,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIcEE",
   "name" : "fmt::detail::buffer<char>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIcEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIcE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPi"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIiEE",
   "name" : "fmt::detail::buffer<int>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIi"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIiEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIiE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPj"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIjEE",
   "name" : "fmt::detail::buffer<unsigned int>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIjE4growEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "ptr_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPw"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "capacity_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6bufferIwEE",
   "name" : "fmt::detail::buffer<wchar_t>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIw"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3fmt3v106detail6bufferIwEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3fmt3v106detail6bufferIwE4growEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail6fill_tIcEE",
   "name" : "fmt::detail::fill_t<char>",
   "size" : 5,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIN3fmt3v1017basic_string_viewIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE",
   "name" : "fmt::detail::arg_ref<char>::value",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "kind",
     "referenced_type" : "_ZTIN3fmt3v106detail11arg_id_kindE"
    },
    {
     "field_name" : "val",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN3fmt3v106detail7arg_refIcE5valueE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7arg_refIcEE",
   "name" : "fmt::detail::arg_ref<char>",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj128ENSt3__19allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7to_utf8IDiNS0_19basic_memory_bufferIcLj128ENSt3__19allocatorIcEEEEEE",
   "name" : "fmt::detail::to_utf8<char32_t, fmt::basic_memory_buffer<char, 128, std::allocator<char>>>",
   "record_kind" : "class",
   "size" : 148,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTIN3fmt3v1019basic_memory_bufferIcLj128ENSt3__19allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buffer_",
     "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7to_utf8IwNS0_19basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEEEE",
   "name" : "fmt::detail::to_utf8<wchar_t, fmt::basic_memory_buffer<char, 500, std::allocator<char>>>",
   "record_kind" : "class",
   "size" : 520,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIw",
    "_ZTIN3fmt3v1019basic_memory_bufferIcLj500ENSt3__19allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "str",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail7udl_argIcEE",
   "name" : "fmt::detail::udl_arg<char>",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIN3fmt3v106detail16uint128_fallbackE"
    },
    {
     "field_name" : "e",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8basic_fpINS1_16uint128_fallbackEEE",
   "name" : "fmt::detail::basic_fp<fmt::detail::uint128_fallback>",
   "size" : 20,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v106detail16uint128_fallbackE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "e",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail8basic_fpIyEE",
   "name" : "fmt::detail::basic_fp<unsigned long long>",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIdEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<double>",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "significand",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exponent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10decimal_fpIfEE",
   "name" : "fmt::detail::dragonbox::decimal_fp<float>",
   "size" : 8,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIdvEE",
   "name" : "fmt::detail::dragonbox::float_info<double>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v106detail9dragonbox10float_infoIfvEE",
   "name" : "fmt::detail::dragonbox::float_info<float>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIPcEE",
   "name" : "fmt::is_char<char *>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIcEE",
   "name" : "fmt::is_char<char>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107is_charIjEE",
   "name" : "fmt::is_char<unsigned int>",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value",
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v107weekdayE",
   "name" : "fmt::weekday",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt3v106detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v108appenderE",
   "name" : "fmt::appender",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_17basic_string_viewIcEEcvEE",
   "name" : "fmt::formatter<fmt::basic_string_view<char>, char, void>",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/core.h",
   "template_args" :
   [
    "_ZTIN3fmt3v1017basic_string_viewIcEE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "specs_",
     "referenced_type" : "_ZTIN3fmt3v106detail20dynamic_format_specsIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109formatterINS0_5bytesEcvEE",
   "name" : "fmt::formatter<fmt::bytes, char, void>",
   "size" : 40,
   "source_file" : "external/fmtlib/include/fmt/format.h",
   "template_args" :
   [
    "_ZTIN3fmt3v105bytesE",
    "_ZTIc",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "_ZTIN3fmt3v1016basic_format_argINS0_20basic_format_contextINS0_8appenderEcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN3fmt3v109loc_valueE",
   "name" : "fmt::loc_value",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN3fmt3v109monostateE",
   "name" : "fmt::monostate",
   "size" : 1,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "_ZTIN7android4base5LogIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "_ZTIPc"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "size" : 12,
   "source_file" : "system/libbase/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIN3art11Instruction6FormatES5_EE",
   "name" : "android::base::log_detail::StorageTypes<art::Instruction::Format, art::Instruction::Format>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art11Instruction6FormatE",
    "_ZTIN3art11Instruction6FormatE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIN3art25EncodedArrayValueIterator9ValueTypeES5_EE",
   "name" : "android::base::log_detail::StorageTypes<art::EncodedArrayValueIterator::ValueType, art::EncodedArrayValueIterator::ValueType>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE",
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIN3art3dex10ProtoIndexES5_EE",
   "name" : "android::base::log_detail::StorageTypes<art::dex::ProtoIndex, art::dex::ProtoIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE",
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIN3art3dex11StringIndexES5_EE",
   "name" : "android::base::log_detail::StorageTypes<art::dex::StringIndex, art::dex::StringIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE",
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIN3art3dex9TypeIndexES5_EE",
   "name" : "android::base::log_detail::StorageTypes<art::dex::TypeIndex, art::dex::TypeIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE",
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::TypeId *, const art::dex::TypeId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex6TypeIdE",
    "_ZTIPKN3art3dex6TypeIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::FieldId *, const art::dex::FieldId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7FieldIdE",
    "_ZTIPKN3art3dex7FieldIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7ProtoIdE",
    "_ZTIPKN3art3dex7ProtoIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8ClassDefE",
    "_ZTIPKN3art3dex8ClassDefE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::MethodId *, const art::dex::MethodId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8MethodIdE",
    "_ZTIPKN3art3dex8MethodIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::dex::StringId *, const art::dex::StringId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8StringIdE",
    "_ZTIPKN3art3dex8StringIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKN3art7DexFileES6_EE",
   "name" : "android::base::log_detail::StorageTypes<const art::DexFile *, const art::DexFile *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art7DexFileE",
    "_ZTIPKN3art7DexFileE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKcS4_EE",
   "name" : "android::base::log_detail::StorageTypes<const char *, const char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKhS4_EE",
   "name" : "android::base::log_detail::StorageTypes<const unsigned char *, const unsigned char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKh",
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKtS4_EE",
   "name" : "android::base::log_detail::StorageTypes<const unsigned short *, const unsigned short *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKt",
    "_ZTIPKt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIPKvPKhEE",
   "name" : "android::base::log_detail::StorageTypes<const void *, const unsigned char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIbbEE",
   "name" : "android::base::log_detail::StorageTypes<bool, bool>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIccEE",
   "name" : "android::base::log_detail::StorageTypes<char, char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIddEE",
   "name" : "android::base::log_detail::StorageTypes<double, double>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIhjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned char, unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIh",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIiiEE",
   "name" : "android::base::log_detail::StorageTypes<int, int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjiEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIjtEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned int, unsigned short>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesItjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIttEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned short, unsigned short>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt",
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIxjEE",
   "name" : "android::base::log_detail::StorageTypes<long long, unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail12StorageTypesIyjEE",
   "name" : "android::base::log_detail::StorageTypes<unsigned long long, unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIN3art11Instruction6FormatEEE",
   "name" : "android::base::log_detail::IsCharPointer<art::Instruction::Format>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art11Instruction6FormatE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIN3art25EncodedArrayValueIterator9ValueTypeEEE",
   "name" : "android::base::log_detail::IsCharPointer<art::EncodedArrayValueIterator::ValueType>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIN3art3dex10ProtoIndexEEE",
   "name" : "android::base::log_detail::IsCharPointer<art::dex::ProtoIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIN3art3dex11StringIndexEEE",
   "name" : "android::base::log_detail::IsCharPointer<art::dex::StringIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIN3art3dex9TypeIndexEEE",
   "name" : "android::base::log_detail::IsCharPointer<art::dex::TypeIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::TypeId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex6TypeIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::FieldId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7FieldIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ProtoId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7ProtoIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::ClassDef *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8ClassDefE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::MethodId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8MethodIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::dex::StringId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8StringIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKN3art7DexFileEEE",
   "name" : "android::base::log_detail::IsCharPointer<const art::DexFile *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art7DexFileE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKcEE",
   "name" : "android::base::log_detail::IsCharPointer<const char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKhEE",
   "name" : "android::base::log_detail::IsCharPointer<const unsigned char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKtEE",
   "name" : "android::base::log_detail::IsCharPointer<const unsigned short *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIPKvEE",
   "name" : "android::base::log_detail::IsCharPointer<const void *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIbEE",
   "name" : "android::base::log_detail::IsCharPointer<bool>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIcEE",
   "name" : "android::base::log_detail::IsCharPointer<char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIdEE",
   "name" : "android::base::log_detail::IsCharPointer<double>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIhEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIiEE",
   "name" : "android::base::log_detail::IsCharPointer<int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIjEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerItEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned short>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIxEE",
   "name" : "android::base::log_detail::IsCharPointer<long long>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base10log_detail13IsCharPointerIyEE",
   "name" : "android::base::log_detail::IsCharPointer<unsigned long long>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art11Instruction6FormatEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art11Instruction6FormatEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIN3art11Instruction6FormatES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<art::Instruction::Format, art::Instruction::Format>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art11Instruction6FormatE",
    "_ZTIN3art11Instruction6FormatE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art25EncodedArrayValueIterator9ValueTypeEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art25EncodedArrayValueIterator9ValueTypeEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIN3art25EncodedArrayValueIterator9ValueTypeES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<art::EncodedArrayValueIterator::ValueType, art::EncodedArrayValueIterator::ValueType>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE",
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex10ProtoIndexEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex10ProtoIndexEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIN3art3dex10ProtoIndexES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<art::dex::ProtoIndex, art::dex::ProtoIndex>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE",
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex11StringIndexEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex11StringIndexEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIN3art3dex11StringIndexES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<art::dex::StringIndex, art::dex::StringIndex>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE",
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex9TypeIndexEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIN3art3dex9TypeIndexEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIN3art3dex9TypeIndexES5_EE",
   "name" : "android::base::log_detail::EagerEvaluator<art::dex::TypeIndex, art::dex::TypeIndex>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE",
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex6TypeIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex6TypeIdE",
    "_ZTIPKN3art3dex6TypeIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7FieldIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7FieldIdE",
    "_ZTIPKN3art3dex7FieldIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex7ProtoIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7ProtoIdE",
    "_ZTIPKN3art3dex7ProtoIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8ClassDefES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8ClassDefE",
    "_ZTIPKN3art3dex8ClassDefE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8MethodIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8MethodIdE",
    "_ZTIPKN3art3dex8MethodIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art3dex8StringIdES7_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8StringIdE",
    "_ZTIPKN3art3dex8StringIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art7DexFileEEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKN3art7DexFileEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKN3art7DexFileES6_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const art::DexFile *, const art::DexFile *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art7DexFileE",
    "_ZTIPKN3art7DexFileE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKcS4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const char *, const char *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKc",
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKhS4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKh",
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKtEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKtEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKtS4_EE",
   "name" : "android::base::log_detail::EagerEvaluator<const unsigned short *, const unsigned short *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKt",
    "_ZTIPKt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKvEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIPKhEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIPKvPKhEE",
   "name" : "android::base::log_detail::EagerEvaluator<const void *, const unsigned char *>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIbEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIbbEE",
   "name" : "android::base::log_detail::EagerEvaluator<bool, bool>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIb",
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIcEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIcEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIccEE",
   "name" : "android::base::log_detail::EagerEvaluator<char, char>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIdEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIdEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIddEE",
   "name" : "android::base::log_detail::EagerEvaluator<double, double>",
   "size" : 16,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTId"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIhEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIhjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned char, unsigned int>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIh",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIiiEE",
   "name" : "android::base::log_detail::EagerEvaluator<int, int>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjiEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, int>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned int>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIjtEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned int, unsigned short>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorItjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned int>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageItEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIttEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned short, unsigned short>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt",
    "_ZTIt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIxEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIxjEE",
   "name" : "android::base::log_detail::EagerEvaluator<long long, unsigned int>",
   "size" : 12,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIyEE"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android4base10log_detail7StorageIjEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail14EagerEvaluatorIyjEE",
   "name" : "android::base::log_detail::EagerEvaluator<unsigned long long, unsigned int>",
   "size" : 12,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIy",
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN3art11Instruction6FormatE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIN3art11Instruction6FormatEEE",
   "name" : "android::base::log_detail::Storage<art::Instruction::Format>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art11Instruction6FormatE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIN3art25EncodedArrayValueIterator9ValueTypeEEE",
   "name" : "android::base::log_detail::Storage<art::EncodedArrayValueIterator::ValueType>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN3art3dex10ProtoIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIN3art3dex10ProtoIndexEEE",
   "name" : "android::base::log_detail::Storage<art::dex::ProtoIndex>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN3art3dex11StringIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIN3art3dex11StringIndexEEE",
   "name" : "android::base::log_detail::Storage<art::dex::StringIndex>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIN3art3dex9TypeIndexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIN3art3dex9TypeIndexEEE",
   "name" : "android::base::log_detail::Storage<art::dex::TypeIndex>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex6TypeIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::TypeId *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex6TypeIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7FieldIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::FieldId *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7FieldIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex7ProtoIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ProtoId *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7ProtoIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8ClassDefE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::ClassDef *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8ClassDefE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8MethodIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::MethodId *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8MethodIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art3dex8StringIdE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art3dex8StringIdEEE",
   "name" : "android::base::log_detail::Storage<const art::dex::StringId *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8StringIdE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKN3art7DexFileE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKN3art7DexFileEEE",
   "name" : "android::base::log_detail::Storage<const art::DexFile *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art7DexFileE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKhEE",
   "name" : "android::base::log_detail::Storage<const unsigned char *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKt"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKtEE",
   "name" : "android::base::log_detail::Storage<const unsigned short *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIPKvEE",
   "name" : "android::base::log_detail::Storage<const void *>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIbEE",
   "name" : "android::base::log_detail::Storage<bool>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIcEE",
   "name" : "android::base::log_detail::Storage<char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIdEE",
   "name" : "android::base::log_detail::Storage<double>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIhEE",
   "name" : "android::base::log_detail::Storage<unsigned char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIiEE",
   "name" : "android::base::log_detail::Storage<int>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIjEE",
   "name" : "android::base::log_detail::Storage<unsigned int>",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageItEE",
   "name" : "android::base::log_detail::Storage<unsigned short>",
   "size" : 2,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIxEE",
   "name" : "android::base::log_detail::Storage<long long>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10log_detail7StorageIyEE",
   "name" : "android::base::log_detail::Storage<unsigned long long>",
   "size" : 8,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIDnEE",
   "name" : "android::base::LogNullGuard<std::nullptr_t>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIDn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIN3art11Instruction6FormatEEE",
   "name" : "android::base::LogNullGuard<art::Instruction::Format>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art11Instruction6FormatE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIN3art25EncodedArrayValueIterator9ValueTypeEEE",
   "name" : "android::base::LogNullGuard<art::EncodedArrayValueIterator::ValueType>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIN3art3dex10ProtoIndexEEE",
   "name" : "android::base::LogNullGuard<art::dex::ProtoIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIN3art3dex11StringIndexEEE",
   "name" : "android::base::LogNullGuard<art::dex::StringIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIN3art3dex9TypeIndexEEE",
   "name" : "android::base::LogNullGuard<art::dex::TypeIndex>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex6TypeIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::TypeId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex6TypeIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7FieldIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::FieldId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7FieldIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex7ProtoIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::ProtoId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex7ProtoIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8ClassDefEEE",
   "name" : "android::base::LogNullGuard<const art::dex::ClassDef *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8ClassDefE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8MethodIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::MethodId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8MethodIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art3dex8StringIdEEE",
   "name" : "android::base::LogNullGuard<const art::dex::StringId *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art3dex8StringIdE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKN3art7DexFileEEE",
   "name" : "android::base::LogNullGuard<const art::DexFile *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKN3art7DexFileE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKcEE",
   "name" : "android::base::LogNullGuard<const char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKhEE",
   "name" : "android::base::LogNullGuard<const unsigned char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKtEE",
   "name" : "android::base::LogNullGuard<const unsigned short *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPKvEE",
   "name" : "android::base::LogNullGuard<const void *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPKv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIPcEE",
   "name" : "android::base::LogNullGuard<char *>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIPc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIbEE",
   "name" : "android::base::LogNullGuard<bool>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIcEE",
   "name" : "android::base::LogNullGuard<char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIdEE",
   "name" : "android::base::LogNullGuard<double>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIhEE",
   "name" : "android::base::LogNullGuard<unsigned char>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIiEE",
   "name" : "android::base::LogNullGuard<int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIjEE",
   "name" : "android::base::LogNullGuard<unsigned int>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardItEE",
   "name" : "android::base::LogNullGuard<unsigned short>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIxEE",
   "name" : "android::base::LogNullGuard<long long>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base12LogNullGuardIyEE",
   "name" : "android::base::LogNullGuard<unsigned long long>",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/logging.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "_ZTIKi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/errno_restorer.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/unique_fd.h",
   "template_args" :
   [
    "_ZTIN7android4base13DefaultCloserE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "_ZTIN7android4base11LogSeverityE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base19ScopedLockAssertionE",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/thread_annotations.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN9unix_file16RandomAccessFileE",
   "name" : "unix_file::RandomAccessFile",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "art/libartbase/base/unix_file/random_access_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9unix_file16RandomAccessFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5CloseEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9unix_file16RandomAccessFile4ReadEPcxx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile9SetLengthEx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK9unix_file16RandomAccessFile9GetLengthEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5WriteEPKcxx"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN9unix_file16RandomAccessFile5FlushEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN9unix_file16RandomAccessFileE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "guard_state_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN9unix_file6FdFile10GuardStateE"
    },
    {
     "access" : "private",
     "field_name" : "fd_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "file_path_",
     "field_offset" : 96,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "private",
     "field_name" : "read_only_mode_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN9unix_file6FdFileE",
   "name" : "unix_file::FdFile",
   "record_kind" : "class",
   "size" : 28,
   "source_file" : "art/libartbase/base/unix_file/fd_file.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9unix_file6FdFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file6FdFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9unix_file6FdFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5CloseEv"
    },
    {
     "mangled_component_name" : "_ZNK9unix_file6FdFile4ReadEPcxx"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile9SetLengthEx"
    },
    {
     "mangled_component_name" : "_ZNK9unix_file6FdFile9GetLengthEv"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5WriteEPKcxx"
    },
    {
     "mangled_component_name" : "_ZN9unix_file6FdFile5FlushEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art16DexFileReferenceEEE",
   "name" : "std::hash<art::DexFileReference>",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_reference.h",
   "template_args" :
   [
    "_ZTIN3art16DexFileReferenceE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex10ProtoIndexEEE",
   "name" : "std::hash<art::dex::ProtoIndex>",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" :
   [
    "_ZTIN3art3dex10ProtoIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex11StringIndexEEE",
   "name" : "std::hash<art::dex::StringIndex>",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" :
   [
    "_ZTIN3art3dex11StringIndexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__14hashIN3art3dex9TypeIndexEEE",
   "name" : "std::hash<art::dex::TypeIndex>",
   "size" : 1,
   "source_file" : "art/libdexfile/dex/dex_file_types.h",
   "template_args" :
   [
    "_ZTIN3art3dex9TypeIndexE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIPj"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail13compute_widthENS0_17basic_string_viewIcEEE17count_code_points",
   "name" : "count_code_points",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120back_insert_iteratorIN3fmt3v106detail6bufferIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106detail13get_containerINS1_6bufferIcEEEERT_NSt3__120back_insert_iteratorIS5_EEE8accessor",
   "name" : "accessor",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/core.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_",
     "field_offset" : 32,
     "referenced_type" : "_ZTI2tm"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v106gmtimeElE10dispatcher",
   "name" : "dispatcher",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "time_",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_",
     "field_offset" : 32,
     "referenced_type" : "_ZTI2tm"
    }
   ],
   "linker_set_key" : "_ZTIZN3fmt3v109localtimeElE10dispatcher",
   "name" : "dispatcher",
   "size" : 48,
   "source_file" : "external/fmtlib/include/fmt/chrono.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art11Instruction6FormatE",
   "name" : "art::Instruction::Format &&",
   "referenced_type" : "_ZTIN3art11Instruction6FormatE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art11ScopedTraceE",
   "name" : "art::ScopedTrace &&",
   "referenced_type" : "_ZTIN3art11ScopedTraceE",
   "size" : 4,
   "source_file" : "art/libartbase/base/systrace.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art11VoidFunctorE",
   "name" : "art::VoidFunctor &&",
   "referenced_type" : "_ZTIN3art11VoidFunctorE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/dex_file.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art15HashSetIteratorINSt3__14pairIjtEENS_7HashSetIS3_NS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS6_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS9_EENS1_9allocatorIS3_EEEEEE",
   "name" : "art::HashSetIterator<std::pair<unsigned int, unsigned short>, art::HashSet<std::pair<unsigned int, unsigned short>, art::dex::DexFileVerifier::OffsetTypeMapEmptyFn, art::HashMapHashWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, art::HashMapPredWrapper<unsigned int, unsigned short, art::dex::DexFileVerifier::OffsetTypeMapHashCompareFn>, std::allocator<std::pair<unsigned int, unsigned short>>>> &&",
   "referenced_type" : "_ZTIN3art15HashSetIteratorINSt3__14pairIjtEENS_7HashSetIS3_NS_3dex15DexFileVerifier20OffsetTypeMapEmptyFnENS_18HashMapHashWrapperIjtNS6_26OffsetTypeMapHashCompareFnEEENS_18HashMapPredWrapperIjtS9_EENS1_9allocatorIS3_EEEEEE",
   "size" : 4,
   "source_file" : "art/libartbase/base/hash_set.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art15SplitStringIterE",
   "name" : "art::SplitStringIter &&",
   "referenced_type" : "_ZTIN3art15SplitStringIterE",
   "size" : 4,
   "source_file" : "art/libartbase/base/stl_util.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art15TypeLookupTableE",
   "name" : "art::TypeLookupTable &&",
   "referenced_type" : "_ZTIN3art15TypeLookupTableE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/type_lookup_table.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art25EncodedArrayValueIterator9ValueTypeE",
   "name" : "art::EncodedArrayValueIterator::ValueType &&",
   "referenced_type" : "_ZTIN3art25EncodedArrayValueIterator9ValueTypeE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art3dex9TypeIndexE",
   "name" : "art::dex::TypeIndex &&",
   "referenced_type" : "_ZTIN3art3dex9TypeIndexE",
   "size" : 4,
   "source_file" : "system/libbase/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3art6MemMapE",
   "name" : "art::MemMap &&",
   "referenced_type" : "_ZTIN3art6MemMapE",
   "size" : 4,
   "source_file" : "art/libdexfile/dex/art_dex_file_loader.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "name" : "fmt::basic_memory_buffer<unsigned int, 32, std::allocator<unsigned int>> &&",
   "referenced_type" : "_ZTIN3fmt3v1019basic_memory_bufferIjLj32ENSt3__19allocatorIjEEEE",
   "size" : 4,
   "source_file" : "external/fmtlib/include/fmt/format.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "name" : "fmt::basic_format_context<fmt::appender, char> &&",
   "referenced_type" : "_ZTIN3fmt3v1020basic_format_contextINS0_8appenderEcEE",
   "size" : 4,
