{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA33_PKc",
   "name" : "const char *[33]",
   "referenced_type" : "_ZTIPKc",
   "size" : 132,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "_Bool",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIt",
   "name" : "unsigned short",
   "size" : 2
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "fgetfilecon"
  },
  {
   "name" : "fgetfilecon_raw"
  },
  {
   "name" : "freecon"
  },
  {
   "name" : "fsetfilecon"
  },
  {

   "referenced_type" : "_ZTIK14selabel_handle",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/android.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK16avc_log_callback",
   "name" : "const avc_log_callback *",
   "referenced_type" : "_ZTIK16avc_log_callback",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK17avc_lock_callback",
   "name" : "const avc_lock_callback *",
   "referenced_type" : "_ZTIK17avc_lock_callback",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK19avc_memory_callback",
   "name" : "const avc_memory_callback *",
   "referenced_type" : "_ZTIK19avc_memory_callback",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK19avc_thread_callback",
   "name" : "const avc_thread_callback *",
   "referenced_type" : "_ZTIK19avc_thread_callback",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP11security_id",
   "name" : "security_id **",
   "referenced_type" : "_ZTIP11security_id",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPPc",
   "name" : "char ***",
   "referenced_type" : "_ZTIPPc",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK11selinux_opt",
   "name" : "const selinux_opt",
   "referenced_type" : "_ZTI11selinux_opt",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/label.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK14selabel_handle",
   "name" : "const selabel_handle",
   "referenced_type" : "_ZTI14selabel_handle",
   "size" : 56,
   "source_file" : "external/selinux/libselinux/include/selinux/android.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK16avc_log_callback",
   "name" : "const avc_log_callback",
   "referenced_type" : "_ZTI16avc_log_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK17avc_lock_callback",
   "name" : "const avc_lock_callback",
   "referenced_type" : "_ZTI17avc_lock_callback",
   "size" : 16,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK19avc_memory_callback",
   "name" : "const avc_memory_callback",
   "referenced_type" : "_ZTI19avc_memory_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK19avc_thread_callback",
   "name" : "const avc_thread_callback",
   "referenced_type" : "_ZTI19avc_thread_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10SELboolean",
   "name" : "SELboolean",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "allowed",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "decided",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "auditallow",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "auditdeny",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "seqno",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11av_decision",
   "name" : "av_decision",
   "size" : 24,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI11context_s_t",
   "name" : "context_s_t",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/context.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ctx",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "refcnt",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11security_id",
   "name" : "security_id",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI11selinux_opt",
   "name" : "selinux_opt",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ae",
     "referenced_type" : "_ZTIP9avc_entry"
    }
   ],
   "linker_set_key" : "_ZTI13avc_entry_ref",
   "name" : "avc_entry_ref",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entry_lookups",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entry_hits",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entry_misses",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "entry_discards",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cav_lookups",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cav_hits",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cav_probes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cav_misses",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15avc_cache_stats",
   "name" : "avc_cache_stats",
   "size" : 32,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func_log",
     "referenced_type" : "_ZTIPFvPKczE"
    },
    {
     "field_name" : "func_audit",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvtPcjE"
    }
   ],
   "linker_set_key" : "_ZTI16avc_log_callback",
   "name" : "avc_log_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func_log",
     "referenced_type" : "_ZTIPFiiPKczE"
    },
    {
     "field_name" : "func_audit",
     "referenced_type" : "_ZTIPFiPvtPcjE"
    },
    {
     "field_name" : "func_validate",
     "referenced_type" : "_ZTIPFiPPcE"
    },
    {
     "field_name" : "func_setenforce",
     "referenced_type" : "_ZTIPFiiE"
    },
    {
     "field_name" : "func_policyload",
     "referenced_type" : "_ZTIPFiiE"
    }
   ],
   "linker_set_key" : "_ZTI16selinux_callback",
   "name" : "selinux_callback",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func_alloc_lock",
     "referenced_type" : "_ZTIPFPvvE"
    },
    {
     "field_name" : "func_get_lock",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "func_release_lock",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "func_free_lock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTI17avc_lock_callback",
   "name" : "avc_lock_callback",
   "size" : 16,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func_malloc",
     "referenced_type" : "_ZTIPFPvjE"
    },
    {
     "field_name" : "func_free",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTI19avc_memory_callback",
   "name" : "avc_memory_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "func_create_thread",
     "referenced_type" : "_ZTIPFPvPFvvEE"
    },
    {
     "field_name" : "func_stop_thread",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    }
   ],
   "linker_set_key" : "_ZTI19avc_thread_callback",
   "name" : "avc_thread_callback",
   "size" : 8,
   "source_file" : "external/selinux/libselinux/include/selinux/avc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "perms",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA33_PKc"
    }
   ],
   "linker_set_key" : "_ZTI22security_class_mapping",
   "name" : "security_class_mapping",
   "size" : 136,
   "source_file" : "external/selinux/libselinux/include/selinux/selinux.h"
  }
 ],
 "rvalue_reference_types" : []
}
