{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "bool",
   "name" : "bool",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "char",
   "name" : "char",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "double",
   "name" : "double",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "int",
   "name" : "int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "long long",
   "name" : "long long",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "unsigned int",
   "name" : "unsigned int",
   "referenced_type" : "type-3",
   "self_type" : "type-3",
   "size" : 4
  },
  {
   "linker_set_key" : "void",
   "name" : "void",
   "referenced_type" : "type-35",
   "self_type" : "type-35"
  }
 ],
 "elf_functions" :
 [
  {
   "name" : "mediametrics_addDouble"
  },
  {
   "name" : "mediametrics_addInt32"
  },
  {
   "name" : "mediametrics_addInt64"
  },
  {
   "name" : "mediametrics_addRate"
  },
  {

     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IMediaAnalyticsServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZN7android23BnMediaAnalyticsService10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "component_value" : 12,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnMediaAnalyticsServiceE"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android11BnInterfaceINS_22IMediaAnalyticsServiceEE19queryLocalInterfaceERKNS_8String16E"
    },
    {
     "mangled_component_name" : "_ZThn4_NK7android11BnInterfaceINS_22IMediaAnalyticsServiceEE22getInterfaceDescriptorEv"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder13isBinderAliveEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder10pingBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"
    },
    {
     "mangled_component_name" : "_ZNK7android7BBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7BBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android23BnMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android23BnMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android23BnMediaAnalyticsService10onTransactEjRKNS_6ParcelEPS1_j"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android23BnMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android23BnMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "android::IMediaAnalyticsService",
   "name" : "android::IMediaAnalyticsService",
   "record_kind" : "class",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h",
   "unique_id" : "_ZTSN7android22IMediaAnalyticsServiceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IMediaAnalyticsService22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService23generateUniqueSessionIDEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService6submitEPNS_18MediaAnalyticsItemEb"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPid",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mUid",
     "field_offset" : 32,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mPkgName",
     "field_offset" : 64,
     "referenced_type" : "type-4"
    },
    {
     "access" : "private",
     "field_name" : "mPkgVersionCode",
     "field_offset" : 160,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mSessionID",
     "field_offset" : 224,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mTimestamp",
     "field_offset" : 288,
     "referenced_type" : "type-5"
    },
    {
     "access" : "private",
     "field_name" : "mFinalized",
     "field_offset" : 352,
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mKey",
     "field_offset" : 384,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mPropCount",
     "field_offset" : 480,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mPropSize",
     "field_offset" : 512,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mProps",
     "field_offset" : 544,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "android::MediaAnalyticsItem",
   "name" : "android::MediaAnalyticsItem",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 72,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h",
   "unique_id" : "_ZTSN7android18MediaAnalyticsItemE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mType",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "mName",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "mNameLen",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "field_name" : "u",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::MediaAnalyticsItem::Prop",
   "name" : "android::MediaAnalyticsItem::Prop",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 28,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h",
   "unique_id" : "_ZTSN7android18MediaAnalyticsItem4PropE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-15"
    },
    {
     "field_name" : "CStringValue",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "rate",
     "referenced_type" : "type-17"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::MediaAnalyticsItem::Prop::(anonymous union at frameworks/av/include/media/MediaAnalyticsItem.h:242:13) at frameworks/av/include/media/MediaAnalyticsItem.h:242:13",
   "name" : "android::MediaAnalyticsItem::Prop::(anonymous union at frameworks/av/include/media/MediaAnalyticsItem.h:242:13) at frameworks/av/include/media/MediaAnalyticsItem.h:242:13",
   "record_kind" : "union",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h",
   "unique_id" : "_ZTSN7android18MediaAnalyticsItem4PropUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "duration",
     "field_offset" : 64,
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::MediaAnalyticsItem::Prop::(anonymous union at frameworks/av/include/media/MediaAnalyticsItem.h:242:13)::(anonymous struct at frameworks/av/include/media/MediaAnalyticsItem.h:247:21) at frameworks/av/include/media/MediaAnalyticsItem.h:247:21",
   "name" : "android::MediaAnalyticsItem::Prop::(anonymous union at frameworks/av/include/media/MediaAnalyticsItem.h:242:13)::(anonymous struct at frameworks/av/include/media/MediaAnalyticsItem.h:247:21) at frameworks/av/include/media/MediaAnalyticsItem.h:247:21",
   "referenced_type" : "type-17",
   "self_type" : "type-17",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h",
   "unique_id" : "_ZTSN7android18MediaAnalyticsItem4PropUt_Ut_E"
  }
 ],
 "rvalue_reference_types" : []
}
