{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "type-134",
   "self_type" : "type-134",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,

   "is_const" : true,
   "linker_set_key" : "_ZTIK20ExtDexFileMethodInfo",
   "name" : "const ExtDexFileMethodInfo",
   "referenced_type" : "type-94",
   "self_type" : "type-126",
   "size" : 12,
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex6TypeIdE",
   "name" : "const art::dex::TypeId",
   "referenced_type" : "type-23",
   "self_type" : "type-22",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex7FieldIdE",
   "name" : "const art::dex::FieldId",
   "referenced_type" : "type-28",
   "self_type" : "type-27",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex7ProtoIdE",
   "name" : "const art::dex::ProtoId",
   "referenced_type" : "type-43",
   "self_type" : "type-42",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex8ClassDefE",
   "name" : "const art::dex::ClassDef",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 32,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex8MethodIdE",
   "name" : "const art::dex::MethodId",
   "referenced_type" : "type-33",
   "self_type" : "type-32",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art3dex8StringIdE",
   "name" : "const art::dex::StringId",
   "referenced_type" : "type-18",
   "self_type" : "type-17",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN3art7DexFileE",
   "name" : "const art::DexFile",
   "referenced_type" : "type-14",
   "self_type" : "type-13",
   "size" : 96,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base10MappedFileE",
   "name" : "const android::base::MappedFile",
   "referenced_type" : "type-110",
   "self_type" : "type-111",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base11borrowed_fdE",
   "name" : "const android::base::borrowed_fd",
   "referenced_type" : "type-105",
   "self_type" : "type-107",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android4base13ErrnoRestorerE",
   "name" : "const android::base::ErrnoRestorer",
   "referenced_type" : "type-131",
   "self_type" : "type-135",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android4base14LogMessageDataENS_14default_deleteIS3_EEEE",
   "name" : "const std::unique_ptr<android::base::LogMessageData, std::default_delete<android::base::LogMessageData> >",
   "referenced_type" : "type-87",
   "self_type" : "type-86",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-93",
   "self_type" : "type-92",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "type-76",
   "self_type" : "type-75",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "type-134",
   "self_type" : "type-137",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-9",
   "self_type" : "type-8",
   "size" : 1,
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "type-6",
   "self_type" : "type-5",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "type-95",
   "self_type" : "type-132",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "type-51",
   "self_type" : "type-50",
   "size" : 2,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "type-56",
   "self_type" : "type-55",
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-1"
    }
   ],
   "linker_set_key" : "_ZTI20ExtDexFileMethodInfo",
   "name" : "ExtDexFileMethodInfo",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 12,
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogMessageE",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-85",
   "self_type" : "type-85",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-129"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10LogdLoggerE",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "type-61"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-46"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base10MappedFileE",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base11borrowed_fdE",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "type-105",
   "self_type" : "type-105",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base13DefaultCloserE",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-132"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base13ErrnoRestorerE",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-131",
   "self_type" : "type-131",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex6TypeIdES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "type-20",
   "self_type" : "type-20",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-21", "type-21" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-26"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex7FieldIdES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-26", "type-26" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-41"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex7ProtoIdES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-41", "type-41" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-36"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex8ClassDefES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-36", "type-36" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-31"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-31"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex8MethodIdES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-31", "type-31" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art3dex8StringIdES6_EE",
   "name" : "android::base::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-16", "type-16" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKN3art7DexFileES5_EE",
   "name" : "android::base::EagerEvaluator<const art::DexFile *, const art::DexFile *>",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-12", "type-12" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKaPaEE",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-78",
   "self_type" : "type-78",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-74", "type-79" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKaS3_EE",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-74", "type-74" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKcPcEE",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-60",
   "self_type" : "type-60",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-61" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKcS3_EE",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-7" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKhPhEE",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-59",
   "self_type" : "type-59",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-4", "type-44" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKhS3_EE",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-67",
   "self_type" : "type-67",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-4", "type-4" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-49"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-49"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPKtS3_EE",
   "name" : "android::base::EagerEvaluator<const unsigned short *, const unsigned short *>",
   "referenced_type" : "type-48",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-49", "type-49" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPaPKaEE",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-79", "type-74" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPaS2_EE",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-79", "type-79" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPcPKcEE",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-61", "type-7" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPcS2_EE",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-61", "type-61" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPhPKhEE",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-69",
   "self_type" : "type-69",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-44", "type-4" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-54"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIPhS2_EE",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-44", "type-44" ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-134"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIbbEE",
   "name" : "android::base::EagerEvaluator<bool, bool>",
   "referenced_type" : "type-144",
   "self_type" : "type-144",
   "size" : 2,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-134", "type-134" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIiiEE",
   "name" : "android::base::EagerEvaluator<int, int>",
   "referenced_type" : "type-146",
   "self_type" : "type-146",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-95", "type-95" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-46"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIjjEE",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-46", "type-46" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorItjEE",
   "name" : "android::base::EagerEvaluator<unsigned short, unsigned int>",
   "referenced_type" : "type-140",
   "self_type" : "type-140",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-51", "type-46" ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-51"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "type-51"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14EagerEvaluatorIttEE",
   "name" : "android::base::EagerEvaluator<unsigned short, unsigned short>",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-51", "type-51" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-98",
   "self_type" : "type-98",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-97" ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "_ZTIN7android4base17ScopedLogSeverityE",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base19ScopedLockAssertionE",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "referenced_type" : "type-114",
   "self_type" : "type-114",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/thread_annotations.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android4base14unique_fd_implINS0_13DefaultCloserEEE",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser> &&",
   "referenced_type" : "type-98",
   "self_type" : "type-102",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h"
  }
 ]
}
