{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 8
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 4
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 8
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 8
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "type-49",
   "self_type" : "type-49"
  }
 ],

   "name" : "const android::Parcel",
   "referenced_type" : "type-26",
   "self_type" : "type-25",
   "size" : 120,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8String16E",
   "name" : "const android::String16",
   "referenced_type" : "type-38",
   "self_type" : "type-37",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android8String16E",
   "name" : "const android::String16",
   "referenced_type" : "type-96",
   "self_type" : "type-95",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__110unique_ptrIN7android22IMediaAnalyticsServiceENS_14default_deleteIS2_EEEE",
   "name" : "const std::unique_ptr<android::IMediaAnalyticsService, std::default_delete<android::IMediaAnalyticsService> >",
   "referenced_type" : "type-106",
   "self_type" : "type-105",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-18",
   "self_type" : "type-17",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-43",
   "self_type" : "type-42",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-61",
   "self_type" : "type-60",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIllEE",
   "name" : "const std::pair<long, long>",
   "referenced_type" : "type-30",
   "self_type" : "type-29",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIllEE",
   "name" : "const std::pair<long, long>",
   "referenced_type" : "type-51",
   "self_type" : "type-50",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIllEE",
   "name" : "const std::pair<long, long>",
   "referenced_type" : "type-83",
   "self_type" : "type-82",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "type-39",
   "self_type" : "type-48",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "type-5",
   "self_type" : "type-32",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-6",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "type-12",
   "self_type" : "type-79",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "type-10",
   "self_type" : "type-71",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "type-11",
   "self_type" : "type-77",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "CStringValue",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "rate",
     "referenced_type" : "type-13"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem4Prop3u__E",
   "name" : "android::MediaAnalyticsItem::Prop::u__",
   "record_kind" : "union",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mName",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "mType",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "u",
     "field_offset" : 128,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem4PropE",
   "name" : "android::MediaAnalyticsItem::Prop",
   "record_kind" : "class",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 32,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem6none_tE",
   "name" : "android::MediaAnalyticsItem::none_t",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "i",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "item",
     "field_offset" : 64,
     "referenced_type" : "type-57"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem8iteratorE",
   "name" : "android::MediaAnalyticsItem::iterator",
   "record_kind" : "class",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPropCount",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mPropSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mProps",
     "field_offset" : 128,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mPid",
     "field_offset" : 192,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mUid",
     "field_offset" : 224,
     "referenced_type" : "type-8"
    },
    {
     "access" : "private",
     "field_name" : "mPkgName",
     "field_offset" : 256,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mPkgVersionCode",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "mKey",
     "field_offset" : 512,
     "referenced_type" : "type-15"
    },
    {
     "access" : "private",
     "field_name" : "mTimestamp",
     "field_offset" : 704,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItemE",
   "name" : "android::MediaAnalyticsItem",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 96,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-94"
    }
   ],
   "linker_set_key" : "_ZTIN7android22IMediaAnalyticsServiceE",
   "name" : "android::IMediaAnalyticsService",
   "record_kind" : "class",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IMediaAnalyticsService22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService6submitEPNS_18MediaAnalyticsItemE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-108"
    }
   ],
   "linker_set_key" : "_ZTIN7android23BnMediaAnalyticsServiceE",
   "name" : "android::BnMediaAnalyticsService",
   "record_kind" : "class",
   "referenced_type" : "type-107",
   "self_type" : "type-107",
   "size" : 48,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IMediaAnalyticsServiceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IMediaAnalyticsServiceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService6submitEPNS_18MediaAnalyticsItemE"
    },
