{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_Pv",
   "name" : "void *[1]",
   "referenced_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane[4]",
   "referenced_type" : "_ZTI21AHardwareBuffer_Plane",
   "size" : 64,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_Pv",
   "name" : "void *[4]",
   "referenced_type" : "_ZTIPv",
   "size" : 32,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA4_l",
   "name" : "long[4]",
   "referenced_type" : "_ZTIl",
   "size" : 32,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA6_j",
   "name" : "unsigned int[6]",
   "referenced_type" : "_ZTIj",
   "size" : 24,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA7_Pv",
   "name" : "void *[7]",
   "referenced_type" : "_ZTIPv",
   "size" : 56,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,

   "alignment" : 8,
   "linker_set_key" : "_ZTIPf",
   "name" : "float *",
   "referenced_type" : "_ZTIf",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/window.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPl",
   "name" : "long *",
   "referenced_type" : "_ZTIl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/window.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13ANativeWindow",
   "name" : "const ANativeWindow",
   "referenced_type" : "_ZTI13ANativeWindow",
   "size" : 192,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13native_handle",
   "name" : "const native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/hardware_buffer.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15AHardwareBuffer",
   "name" : "const AHardwareBuffer",
   "referenced_type" : "_ZTI15AHardwareBuffer",
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK19ANativeWindowBuffer",
   "name" : "const ANativeWindowBuffer",
   "referenced_type" : "_ZTI19ANativeWindowBuffer",
   "size" : 168,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK20AHardwareBuffer_Desc",
   "name" : "const AHardwareBuffer_Desc",
   "referenced_type" : "_ZTI20AHardwareBuffer_Desc",
   "size" : 40,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK26AHardwareBufferLongOptions",
   "name" : "const AHardwareBufferLongOptions",
   "referenced_type" : "_ZTI26AHardwareBufferLongOptions",
   "size" : 16,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK5ARect",
   "name" : "const ARect",
   "referenced_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK7AParcel",
   "name" : "const AParcel",
   "referenced_type" : "_ZTI7AParcel",
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer_aidl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4aidl7android8hardware12NativeWindowE",
   "name" : "const aidl::android::hardware::NativeWindow",
   "referenced_type" : "_ZTIN4aidl7android8hardware12NativeWindowE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/native_window_aidl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN4aidl7android8hardware14HardwareBufferE",
   "name" : "const aidl::android::hardware::HardwareBuffer",
   "referenced_type" : "_ZTIN4aidl7android8hardware14HardwareBufferE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer_aidl.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android13GraphicBufferE",
   "name" : "const android::GraphicBuffer",
   "referenced_type" : "_ZTIN7android13GraphicBufferE",
   "size" : 256,
   "source_file" : "frameworks/native/libs/nativewindow/include-private/private/android/AHardwareBufferHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/hardware_buffer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "size" : 4,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "minSwapInterval",
     "field_offset" : 480,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "maxSwapInterval",
     "field_offset" : 512,
     "referenced_type" : "_ZTIKi"
    },
    {
     "field_name" : "xdpi",
     "field_offset" : 544,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "ydpi",
     "field_offset" : 576,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "oem",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA4_l"
    },
    {
     "field_name" : "setSwapInterval",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFiP13ANativeWindowiE"
    },
    {
     "field_name" : "dequeueBuffer_DEPRECATED",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferE"
    },
    {
     "field_name" : "lockBuffer_DEPRECATED",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "queueBuffer_DEPRECATED",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "query",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFiPK13ANativeWindowiPiE"
    },
    {
     "field_name" : "perform",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFiP13ANativeWindowizE"
    },
    {
     "field_name" : "cancelBuffer_DEPRECATED",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferE"
    },
    {
     "field_name" : "dequeueBuffer",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFiP13ANativeWindowPP19ANativeWindowBufferPiE"
    },
    {
     "field_name" : "queueBuffer",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    },
    {
     "field_name" : "cancelBuffer",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFiP13ANativeWindowP19ANativeWindowBufferiE"
    }
   ],
   "linker_set_key" : "_ZTI13ANativeWindow",
   "name" : "ANativeWindow",
   "size" : 192,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI21android_native_base_t"
    },
    {
     "field_name" : "width",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 480,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usage_deprecated",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "layerCount",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 704,
     "referenced_type" : "_ZTIA1_Pv"
    },
    {
     "field_name" : "handle",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "usage",
     "field_offset" : 832,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved_proc",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA7_Pv"
    }
   ],
   "linker_set_key" : "_ZTI19ANativeWindowBuffer",
   "name" : "ANativeWindowBuffer",
   "size" : 168,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "layers",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "stride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu0",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rfu1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI20AHardwareBuffer_Desc",
   "name" : "AHardwareBuffer_Desc",
   "size" : 40,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "width",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "height",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "stride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA6_j"
    }
   ],
   "linker_set_key" : "_ZTI20ANativeWindow_Buffer",
   "name" : "ANativeWindow_Buffer",
   "size" : 48,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/native_window.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pixelStride",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rowStride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21AHardwareBuffer_Plane",
   "name" : "AHardwareBuffer_Plane",
   "size" : 16,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_Pv"
    },
    {
     "field_name" : "incRef",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    },
    {
     "field_name" : "decRef",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvP21android_native_base_tE"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_base_t",
   "name" : "android_native_base_t",
   "size" : 56,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI21android_native_rect_t",
   "name" : "android_native_rect_t",
   "size" : 16,
   "source_file" : "frameworks/native/libs/nativebase/include/nativebase/nativebase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "planeCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_21AHardwareBuffer_Plane"
    }
   ],
   "linker_set_key" : "_ZTI22AHardwareBuffer_Planes",
   "name" : "AHardwareBuffer_Planes",
   "size" : 72,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI26AHardwareBufferLongOptions",
   "name" : "AHardwareBufferLongOptions",
   "size" : 16,
   "source_file" : "frameworks/native/libs/nativewindow/include/vndk/hardware_buffer.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "frameNumber",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "frameTimelineVsyncId",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "inputEventId",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "startTimeNanos",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "useForRefreshRateSelection",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "skippedFrameVsyncId",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "skippedFrameStartTimeNanos",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI30ANativeWindowFrameTimelineInfo",
   "name" : "ANativeWindowFrameTimelineInfo",
   "size" : 56,
   "source_file" : "frameworks/native/libs/nativewindow/include/system/window.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mWindow",
     "referenced_type" : "_ZTIP13ANativeWindow"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware12NativeWindowE",
   "name" : "aidl::android::hardware::NativeWindow",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/native_window_aidl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIP15AHardwareBuffer"
    }
   ],
   "linker_set_key" : "_ZTIN4aidl7android8hardware14HardwareBufferE",
   "name" : "aidl::android::hardware::HardwareBuffer",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer_aidl.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION4aidl7android8hardware12NativeWindowE",
   "name" : "aidl::android::hardware::NativeWindow &&",
   "referenced_type" : "_ZTIN4aidl7android8hardware12NativeWindowE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/native_window_aidl.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION4aidl7android8hardware14HardwareBufferE",
   "name" : "aidl::android::hardware::HardwareBuffer &&",
   "referenced_type" : "_ZTIN4aidl7android8hardware14HardwareBufferE",
   "size" : 8,
   "source_file" : "frameworks/native/libs/nativewindow/include/android/hardware_buffer_aidl.h"
  }
 ]
}
