{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_c",
   "name" : "char[0]",
   "referenced_type" : "_ZTIc",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1025_c",
   "name" : "char[1025]",
   "referenced_type" : "_ZTIc",
   "size" : 1025,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA108_c",
   "name" : "char[108]",
   "referenced_type" : "_ZTIc",
   "size" : 108,
   "source_file" : "bionic/libc/kernel/uapi/linux/un.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int[10]",
   "referenced_type" : "_ZTIi",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char[120]",
   "referenced_type" : "_ZTIc",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA126_c",
   "name" : "char[126]",
   "referenced_type" : "_ZTIc",
   "size" : 126,
   "source_file" : "bionic/libc/include/bits/sockaddr_storage.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA128_c",
   "name" : "char[128]",
   "referenced_type" : "_ZTIc",
   "size" : 128,
   "source_file" : "bionic/libc/system_properties/include/system_properties/properties_filename.h"
  },
  {

   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "const android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties8TrieNodeE",
   "name" : "const android::properties::TrieNode",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP14prop_trie_node",
   "name" : "prop_trie_node *const",
   "referenced_type" : "_ZTIP14prop_trie_node",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP17__posix_spawnattr",
   "name" : "__posix_spawnattr *const",
   "referenced_type" : "_ZTIP17__posix_spawnattr",
   "size" : 4,
   "source_file" : "bionic/libc/include/spawn.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP26__posix_spawn_file_actions",
   "name" : "__posix_spawn_file_actions *const",
   "referenced_type" : "_ZTIP26__posix_spawn_file_actions",
   "size" : 4,
   "source_file" : "bionic/libc/include/spawn.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKv",
   "name" : "const void *const",
   "referenced_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPj",
   "name" : "unsigned int *const",
   "referenced_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "bionic/libc/include/ctype.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "size" : 1,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "size" : 4,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "size" : 4,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "size" : 4,
   "source_file" : "bionic/libc/include/inttypes.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdio.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "size" : 4,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "size" : 12,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10Elf32_Move",
   "name" : "Elf32_Move",
   "size" : 24,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "size" : 24,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI10Elf64_Move",
   "name" : "Elf64_Move",
   "size" : 32,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "self_type" : "_ZTI10__sifields#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arp_pa",
     "referenced_type" : "_ZTI8sockaddr"
    },
    {
     "field_name" : "arp_ha",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sockaddr"
    },
    {
     "field_name" : "arp_flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "arp_netmask",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8sockaddr"
    }
   ],
   "linker_set_key" : "_ZTI10arpreq_old",
   "name" : "arpreq_old",
   "size" : 52,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_arp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10elf32_note",
   "name" : "elf32_note",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10elf32_phdr",
   "name" : "elf32_phdr",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10elf32_rela",
   "name" : "elf32_rela",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10elf32_shdr",
   "name" : "elf32_shdr",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10elf64_note",
   "name" : "elf64_note",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10elf64_phdr",
   "name" : "elf64_phdr",
   "size" : 56,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI10elf64_rela",
   "name" : "elf64_rela",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10elf64_shdr",
   "name" : "elf64_shdr",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/linux/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u32",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "u64",
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10epoll_data",
   "name" : "epoll_data",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/epoll_event.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "ether_addr_octet",
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI10ether_addr",
   "name" : "ether_addr",
   "size" : 6,
   "source_file" : "bionic/libc/include/net/ethernet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10f_owner_ex",
   "name" : "f_owner_ex",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/fcntl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi_ifindex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ipi_spec_dst",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "ipi_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI10in_pktinfo",
   "name" : "in_pktinfo",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cuid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cgid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mode",
     "field_offset" : 160,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__pad1",
     "field_offset" : 176,
     "referenced_type" : "_ZTIA2_h"
    },
    {
     "field_name" : "seq",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__pad2",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__unused1",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused2",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10ipc64_perm",
   "name" : "ipc64_perm",
   "size" : 36,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/ipcbuf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msgp",
     "referenced_type" : "_ZTIP6msgbuf"
    },
    {
     "field_name" : "msgtyp",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI10ipc_kludge",
   "name" : "ipc_kludge",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "spare",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mnt_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "param",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10mnt_id_req",
   "name" : "mnt_id_req",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/mount.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "attr_set",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "attr_clr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "propagation",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "userns_fd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10mount_attr",
   "name" : "mount_attr",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/mount.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_perm",
     "referenced_type" : "_ZTI10ipc64_perm"
    },
    {
     "field_name" : "msg_stime",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_stime_high",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_rtime",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_rtime_high",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_ctime",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_ctime_high",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_cbytes",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_qnum",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_qbytes",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_lspid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msg_lrpid",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__unused4",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused5",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10msqid64_ds",
   "name" : "msqid64_ds",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/msgbuf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ndtc_key_len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ndtc_entry_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ndtc_entries",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_last_flush",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_last_rand",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_hash_rnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_hash_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_hash_chain_gc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndtc_proxy_qlen",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10ndt_config",
   "name" : "ndt_config",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/neighbour.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "group",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10nl_pktinfo",
   "name" : "nl_pktinfo",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10ns_namemap",
   "name" : "ns_namemap",
   "size" : 8,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rm_so",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rm_eo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10regmatch_t",
   "name" : "regmatch_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/regex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sem_perm",
     "referenced_type" : "_ZTI10ipc64_perm"
    },
    {
     "field_name" : "sem_otime",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sem_otime_high",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sem_ctime",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sem_ctime_high",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sem_nsems",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused3",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused4",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10semid64_ds",
   "name" : "semid64_ds",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/sembuf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shm_perm",
     "referenced_type" : "_ZTI10ipc64_perm"
    },
    {
     "field_name" : "shm_segsz",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "shm_atime",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_atime_high",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_dtime",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_dtime_high",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_ctime",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_ctime_high",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "shm_cpid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shm_lpid",
     "field_offset" : 544,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shm_nattch",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused4",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__unused5",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10shmid64_ds",
   "name" : "shmid64_ds",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/shmbuf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "trap_no",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "error_code",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "oldmask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r0",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r1",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r4",
     "field_offset" : 224,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r5",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r6",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r7",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r8",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r9",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_r10",
     "field_offset" : 416,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_fp",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_ip",
     "field_offset" : 480,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_sp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_lr",
     "field_offset" : 544,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_pc",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arm_cpsr",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fault_address",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "size" : 84,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI10sigset64_t",
   "name" : "sigset64_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10tunnel_msg",
   "name" : "tunnel_msg",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lock_",
     "referenced_type" : "_ZTI4Lock"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "pa_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "private",
     "field_name" : "no_access_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI11ContextNode",
   "name" : "ContextNode",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "bionic/libc/system_properties/include/system_properties/context_node.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__flag",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTI11atomic_flag",
   "name" : "atomic_flag",
   "size" : 1,
   "source_file" : "bionic/libc/include/bits/stdatomic.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "interval",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timeout",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11cisco_proto",
   "name" : "cisco_proto",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "events",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTI10epoll_data"
    }
   ],
   "linker_set_key" : "_ZTI11epoll_event",
   "name" : "epoll_event",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/epoll_event.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "e_termination",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "e_exit",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI11exit_status",
   "name" : "exit_status",
   "size" : 4,
   "source_file" : "bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "type_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "max_num_members",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11fanout_args",
   "name" : "fanout_args",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "raw",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA64_h"
    },
    {
     "field_name" : "size",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11fscrypt_key",
   "name" : "fscrypt_key",
   "size" : 72,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "uaddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11futex_waitv",
   "name" : "futex_waitv",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/futex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ifs_ifsu",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11if_settingsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI11if_settings",
   "name" : "if_settings",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mac",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI11ifla_vf_mac",
   "name" : "ifla_vf_mac",
   "size" : 36,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ipi6_addr",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "ipi6_ifindex",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11in6_pktinfo",
   "name" : "in6_pktinfo",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ip6m_addr",
     "referenced_type" : "_ZTI12sockaddr_in6"
    },
    {
     "field_name" : "ip6m_mtu",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11ip6_mtuinfo",
   "name" : "ip6_mtuinfo",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imsf_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imsf_fmode",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_numsrc",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "imsf_slist",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA1_7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI11ip_msfilter",
   "name" : "ip_msfilter",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/ip_msfilter.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "type",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "segments_left",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI11ipv6_rt_hdr",
   "name" : "ipv6_rt_hdr",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nm_status",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_group",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_uid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_gid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11nl_mmap_hdr",
   "name" : "nl_mmap_hdr",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nm_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_block_nr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_frame_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nm_frame_nr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11nl_mmap_req",
   "name" : "nl_mmap_req",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "alg",
     "field_offset" : 8200,
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "data",
     "field_offset" : 16416,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 16448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11ns_tsig_key",
   "name" : "ns_tsig_key",
   "size" : 2060,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mr_ifindex",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mr_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mr_alen",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mr_address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI11packet_mreq",
   "name" : "packet_mreq",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "categories",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11page_region",
   "name" : "page_region",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "size",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "start",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "end",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "walk_end",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vec",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "vec_len",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "max_pages",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "category_inverted",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "category_mask",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "category_anyof_mask",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "return_mask",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11pm_scan_arg",
   "name" : "pm_scan_arg",
   "size" : 96,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "next",
     "referenced_type" : "_ZTIP11robust_list"
    }
   ],
   "linker_set_key" : "_ZTI11robust_list",
   "name" : "robust_list",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/futex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "proto",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "u",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN11rta_sessionUt_E"
    }
   ],
   "linker_set_key" : "_ZTI11rta_session",
   "name" : "rta_session",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/refill.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/refill.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_send.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_send.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/stdlib/quick_exit.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/stdlib/quick_exit.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcpncpy.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcpncpy.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsdup.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsdup.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsnlen.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsnlen.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wmemcmp.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wmemcmp.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/dmisc.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/dmisc.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/hexnan.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/hexnan.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/strtord.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/strtord.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_netbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-netbsd/lib/libc/inet/nsap_addr.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_netbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-netbsd/lib/libc/inet/nsap_addr.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/crypt/arc4random.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/crypt/arc4random.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/alarm.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/alarm.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/getprogname.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/getprogname.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/warnx.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/warnx.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/locale/wcsxfrm.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/locale/wcsxfrm.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/inet_makeaddr.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/inet_makeaddr.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/res_random.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/res_random.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/fputws.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/fputws.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/open_memstream.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/open_memstream.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/vdprintf.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/vdprintf.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/div.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/div.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/ldiv.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/ldiv.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/tfind.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/tfind.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strdup.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strdup.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strlcpy.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strlcpy.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/wcslcpy.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/wcslcpy.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfprintf.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfprintf.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfwprintf.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfwprintf.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strstr.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strstr.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN11sigaction64Ut_E#ODR:out/soong/.intermediates/bionic/libc/libc_tzcode/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/locale/wcsftime.sdump"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10sigset64_t"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "self_type" : "_ZTI11sigaction64#ODR:out/soong/.intermediates/bionic/libc/libc_tzcode/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/locale/wcsftime.sdump",
   "size" : 20,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin_port",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin_addr",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI11sockaddr_in",
   "name" : "sockaddr_in",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sll_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sll_protocol",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sll_ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sll_hatype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sll_pkttype",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sll_halen",
     "field_offset" : 88,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "sll_addr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI11sockaddr_ll",
   "name" : "sockaddr_ll",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nl_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nl_pad",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nl_pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nl_groups",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11sockaddr_nl",
   "name" : "sockaddr_nl",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sun_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sun_path",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA108_c"
    }
   ],
   "linker_set_key" : "_ZTI11sockaddr_un",
   "name" : "sockaddr_un",
   "size" : 110,
   "source_file" : "bionic/libc/kernel/uapi/linux/un.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_status",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "tp_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_snaplen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_mac",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_net",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_sec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_usec",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11tpacket_hdr",
   "name" : "tpacket_hdr",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_block_nr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_frame_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_frame_nr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11tpacket_req",
   "name" : "tpacket_req",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_N11user_fpregs6fp_regE"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpsr",
     "field_offset" : 768,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpcr",
     "field_offset" : 800,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpregs",
     "referenced_type" : "_ZTIA8_6fp_reg"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpsr",
     "field_offset" : 768,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 32,
     "field_name" : "fpcr",
     "field_offset" : 800,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ftype",
     "field_offset" : 832,
     "referenced_type" : "_ZTIA8_h"
    },
    {
     "field_name" : "init_flag",
     "field_offset" : 896,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI11user_fpregs",
   "name" : "user_fpregs",
   "self_type" : "_ZTI11user_fpregs#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 116,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "size" : 20,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN12Elf32_auxv_tUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "size" : 20,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN12Elf64_auxv_tUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK10elf32_phdr"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dlpi_adds",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dlpi_subs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dlpi_tls_modid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dlpi_tls_data",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12dl_phdr_info",
   "name" : "dl_phdr_info",
   "size" : 40,
   "source_file" : "bionic/libc/include/link.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "ether_dhost",
     "referenced_type" : "_ZTIA6_h"
    },
    {
     "field_name" : "ether_shost",
     "field_offset" : 48,
     "referenced_type" : "_ZTIA6_h"
    },
    {
     "field_name" : "ether_type",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI12ether_header",
   "name" : "ether_header",
   "size" : 14,
   "source_file" : "bionic/libc/include/net/ethernet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlci",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12fr_proto_pvc",
   "name" : "fr_proto_pvc",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "minlen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI12fstrim_range",
   "name" : "fstrim_range",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12group_filterUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "size" : 268,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12group_filterUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "self_type" : "_ZTI12group_filter#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 268,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12group_filterUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "self_type" : "_ZTI12group_filter#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump",
   "size" : 268,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12group_filterUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "self_type" : "_ZTI12group_filter#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump",
   "size" : 268,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN12group_filterUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12group_filter",
   "name" : "group_filter",
   "self_type" : "_ZTI12group_filter#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump",
   "size" : 268,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__hsearch",
     "referenced_type" : "_ZTIP9__hsearch"
    }
   ],
   "linker_set_key" : "_ZTI12hsearch_data",
   "name" : "hsearch_data",
   "size" : 4,
   "source_file" : "bionic/libc/include/search.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "if_index",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "if_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI12if_nameindex",
   "name" : "if_nameindex",
   "size" : 8,
   "source_file" : "bionic/libc/include/net/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "filter_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12if_stats_msg",
   "name" : "if_stats_msg",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI12ifla_vf_guid",
   "name" : "ifla_vf_guid",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_tx_rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_tx_rate",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12ifla_vf_rate",
   "name" : "ifla_vf_rate",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vlan",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12ifla_vf_vlan",
   "name" : "ifla_vf_vlan",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "nexthdr",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hdrlen",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI12ipv6_opt_hdr",
   "name" : "ipv6_opt_hdr",
   "size" : 2,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nduseropt_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nduseropt_pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nduseropt_opts_len",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nduseropt_ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nduseropt_icmp_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nduseropt_icmp_code",
     "field_offset" : 72,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "nduseropt_pad2",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nduseropt_pad3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12nduseroptmsg",
   "name" : "nduseroptmsg",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "start_code",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "end_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "start_data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "end_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "start_brk",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "brk",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arg_start",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "arg_end",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "env_start",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "env_end",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "auxv",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPy"
    },
    {
     "field_name" : "auxv_size",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exe_fd",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12prctl_mm_map",
   "name" : "prctl_mm_map",
   "size" : 104,
   "source_file" : "bionic/libc/kernel/uapi/linux/prctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sin6_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin6_port",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sin6_flowinfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sin6_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "sin6_scope_id",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12sockaddr_in6",
   "name" : "sockaddr_in6",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "spkt_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "spkt_device",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA14_h"
    },
    {
     "field_name" : "spkt_protocol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI12sockaddr_pkt",
   "name" : "sockaddr_pkt",
   "size" : 18,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI12sys_timezone",
   "name" : "sys_timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "clock_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "clock_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "loopback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "slot_map",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12te1_settings",
   "name" : "te1_settings",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_status",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_snaplen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_mac",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_net",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_sec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_nsec",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_vlan_tci",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_vlan_tpid",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_padding",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI12tpacket2_hdr",
   "name" : "tpacket2_hdr",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_next_offset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_sec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_snaplen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_status",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_mac",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_net",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_offset" : 224,
     "referenced_type" : "_ZTIN12tpacket3_hdrUt_E"
    },
    {
     "field_name" : "tp_padding",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI12tpacket3_hdr",
   "name" : "tpacket3_hdr",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_block_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_block_nr",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_frame_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_frame_nr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_retire_blk_tov",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_sizeof_priv",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_feature_req_word",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12tpacket_req3",
   "name" : "tpacket_req3",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fpexc",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fpinst2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI12user_vfp_exc",
   "name" : "user_vfp_exc",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "prefixes_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP10PrefixNode"
    },
    {
     "access" : "protected",
     "field_name" : "contexts_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15ContextListNode"
    },
    {
     "access" : "protected",
     "field_name" : "serial_prop_area_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "protected",
     "field_name" : "filename_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI13ContextsSplit",
   "name" : "ContextsSplit",
   "record_kind" : "class",
   "size" : 20,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13ContextsSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit10InitializeEbPKcPbb"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "size" : 4,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "size" : 8,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "size" : 16,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "size" : 16,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "size" : 4,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "size" : 8,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "size" : 16,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "size" : 16,
   "source_file" : "bionic/libc/include/elf.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifa_prefered",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ifa_valid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstamp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tstamp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13ifa_cacheinfo",
   "name" : "ifa_cacheinfo",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_addr.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "vsi_mgr_id",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "vsi_type_id",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA3_h"
    },
    {
     "field_name" : "vsi_type_version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad",
     "field_offset" : 40,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTI13ifla_port_vsi",
   "name" : "ifla_port_vsi",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "setting",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13ifla_vf_trust",
   "name" : "ifla_vf_trust",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nr_inodes",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "nr_unused",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "dummy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA5_l"
    }
   ],
   "linker_set_key" : "_ZTI13inodes_stat_t",
   "name" : "inodes_stat_t",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "wd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "name",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA_c"
    }
   ],
   "linker_set_key" : "_ZTI13inotify_event",
   "name" : "inotify_event",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/inotify.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ndm_confirmed",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndm_used",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndm_updated",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ndm_refcnt",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13nda_cacheinfo",
   "name" : "nda_cacheinfo",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/neighbour.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rta_clntref",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_lastuse",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_expires",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rta_error",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_id",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_ts",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rta_tsage",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13rta_cacheinfo",
   "name" : "rta_cacheinfo",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mfcs_packets",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "mfcs_bytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "mfcs_wrong_if",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI13rta_mfc_stats",
   "name" : "rta_mfc_stats",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ts_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN13tpacket_bd_tsUt_E"
    }
   ],
   "linker_set_key" : "_ZTI13tpacket_bd_ts",
   "name" : "tpacket_bd_ts",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "req",
     "referenced_type" : "_ZTI11tpacket_req"
    },
    {
     "field_name" : "req3",
     "referenced_type" : "_ZTI12tpacket_req3"
    }
   ],
   "linker_set_key" : "_ZTI13tpacket_req_u",
   "name" : "tpacket_req_u",
   "record_kind" : "union",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_packets",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_drops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI13tpacket_stats",
   "name" : "tpacket_stats",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "prio",
     "referenced_type" : "_ZTIA2_h"
    },
    {
     "field_name" : "addr",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI14ifla_bridge_id",
   "name" : "ifla_bridge_id",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "max_reasm_len",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tstamp",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reachable_time",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "retrans_time",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14ifla_cacheinfo",
   "name" : "ifla_cacheinfo",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_sourceaddr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI14ip_mreq_source",
   "name" : "ip_mreq_source",
   "size" : 12,
   "source_file" : "bionic/libc/include/bits/ip_mreq_source.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "selector",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14nla_bitfield32",
   "name" : "nla_bitfield32",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "namelen",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "left",
     "field_offset" : 64,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "right",
     "field_offset" : 96,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "children",
     "field_offset" : 128,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "name",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI14prop_trie_node",
   "name" : "prop_trie_node",
   "size" : 20,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "entropy_count",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buf_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buf",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA_j"
    }
   ],
   "linker_set_key" : "_ZTI14rand_pool_info",
   "name" : "rand_pool_info",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/random.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "encoding",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "parity",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI14raw_hdlc_proto",
   "name" : "raw_hdlc_proto",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "block_status",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_pkts",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset_to_first_pkt",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blk_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "seq_num",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ts_first_pkt",
     "field_offset" : 192,
     "referenced_type" : "_ZTI13tpacket_bd_ts"
    },
    {
     "field_name" : "ts_last_pkt",
     "field_offset" : 256,
     "referenced_type" : "_ZTI13tpacket_bd_ts"
    }
   ],
   "linker_set_key" : "_ZTI14tpacket_hdr_v1",
   "name" : "tpacket_hdr_v1",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dce",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "modulo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "window",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "t1",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "t2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "n2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI14x25_hdlc_proto",
   "name" : "x25_hdlc_proto",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "off",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI15cachestat_range",
   "name" : "cachestat_range",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/mman.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15ifla_vf_tx_rate",
   "name" : "ifla_vf_tx_rate",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15ifla_vlan_flags",
   "name" : "ifla_vlan_flags",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rx_packets",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_packets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_bytes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_bytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_errors",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_errors",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_dropped",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_dropped",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "multicast",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_hw_stats64",
   "name" : "rtnl_hw_stats64",
   "size" : 72,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mem_start",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "mem_end",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "base_addr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "irq",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "dma",
     "field_offset" : 208,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "port",
     "field_offset" : 216,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_link_ifmap",
   "name" : "rtnl_link_ifmap",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rx_packets",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_packets",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_bytes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_bytes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_errors",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_errors",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_dropped",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_dropped",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multicast",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "collisions",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_length_errors",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_over_errors",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_crc_errors",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_frame_errors",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_fifo_errors",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_missed_errors",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_aborted_errors",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_carrier_errors",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_fifo_errors",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_heartbeat_errors",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_window_errors",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_compressed",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tx_compressed",
     "field_offset" : 704,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rx_nohandler",
     "field_offset" : 736,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI15rtnl_link_stats",
   "name" : "rtnl_link_stats",
   "size" : 96,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15statx_timestamp",
   "name" : "statx_timestamp",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_status",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_snaplen",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_mac",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_net",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_vlan_tci",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_vlan_tpid",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI15tpacket_auxdata",
   "name" : "tpacket_auxdata",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stats1",
     "referenced_type" : "_ZTI13tpacket_stats"
    },
    {
     "field_name" : "stats3",
     "referenced_type" : "_ZTI16tpacket_stats_v3"
    }
   ],
   "linker_set_key" : "_ZTI15tpacket_stats_u",
   "name" : "tpacket_stats_u",
   "record_kind" : "union",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pre_split_prop_area_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI16ContextsPreSplit",
   "name" : "ContextsPreSplit",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_pre_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16ContextsPreSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit10InitializeEbPKcPbb"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "contexts_data_",
     "referenced_type" : "_ZTIA288_c"
    },
    {
     "access" : "private",
     "field_name" : "appcompat_override_contexts_data_",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA288_c"
    },
    {
     "access" : "private",
     "field_name" : "contexts_",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIP8Contexts"
    },
    {
     "access" : "private",
     "field_name" : "appcompat_override_contexts_",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIP8Contexts"
    },
    {
     "access" : "private",
     "field_name" : "initialized_",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "properties_filename_",
     "field_offset" : 4680,
     "referenced_type" : "_ZTI18PropertiesFilename"
    },
    {
     "access" : "private",
     "field_name" : "appcompat_filename_",
     "field_offset" : 5704,
     "referenced_type" : "_ZTI18PropertiesFilename"
    }
   ],
   "linker_set_key" : "_ZTI16SystemProperties",
   "name" : "SystemProperties",
   "record_kind" : "class",
   "size" : 844,
   "source_file" : "bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "src_fd",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "src_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "src_length",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dest_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI16file_clone_range",
   "name" : "file_clone_range",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gsr_interface",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gsr_group",
     "field_offset" : 32,
     "referenced_type" : "_ZTI16sockaddr_storage"
    },
    {
     "field_name" : "gsr_source",
     "field_offset" : 1056,
     "referenced_type" : "_ZTI16sockaddr_storage"
    }
   ],
   "linker_set_key" : "_ZTI16group_source_req",
   "name" : "group_source_req",
   "size" : 260,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16ifla_rmnet_flags",
   "name" : "ifla_rmnet_flags",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "setting",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16ifla_vf_spoofchk",
   "name" : "ifla_vf_spoofchk",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "length",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "addr",
     "field_offset" : 16,
     "referenced_type" : "_ZTI8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI16ipv6_destopt_hao",
   "name" : "ipv6_destopt_hao",
   "size" : 18,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "preferred_time",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "valid_time",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16prefix_cacheinfo",
   "name" : "prefix_cacheinfo",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "list",
     "referenced_type" : "_ZTI11robust_list"
    },
    {
     "field_name" : "futex_offset",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "list_op_pending",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP11robust_list"
    }
   ],
   "linker_set_key" : "_ZTI16robust_list_head",
   "name" : "robust_list_head",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/futex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "filter_off",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI16seccomp_metadata",
   "name" : "seccomp_metadata",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/ptrace.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ssi_signo",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_uid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_fd",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_band",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_overrun",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_trapno",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ssi_status",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_int",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_ptr",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ssi_utime",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ssi_stime",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ssi_addr",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ssi_addr_lsb",
     "field_offset" : 640,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__pad2",
     "field_offset" : 656,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ssi_syscall",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ssi_call_addr",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "ssi_arch",
     "field_offset" : 768,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 800,
     "referenced_type" : "_ZTIA28_h"
    }
   ],
   "linker_set_key" : "_ZTI16signalfd_siginfo",
   "name" : "signalfd_siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/signalfd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN16sockaddr_storageUt_E"
    }
   ],
   "linker_set_key" : "_ZTI16sockaddr_storage",
   "name" : "sockaddr_storage",
   "size" : 128,
   "source_file" : "bionic/libc/include/bits/sockaddr_storage.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_packets",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_drops",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_freeze_q_cnt",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16tpacket_stats_v3",
   "name" : "tpacket_stats_v3",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "reserved_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "relro_fd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "library_fd",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "library_fd_offset",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "library_namespace",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP19android_namespace_t"
    }
   ],
   "linker_set_key" : "_ZTI17android_dlextinfo",
   "name" : "android_dlextinfo",
   "size" : 40,
   "source_file" : "bionic/libc/include/android/dlext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "src_offset",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "src_length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "dest_count",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 144,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA_22file_dedupe_range_info"
    }
   ],
   "linker_set_key" : "_ZTI17file_dedupe_range",
   "name" : "file_dedupe_range",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "nr_files",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "nr_free_files",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "max_files",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI17files_stat_struct",
   "name" : "files_stat_struct",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dlci",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "master",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI17fr_proto_pvc_info",
   "name" : "fr_proto_pvc_info",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "contents_encryption_mode",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filenames_encryption_mode",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "master_key_descriptor",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI17fscrypt_policy_v1",
   "name" : "fscrypt_policy_v1",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "contents_encryption_mode",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "filenames_encryption_mode",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "log2_data_unit_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 40,
     "referenced_type" : "_ZTIA3_h"
    },
    {
     "field_name" : "master_key_identifier",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTI17fscrypt_policy_v2",
   "name" : "fscrypt_policy_v2",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "broadcast",
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI17ifla_vf_broadcast",
   "name" : "ifla_vf_broadcast",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vlan",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "qos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vlan_proto",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI17ifla_vf_vlan_info",
   "name" : "ifla_vf_vlan_info",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flr_dst",
     "referenced_type" : "_ZTI8in6_addr"
    },
    {
     "field_name" : "flr_label",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flr_action",
     "field_offset" : 160,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flr_share",
     "field_offset" : 168,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flr_flags",
     "field_offset" : 176,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flr_expires",
     "field_offset" : 192,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flr_linger",
     "field_offset" : 208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__flr_pad",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17in6_flowlabel_req",
   "name" : "in6_flowlabel_req",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/in6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "counter",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "key",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7dst_key"
    },
    {
     "field_name" : "ctx",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "sig",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA512_h"
    },
    {
     "field_name" : "siglen",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI17ns_tcp_tsig_state",
   "name" : "ns_tcp_tsig_state",
   "size" : 528,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "selector",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "len",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI17ptrace_sud_config",
   "name" : "ptrace_sud_config",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/ptrace.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rx_packets",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_packets",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_bytes",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_bytes",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_errors",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_errors",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_dropped",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_dropped",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "multicast",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "collisions",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_length_errors",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_over_errors",
     "field_offset" : 704,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_crc_errors",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_frame_errors",
     "field_offset" : 832,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_fifo_errors",
     "field_offset" : 896,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_missed_errors",
     "field_offset" : 960,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_aborted_errors",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_carrier_errors",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_fifo_errors",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_heartbeat_errors",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_window_errors",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_compressed",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tx_compressed",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_nohandler",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rx_otherhost_dropped",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI17rtnl_link_stats64",
   "name" : "rtnl_link_stats64",
   "size" : 200,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dirname_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "tree_filename_",
     "field_offset" : 64,
     "referenced_type" : "_ZTI18PropertiesFilename"
    },
    {
     "access" : "private",
     "field_name" : "serial_filename_",
     "field_offset" : 1088,
     "referenced_type" : "_ZTI18PropertiesFilename"
    },
    {
     "access" : "private",
     "field_name" : "property_info_area_file_",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIP11ContextNode"
    },
    {
     "access" : "private",
     "field_name" : "num_context_nodes_",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_mmap_size_",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "serial_prop_area_",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI18ContextsSerialized",
   "name" : "ContextsSerialized",
   "record_kind" : "class",
   "size" : 288,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_serialized.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18ContextsSerialized"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD0Ev"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized10InitializeEbPKcPbb"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "filename_",
     "referenced_type" : "_ZTIA128_c"
    }
   ],
   "linker_set_key" : "_ZTI18PropertiesFilename",
   "name" : "PropertiesFilename",
   "record_kind" : "class",
   "size" : 128,
   "source_file" : "bionic/libc/system_properties/include/system_properties/properties_filename.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__func",
     "referenced_type" : "_ZTIPFiPvE"
    },
    {
     "field_name" : "__arg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI18__bionic_thrd_data",
   "name" : "__bionic_thrd_data",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/threads_inlines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/refill.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/refill.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_send.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_send.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/stdlib/quick_exit.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/stdlib/quick_exit.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcpncpy.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcpncpy.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsdup.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsdup.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsnlen.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsnlen.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wmemcmp.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wmemcmp.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/dmisc.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/dmisc.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/hexnan.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/hexnan.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/strtord.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/strtord.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_netbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-netbsd/lib/libc/inet/nsap_addr.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_netbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-netbsd/lib/libc/inet/nsap_addr.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/crypt/arc4random.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/crypt/arc4random.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/alarm.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/alarm.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/getprogname.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/getprogname.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/warnx.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gen/warnx.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/locale/wcsxfrm.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/locale/wcsxfrm.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/inet_makeaddr.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/inet_makeaddr.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/res_random.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/net/res_random.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/fputws.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/fputws.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/open_memstream.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/open_memstream.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/vdprintf.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdio/vdprintf.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/div.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/div.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/ldiv.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/ldiv.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/tfind.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/stdlib/tfind.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strdup.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strdup.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strlcpy.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strlcpy.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/wcslcpy.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/wcslcpy.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfprintf.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfprintf.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfwprintf.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/stdio/vfwprintf.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strstr.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_openbsd_large_stack/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/string/strstr.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "_ZTIN18__kernel_sigactionUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_tzcode/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/locale/wcsftime.sdump"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "self_type" : "_ZTI18__kernel_sigaction#ODR:out/soong/.intermediates/bionic/libc/libc_tzcode/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/locale/wcsftime.sdump",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "link_state",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18ifla_vf_link_state",
   "name" : "ifla_vf_link_state",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset_to_priv",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hdr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI19tpacket_bd_header_u"
    }
   ],
   "linker_set_key" : "_ZTI18tpacket_block_desc",
   "name" : "tpacket_block_desc",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "size" : 12,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key_spec",
     "referenced_type" : "_ZTI21fscrypt_key_specifier"
    },
    {
     "field_name" : "raw_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "key_id",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA7_j"
    },
    {
     "field_name" : "__flags",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "raw",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA_h"
    }
   ],
   "linker_set_key" : "_ZTI19fscrypt_add_key_arg",
   "name" : "fscrypt_add_key_arg",
   "size" : 80,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "op",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "pad",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA3_h"
    },
    {
     "field_name" : "arch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "instruction_pointer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_pointer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_offset" : 192,
     "referenced_type" : "_ZTIN19ptrace_syscall_infoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI19ptrace_syscall_info",
   "name" : "ptrace_syscall_info",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/ptrace.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bh1",
     "referenced_type" : "_ZTI14tpacket_hdr_v1"
    }
   ],
   "linker_set_key" : "_ZTI19tpacket_bd_header_u",
   "name" : "tpacket_bd_header_u",
   "record_kind" : "union",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vf",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "setting",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI20ifla_vf_rss_query_en",
   "name" : "ifla_vf_rss_query_en",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "clock_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "clock_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "loopback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI20sync_serial_settings",
   "name" : "sync_serial_settings",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/hdlc/ioctl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tp_rxhash",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_vlan_tci",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tp_vlan_tpid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tp_padding",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI20tpacket_hdr_variant1",
   "name" : "tpacket_hdr_variant1",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIP24__kernel_legacy_semid_ds"
    },
    {
     "field_name" : "array",
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "__buf",
     "referenced_type" : "_ZTIP7seminfo"
    },
    {
     "field_name" : "__pad",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_legacy_semun",
   "name" : "__kernel_legacy_semun",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/sem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "u",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN21fscrypt_key_specifierUt_E"
    }
   ],
   "linker_set_key" : "_ZTI21fscrypt_key_specifier",
   "name" : "fscrypt_key_specifier",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "from",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "to",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21ifla_vlan_qos_mapping",
   "name" : "ifla_vlan_qos_mapping",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "low",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "high",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI21ifla_vxlan_port_range",
   "name" : "ifla_vxlan_port_range",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_link.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dest_fd",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "dest_offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bytes_deduped",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "status",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI22file_dedupe_range_info",
   "name" : "file_dedupe_range_info",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key_spec",
     "referenced_type" : "_ZTI21fscrypt_key_specifier"
    },
    {
     "field_name" : "removal_status_flags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 352,
     "referenced_type" : "_ZTIA5_j"
    }
   ],
   "linker_set_key" : "_ZTI22fscrypt_remove_key_arg",
   "name" : "fscrypt_remove_key_arg",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tp_all",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tp_huge",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tp_failed",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI22tpacket_rollover_stats",
   "name" : "tpacket_rollover_stats",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_packet.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "off",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI23ptrace_peeksiginfo_args",
   "name" : "ptrace_peeksiginfo_args",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/ptrace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "gid",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "cuid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "cgid",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "mode",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "seq",
     "field_offset" : 112,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI24__kernel_legacy_ipc_perm",
   "name" : "__kernel_legacy_ipc_perm",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipc.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_perm",
     "referenced_type" : "_ZTI24__kernel_legacy_ipc_perm"
    },
    {
     "field_name" : "msg_first",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP3msg"
    },
    {
     "field_name" : "msg_last",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP3msg"
    },
    {
     "field_name" : "msg_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "msg_rtime",
     "field_offset" : 224,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "msg_ctime",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "msg_lcbytes",
     "field_offset" : 288,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_lqbytes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "msg_cbytes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "msg_qnum",
     "field_offset" : 368,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "msg_qbytes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "msg_lspid",
     "field_offset" : 400,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "msg_lrpid",
     "field_offset" : 416,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI24__kernel_legacy_msqid_ds",
   "name" : "__kernel_legacy_msqid_ds",
   "size" : 56,
   "source_file" : "bionic/libc/kernel/uapi/linux/msg.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sem_perm",
     "referenced_type" : "_ZTI24__kernel_legacy_ipc_perm"
    },
    {
     "field_name" : "sem_otime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "sem_ctime",
     "field_offset" : 160,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "sem_base",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP3sem"
    },
    {
     "field_name" : "sem_pending",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9sem_queue"
    },
    {
     "field_name" : "sem_pending_last",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPP9sem_queue"
    },
    {
     "field_name" : "undo",
     "field_offset" : 288,
     "referenced_type" : "_ZTIP8sem_undo"
    },
    {
     "field_name" : "sem_nsems",
     "field_offset" : 320,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI24__kernel_legacy_semid_ds",
   "name" : "__kernel_legacy_semid_ds",
   "size" : 44,
   "source_file" : "bionic/libc/kernel/uapi/linux/sem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shm_perm",
     "referenced_type" : "_ZTI24__kernel_legacy_ipc_perm"
    },
    {
     "field_name" : "shm_segsz",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shm_atime",
     "field_offset" : 160,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "shm_dtime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "shm_ctime",
     "field_offset" : 224,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "shm_cpid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "shm_lpid",
     "field_offset" : 272,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "shm_nattch",
     "field_offset" : 288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "shm_unused",
     "field_offset" : 304,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "shm_unused2",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "shm_unused3",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI24__kernel_legacy_shmid_ds",
   "name" : "__kernel_legacy_shmid_ds",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/linux/shm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "policy_size",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "policy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN25fscrypt_get_policy_ex_argUt_E"
    }
   ],
   "linker_set_key" : "_ZTI25fscrypt_get_policy_ex_arg",
   "name" : "fscrypt_get_policy_ex_arg",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "rseq_abi_pointer",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "rseq_abi_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "signature",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pad",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI25ptrace_rseq_configuration",
   "name" : "ptrace_rseq_configuration",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/ptrace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key_spec",
     "referenced_type" : "_ZTI21fscrypt_key_specifier"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA6_j"
    },
    {
     "field_name" : "status",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "status_flags",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "user_count",
     "field_offset" : 576,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__out_reserved",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA13_j"
    }
   ],
   "linker_set_key" : "_ZTI26fscrypt_get_key_status_arg",
   "name" : "fscrypt_get_key_status_arg",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "size" : 44,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "raw",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA_h"
    }
   ],
   "linker_set_key" : "_ZTI32fscrypt_provisioning_key_payload",
   "name" : "fscrypt_provisioning_key_payload",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/fscrypt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fts_cur",
     "referenced_type" : "_ZTIP7_ftsent"
    },
    {
     "field_name" : "fts_child",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7_ftsent"
    },
    {
     "field_name" : "fts_array",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPP7_ftsent"
    },
    {
     "field_name" : "fts_dev",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_path",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "fts_rfd",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fts_pathlen",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_nitems",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fts_compar",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFivE"
    },
    {
     "field_name" : "fts_options",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI3FTS",
   "name" : "FTS",
   "size" : 40,
   "source_file" : "bionic/libc/include/fts.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "level",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI3FTW",
   "name" : "FTW",
   "size" : 8,
   "source_file" : "bionic/libc/include/ftw.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tms_utime",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tms_stime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tms_cutime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tms_cstime",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI3tms",
   "name" : "tms",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/times.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI4stat",
   "name" : "stat",
   "size" : 104,
   "source_file" : "bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTI9user_regs"
    },
    {
     "field_name" : "u_fpvalid",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_tsize",
     "field_offset" : 608,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_dsize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_ssize",
     "field_offset" : 672,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_code",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "start_stack",
     "field_offset" : 736,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "signal",
     "field_offset" : 768,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "u_ar0",
     "field_offset" : 832,
     "referenced_type" : "_ZTIP9user_regs"
    },
    {
     "field_name" : "magic",
     "field_offset" : 864,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "u_comm",
     "field_offset" : 896,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "u_debugreg",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA8_i"
    },
    {
     "field_name" : "u_fp",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI11user_fpregs#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    },
    {
     "field_name" : "u_fp0",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIP11user_fpregs#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    }
   ],
   "linker_set_key" : "_ZTI4user",
   "name" : "user",
   "self_type" : "_ZTI4user#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 296,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ut_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "ut_pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ut_line",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ut_id",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA4_c"
    },
    {
     "field_name" : "ut_user",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ut_host",
     "field_offset" : 224,
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "ut_exit",
     "field_offset" : 352,
     "referenced_type" : "_ZTI11exit_status"
    },
    {
     "field_name" : "ut_session",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ut_tv",
     "field_offset" : 416,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ut_addr_v6",
     "field_offset" : 480,
     "referenced_type" : "_ZTIA4_i"
    },
    {
     "field_name" : "unused",
     "field_offset" : 608,
     "referenced_type" : "_ZTIA20_c"
    }
   ],
   "linker_set_key" : "_ZTI4utmp",
   "name" : "utmp",
   "size" : 96,
   "source_file" : "bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI5entry",
   "name" : "entry",
   "size" : 8,
   "source_file" : "bionic/libc/include/search.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5flock",
   "name" : "flock",
   "self_type" : "_ZTI5flock#ODR:out/soong/.intermediates/bionic/libc/libc_tzcode/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/tzcode/localtime.sdump",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gr_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "gr_passwd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "gr_gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gr_mem",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI5group",
   "name" : "group",
   "size" : 16,
   "source_file" : "bionic/libc/include/grp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mem_start",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "mem_end",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "base_addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "irq",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "dma",
     "field_offset" : 88,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "port",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI5ifmap",
   "name" : "ifmap",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifr_ifrn",
     "referenced_type" : "_ZTIN5ifreqUt_E"
    },
    {
     "field_name" : "ifr_ifru",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN5ifreqUt0_E"
    }
   ],
   "linker_set_key" : "_ZTI5ifreq",
   "name" : "ifreq",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifr_ifrn",
     "referenced_type" : "_ZTIN5ifreqUt_E"
    },
    {
     "field_name" : "ifr_ifru",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN5ifreqUt_E"
    }
   ],
   "linker_set_key" : "_ZTI5ifreq",
   "name" : "ifreq",
   "self_type" : "_ZTI5ifreq#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5iovec",
   "name" : "iovec",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/uio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "size" : 56,
   "source_file" : "bionic/libc/include/locale.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ndm_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ndm_pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ndm_pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ndm_ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ndm_state",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ndm_flags",
     "field_offset" : 80,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ndm_type",
     "field_offset" : 88,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI5ndmsg",
   "name" : "ndmsg",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/neighbour.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rtm_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_dst_len",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_src_len",
     "field_offset" : 16,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_tos",
     "field_offset" : 24,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_table",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_protocol",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_scope",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_type",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "rtm_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5rtmsg",
   "name" : "rtmsg",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "rtvia_family",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rtvia_addr",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA_h"
    }
   ],
   "linker_set_key" : "_ZTI5rtvia",
   "name" : "rtvia",
   "size" : 2,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "count",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5sem_t",
   "name" : "sem_t",
   "size" : 4,
   "source_file" : "bionic/libc/include/semaphore.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIP10semid64_ds"
    },
    {
     "field_name" : "array",
     "referenced_type" : "_ZTIPt"
    },
    {
     "field_name" : "__buf",
     "referenced_type" : "_ZTIP7seminfo"
    },
    {
     "field_name" : "__pad",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI5semun",
   "name" : "semun",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/include/sys/sem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "stx_mask",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_blksize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_attributes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_nlink",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_uid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_gid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_mode",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__spare0",
     "field_offset" : 240,
     "referenced_type" : "_ZTIA1_t"
    },
    {
     "field_name" : "stx_ino",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_blocks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_attributes_mask",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_atime",
     "field_offset" : 512,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_btime",
     "field_offset" : 640,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_ctime",
     "field_offset" : 768,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_mtime",
     "field_offset" : 896,
     "referenced_type" : "_ZTI15statx_timestamp"
    },
    {
     "field_name" : "stx_rdev_major",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_rdev_minor",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_major",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dev_minor",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_mnt_id",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stx_dio_mem_align",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stx_dio_offset_align",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__spare3",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIA12_y"
    }
   ],
   "linker_set_key" : "_ZTI5statx",
   "name" : "statx",
   "size" : 256,
   "source_file" : "bionic/libc/kernel/uapi/linux/stat.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tcm_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "tcm__pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "tcm__pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "tcm_ifindex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tcm_handle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tcm_parent",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tcm_info",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5tcmsg",
   "name" : "tcmsg",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI5ucred",
   "name" : "ucred",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "bit_width" : 16,
     "field_name" : "id",
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "rd",
     "field_offset" : 16,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "tc",
     "field_offset" : 17,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "aa",
     "field_offset" : 18,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 4,
     "field_name" : "opcode",
     "field_offset" : 19,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "qr",
     "field_offset" : 23,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 4,
     "field_name" : "rcode",
     "field_offset" : 24,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "cd",
     "field_offset" : 28,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "ad",
     "field_offset" : 29,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "unused",
     "field_offset" : 30,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "ra",
     "field_offset" : 31,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 16,
     "field_name" : "qdcount",
     "field_offset" : 32,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 16,
     "field_name" : "ancount",
     "field_offset" : 48,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 16,
     "field_name" : "nscount",
     "field_offset" : 64,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 16,
     "field_name" : "arcount",
     "field_offset" : 80,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6HEADER",
   "name" : "HEADER",
   "size" : 12,
   "source_file" : "bionic/libc/include/arpa/nameser_compat.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ar_hrd",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ar_pro",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ar_hln",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ar_pln",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ar_op",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6arphdr",
   "name" : "arphdr",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_arp.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arp_pa",
     "referenced_type" : "_ZTI8sockaddr"
    },
    {
     "field_name" : "arp_ha",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sockaddr"
    },
    {
     "field_name" : "arp_flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "arp_netmask",
     "field_offset" : 288,
     "referenced_type" : "_ZTI8sockaddr"
    },
    {
     "field_name" : "arp_dev",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI6arpreq",
   "name" : "arpreq",
   "size" : 68,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_arp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI6dirent",
   "name" : "dirent",
   "size" : 280,
   "source_file" : "bionic/libc/include/dirent.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "h_dest",
     "referenced_type" : "_ZTIA6_h"
    },
    {
     "field_name" : "h_source",
     "field_offset" : 48,
     "referenced_type" : "_ZTIA6_h"
    },
    {
     "field_name" : "h_proto",
     "field_offset" : 96,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6ethhdr",
   "name" : "ethhdr",
   "size" : 14,
   "source_file" : "bionic/libc/kernel/uapi/linux/if_ether.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "bit_width" : 1,
     "field_name" : "sign1",
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 15,
     "field_name" : "unused",
     "field_offset" : 1,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "sign2",
     "field_offset" : 16,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 14,
     "field_name" : "exponent",
     "field_offset" : 17,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 1,
     "field_name" : "j",
     "field_offset" : 31,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 31,
     "field_name" : "mantissa1",
     "field_offset" : 32,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    },
    {
     "bit_width" : 32,
     "field_name" : "mantissa0",
     "field_offset" : 64,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6fp_reg",
   "name" : "fp_reg",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "gl_pathc",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_matchc",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_offs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gl_flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "gl_pathv",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "gl_errfunc",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiPKciE"
    },
    {
     "field_name" : "gl_closedir",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "gl_readdir",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP6direntPvE"
    },
    {
     "field_name" : "gl_opendir",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFPvPKcE"
    },
    {
     "field_name" : "gl_lstat",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFiPKcP4statE"
    },
    {
     "field_name" : "gl_stat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiPKcP4statE"
    }
   ],
   "linker_set_key" : "_ZTI6glob_t",
   "name" : "glob_t",
   "size" : 44,
   "source_file" : "bionic/libc/include/glob.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifc_len",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ifc_ifcu",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN6ifconfUt_E"
    }
   ],
   "linker_set_key" : "_ZTI6ifconf",
   "name" : "ifconf",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifc_len",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ifc_ifcu",
     "field_offset" : 32,
     "referenced_type" : "_ZTIN6ifconfUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    }
   ],
   "linker_set_key" : "_ZTI6ifconf",
   "name" : "ifconf",
   "self_type" : "_ZTI6ifconf#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/if.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6linger",
   "name" : "linger",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mnt_fsname",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_dir",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_opts",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mnt_freq",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mnt_passno",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6mntent",
   "name" : "mntent",
   "size" : 24,
   "source_file" : "bionic/libc/include/mntent.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mtype",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "mtext",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTI6msgbuf",
   "name" : "msgbuf",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/msg.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP5iovec"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6msghdr",
   "name" : "msghdr",
   "size" : 28,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "ndtm_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ndtm_pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "ndtm_pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6ndtmsg",
   "name" : "ndtmsg",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/neighbour.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "n_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "n_addrtype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "n_net",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6netent",
   "name" : "netent",
   "size" : 16,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "nla_len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nla_type",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6nlattr",
   "name" : "nlattr",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/netlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "has_arg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flag",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "val",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI6option",
   "name" : "option",
   "size" : 16,
   "source_file" : "bionic/libc/include/getopt.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "pw_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_passwd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_uid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pw_gid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "pw_dir",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "pw_shell",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI6passwd",
   "name" : "passwd",
   "size" : 24,
   "source_file" : "bionic/libc/include/pwd.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fd",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "events",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "revents",
     "field_offset" : 48,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI6pollfd",
   "name" : "pollfd",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/poll.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rlim_cur",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "rlim_max",
     "field_offset" : 32,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI6rlimit",
   "name" : "rlimit",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/resource.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "rta_len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rta_type",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6rtattr",
   "name" : "rtattr",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ru_utime",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ru_stime",
     "field_offset" : 64,
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "ru_maxrss",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_ixrss",
     "field_offset" : 160,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_idrss",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_isrss",
     "field_offset" : 224,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_minflt",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_majflt",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nswap",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_inblock",
     "field_offset" : 352,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_oublock",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_msgsnd",
     "field_offset" : 416,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_msgrcv",
     "field_offset" : 448,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nsignals",
     "field_offset" : 480,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nvcsw",
     "field_offset" : 512,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ru_nivcsw",
     "field_offset" : 544,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6rusage",
   "name" : "rusage",
   "size" : 72,
   "source_file" : "bionic/libc/kernel/uapi/linux/resource.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "sem_num",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sem_op",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "sem_flg",
     "field_offset" : 32,
     "referenced_type" : "_ZTIs"
    }
   ],
   "linker_set_key" : "_ZTI6sembuf",
   "name" : "sembuf",
   "size" : 6,
   "source_file" : "bionic/libc/kernel/uapi/linux/sem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_dev",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad0",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__st_ino",
     "field_offset" : 96,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_mode",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_nlink",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_gid",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "st_rdev",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__pad3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "st_blksize",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "st_blocks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "st_atim",
     "field_offset" : 576,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_mtim",
     "field_offset" : 640,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ctim",
     "field_offset" : 704,
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "st_ino",
     "field_offset" : 768,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI6stat64",
   "name" : "stat64",
   "size" : 104,
   "source_file" : "bionic/libc/include/sys/stat.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f_type",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f_bsize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f_blocks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f_bfree",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f_bavail",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f_files",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f_ffree",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "f_fsid",
     "field_offset" : 384,
     "referenced_type" : "_ZTI8__fsid_t"
    },
    {
     "field_name" : "f_namelen",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f_frsize",
     "field_offset" : 480,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f_flags",
     "field_offset" : 512,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "f_spare",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA4_j"
    }
   ],
   "linker_set_key" : "_ZTI6statfs",
   "name" : "statfs",
   "size" : 88,
   "source_file" : "bionic/libc/include/sys/vfs.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "tca_family",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "tca__pad1",
     "field_offset" : 8,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "tca__pad2",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI6tcamsg",
   "name" : "tcamsg",
   "size" : 4,
   "source_file" : "bionic/libc/kernel/uapi/linux/rtnetlink.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "c_iflag",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "c_oflag",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "c_cflag",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "c_lflag",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "c_line",
     "field_offset" : 64,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "c_cc",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI6termio",
   "name" : "termio",
   "size" : 18,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/termios.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7Dl_info",
   "name" : "Dl_info",
   "size" : 16,
   "source_file" : "bionic/libc/include/dlfcn.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIA1025_c"
    },
    {
     "field_name" : "type",
     "field_offset" : 8208,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rr_class",
     "field_offset" : 8224,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "ttl",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "rdlength",
     "field_offset" : 8288,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "rdata",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPKh"
    }
   ],
   "linker_set_key" : "_ZTI7__ns_rr",
   "name" : "__ns_rr",
   "size" : 1044,
   "source_file" : "bionic/libc/include/arpa/nameser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fts_cycle",
     "referenced_type" : "_ZTIP7_ftsent"
    },
    {
     "field_name" : "fts_parent",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP7_ftsent"
    },
    {
     "field_name" : "fts_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP7_ftsent"
    },
    {
     "field_name" : "fts_number",
     "field_offset" : 96,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "fts_pointer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "fts_accpath",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "fts_path",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "fts_errno",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fts_symfd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "fts_pathlen",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_namelen",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_ino",
     "field_offset" : 352,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fts_dev",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_nlink",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fts_level",
     "field_offset" : 448,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "fts_info",
     "field_offset" : 464,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "fts_flags",
     "field_offset" : 480,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "fts_instr",
     "field_offset" : 496,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "fts_statp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP4stat"
    },
    {
     "field_name" : "fts_name",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA1_c"
    }
   ],
   "linker_set_key" : "_ZTI7_ftsent",
   "name" : "_ftsent",
   "size" : 72,
   "source_file" : "bionic/libc/include/fts.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7cmsghdr",
   "name" : "cmsghdr",
   "size" : 12,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7flock64",
   "name" : "flock64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/flock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fsx_xflags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsx_extsize",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsx_nextents",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsx_projid",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsx_cowextsize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsx_pad",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA8_h"
    }
   ],
   "linker_set_key" : "_ZTI7fsxattr",
   "name" : "fsxattr",
   "size" : 28,
   "source_file" : "bionic/libc/kernel/uapi/linux/fs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "h_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "h_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "h_addrtype",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_length",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_addr_list",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPPc"
    }
   ],
   "linker_set_key" : "_ZTI7hostent",
   "name" : "hostent",
   "size" : 20,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ifa_next",
     "referenced_type" : "_ZTIP7ifaddrs"
    },
    {
     "field_name" : "ifa_name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "ifa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ifa_addr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP8sockaddr"
    },
    {
     "field_name" : "ifa_netmask",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8sockaddr"
    },
    {
     "field_name" : "ifa_ifu",
     "field_offset" : 160,
     "referenced_type" : "_ZTIN7ifaddrsUt_E"
    },
    {
     "field_name" : "ifa_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7ifaddrs",
   "name" : "ifaddrs",
   "size" : 28,
   "source_file" : "bionic/libc/include/ifaddrs.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_addr",
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7in_addr",
   "name" : "in_addr",
   "size" : 4,
   "source_file" : "bionic/libc/include/bits/in_addr.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "imr_multiaddr",
     "referenced_type" : "_ZTI7in_addr"
    },
    {
     "field_name" : "imr_interface",
     "field_offset" : 32,
     "referenced_type" : "_ZTI7in_addr"
    }
   ],
   "linker_set_key" : "_ZTI7ip_mreq",
   "name" : "ip_mreq",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/in.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "bit_width" : 4,
     "field_name" : "priority",
     "is_bit_field" : true,
     "referenced_type" : "_ZTIh"
    },
    {
     "bit_width" : 4,
     "field_name" : "version",
     "field_offset" : 4,
     "is_bit_field" : true,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "flow_lbl",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA3_h"
    },
    {
     "field_name" : "payload_len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "nexthdr",
     "field_offset" : 48,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hop_limit",
     "field_offset" : 56,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7ipv6hdrUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7ipv6hdr",
   "name" : "ipv6hdr",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ll_time",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "ll_line",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "ll_host",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI7lastlog",
   "name" : "lastlog",
   "size" : 28,
   "source_file" : "bionic/libc/include/utmp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "_ZTI6msghdr"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7mmsghdr",
   "name" : "mmsghdr",
   "size" : 32,
   "source_file" : "bionic/libc/include/sys/socket.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msgpool",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgmap",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgmax",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgmnb",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgmni",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgssz",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgtql",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "msgseg",
     "field_offset" : 224,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTI7msginfo",
   "name" : "msginfo",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/msg.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "uregs",
     "referenced_type" : "_ZTIA18_l"
    }
   ],
   "linker_set_key" : "_ZTI7pt_regs",
   "name" : "pt_regs",
   "size" : 72,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm/asm/ptrace.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP8link_map"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7r_debug7$RT_ADDE"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI7r_debug",
   "name" : "r_debug",
   "size" : 20,
   "source_file" : "bionic/libc/include/link.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "re_magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "re_nsub",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "re_endp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "re_g",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP7re_guts"
    }
   ],
   "linker_set_key" : "_ZTI7regex_t",
   "name" : "regex_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/regex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "_ZTI11ipv6_rt_hdr"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA_8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI7rt0_hdr",
   "name" : "rt0_hdr",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rt_hdr",
     "referenced_type" : "_ZTI11ipv6_rt_hdr"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "addr",
     "field_offset" : 64,
     "referenced_type" : "_ZTI8in6_addr"
    }
   ],
   "linker_set_key" : "_ZTI7rt2_hdr",
   "name" : "rt2_hdr",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/linux/ipv6.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "semmap",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semmni",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semmns",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semmnu",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semmsl",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semopm",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semume",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semusz",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semvmx",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "semaem",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7seminfo",
   "name" : "seminfo",
   "size" : 40,
   "source_file" : "bionic/libc/kernel/uapi/linux/sem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "s_name",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "s_aliases",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPPc"
    },
    {
     "field_name" : "s_port",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "s_proto",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI7servent",
   "name" : "servent",
   "size" : 16,
   "source_file" : "bionic/libc/include/netdb.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shmmax",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shmmin",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shmmni",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shmseg",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shmall",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI7shminfo",
   "name" : "shminfo",
   "size" : 20,
   "source_file" : "bionic/libc/kernel/uapi/linux/shm.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/bionic/time64.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/parsefloat.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_bionic/android_arm_armv7-a-neon_static_apex10000/0e7aadb4ccf134e3003f27a606ef3a68/obj/bionic/libc/stdio/refill.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_name.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_parse.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/nameser/ns_print.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/net/getaddrinfo.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_cache.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_send.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_fortify/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/bionic/fortify.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/stdlib/quick_exit.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcpncpy.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsdup.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wcsnlen.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_freebsd/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-freebsd/lib/libc/string/wmemcmp.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/android/gdtoa_support.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/dmisc.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/hexnan.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E#ODR:out/soong/.intermediates/bionic/libc/libc_dns/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/dns/resolv/res_data.sdump"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "self_type" : "_ZTI7siginfo#ODR:out/soong/.intermediates/bionic/libc/libc_gdtoa/android_arm_armv7-a-neon_static_apex10000/obj/bionic/libc/upstream-openbsd/lib/libc/gdtoa/strtord.sdump",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
