{
 "array_types" :
 [
  {
   "linker_set_key" : "__sFILE []",
   "name" : "__sFILE []",
   "referenced_type" : "type-5533",
   "self_type" : "type-5536",
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdio.h"
  },
  {
   "linker_set_key" : "art::Instruction::InstructionDescriptor []",
   "name" : "art::Instruction::InstructionDescriptor []",
   "referenced_type" : "type-3775",
   "self_type" : "type-3781",
   "source_file" : "/art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "art::SdkVersion [6]",
   "name" : "art::SdkVersion [6]",
   "referenced_type" : "type-3890",
   "self_type" : "type-3905",
   "size" : 24,
   "source_file" : "/art/libartbase/base/hiddenapi_flags.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "art::dex::AnnotationSetRefItem [1]",
   "name" : "art::dex::AnnotationSetRefItem [1]",
   "referenced_type" : "type-4108",
   "self_type" : "type-4110",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "art::dex::MapItem [1]",
   "name" : "art::dex::MapItem [1]",
   "referenced_type" : "type-4086",
   "self_type" : "type-4088",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "art::dex::TypeItem [1]",
   "name" : "art::dex::TypeItem [1]",
   "referenced_type" : "type-4093",
   "self_type" : "type-4095",
   "size" : 2,

   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "const unsigned long long",
   "name" : "const unsigned long long",
   "referenced_type" : "type-848",
   "self_type" : "type-2440",
   "size" : 8,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "const unsigned short",
   "name" : "const unsigned short",
   "referenced_type" : "type-84",
   "self_type" : "type-1929",
   "size" : 2,
   "source_file" : "/external/libcxx/include/limits"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const void",
   "name" : "const void",
   "referenced_type" : "type-6",
   "self_type" : "type-2101",
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const void *const",
   "name" : "const void *const",
   "referenced_type" : "type-2100",
   "self_type" : "type-5343",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t",
   "name" : "const wchar_t",
   "referenced_type" : "type-150",
   "self_type" : "type-1325",
   "size" : 4,
   "source_file" : "/bionic/libc/include/wchar.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const wchar_t *const",
   "name" : "const wchar_t *const",
   "referenced_type" : "type-1324",
   "self_type" : "type-1740",
   "size" : 4,
   "source_file" : "/external/libcxx/include/type_traits"
  },
  {
   "is_const" : true,
   "linker_set_key" : "const weibull_distribution<_RealType>",
   "name" : "const weibull_distribution<_RealType>",
   "referenced_type" : "type-3990",
   "self_type" : "type-3989",
   "source_file" : "/external/libcxx/include/random"
  },
  {
   "is_const" : true,
   "linker_set_key" : "int const[]",
   "name" : "int const[]",
   "referenced_type" : "type-3762",
   "self_type" : "type-3761",
   "source_file" : "/art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[4]",
   "name" : "unsigned char const[4]",
   "referenced_type" : "type-3473",
   "self_type" : "type-4791",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/compact_dex_file.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "unsigned char const[4][4]",
   "name" : "unsigned char const[4][4]",
   "referenced_type" : "type-4821",
   "self_type" : "type-4822",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/standard_dex_file.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "unsigned char const[]",
   "name" : "unsigned char const[]",
   "referenced_type" : "type-3768",
   "self_type" : "type-3767",
   "source_file" : "/art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int *const",
   "name" : "unsigned int *const",
   "referenced_type" : "type-205",
   "self_type" : "type-2879",
   "size" : 4,
   "source_file" : "/external/libcxx/include/memory"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "unsigned int const[5]",
   "name" : "unsigned int const[5]",
   "referenced_type" : "type-3792",
   "self_type" : "type-3791",
   "size" : 20,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void (*const)(void *)",
   "name" : "void (*const)(void *)",
   "referenced_type" : "type-258",
   "self_type" : "type-3005",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void (*volatile)(void *, const void *)",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "type-2106",
   "self_type" : "type-2108",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *(*const)(const void *)",
   "name" : "void *(*const)(const void *)",
   "referenced_type" : "type-3003",
   "self_type" : "type-3002",
   "size" : 4,
   "source_file" : "/external/libcxx/include/functional"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "type-2098",
   "self_type" : "type-2102",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "type-2109",
   "self_type" : "type-2112",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "void *(*volatile)(void *, unsigned int, const void *)",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "type-2103",
   "self_type" : "type-2105",
   "size" : 4,
   "source_file" : "/bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "void *const",
   "name" : "void *const",
   "referenced_type" : "type-226",
   "self_type" : "type-5477",
   "size" : 4,
   "source_file" : "/bionic/libc/include/string.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile std::atomic_flag",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "type-2499",
   "self_type" : "type-2501",
   "size" : 1,
   "source_file" : "/external/libcxx/include/atomic"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 64,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 96,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "Dl_info",
   "name" : "Dl_info",
   "referenced_type" : "type-5301",
   "self_type" : "type-5301",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/dlfcn.h",
   "unique_id" : "Dl_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Chdr",
   "name" : "Elf32_Chdr",
   "referenced_type" : "type-5401",
   "self_type" : "type-5401",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Chdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Lib",
   "name" : "Elf32_Lib",
   "referenced_type" : "type-5403",
   "self_type" : "type-5403",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf32_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 128,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 144,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "Elf32_Move",
   "name" : "Elf32_Move",
   "referenced_type" : "type-5406",
   "self_type" : "type-5406",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf32_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "Elf32_Syminfo",
   "name" : "Elf32_Syminfo",
   "referenced_type" : "type-5410",
   "self_type" : "type-5410",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Verdaux",
   "name" : "Elf32_Verdaux",
   "referenced_type" : "type-5413",
   "self_type" : "type-5413",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Verdef",
   "name" : "Elf32_Verdef",
   "referenced_type" : "type-5412",
   "self_type" : "type-5412",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Vernaux",
   "name" : "Elf32_Vernaux",
   "referenced_type" : "type-5418",
   "self_type" : "type-5418",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf32_Verneed",
   "name" : "Elf32_Verneed",
   "referenced_type" : "type-5417",
   "self_type" : "type-5417",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf32_Verneed"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 32,
     "referenced_type" : "type-5398"
    }
   ],
   "linker_set_key" : "Elf32_auxv_t",
   "name" : "Elf32_auxv_t",
   "referenced_type" : "type-5397",
   "self_type" : "type-5397",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf32_auxv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "name" : "Elf32_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:49:3) at out/soong/ndk/sysroot/usr/include/elf.h:49:3",
   "record_kind" : "union",
   "referenced_type" : "type-5398",
   "self_type" : "type-5398",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf32_auxv_tUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ch_type",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ch_reserved",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ch_size",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "ch_addralign",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "Elf64_Chdr",
   "name" : "Elf64_Chdr",
   "referenced_type" : "type-5402",
   "self_type" : "type-5402",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Chdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 64,
     "referenced_type" : "type-5380"
    }
   ],
   "linker_set_key" : "Elf64_Dyn",
   "name" : "Elf64_Dyn",
   "referenced_type" : "type-5379",
   "self_type" : "type-5379",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9Elf64_Dyn"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-848"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "name" : "Elf64_Dyn::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:126:3",
   "record_kind" : "union",
   "referenced_type" : "type-5380",
   "self_type" : "type-5380",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN9Elf64_DynUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_time_stamp",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_checksum",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_version",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_flags",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf64_Lib",
   "name" : "Elf64_Lib",
   "referenced_type" : "type-5405",
   "self_type" : "type-5405",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS9Elf64_Lib"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "m_value",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "m_info",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "m_poffset",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "m_repeat",
     "field_offset" : 192,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "m_stride",
     "field_offset" : 208,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "Elf64_Move",
   "name" : "Elf64_Move",
   "referenced_type" : "type-5407",
   "self_type" : "type-5407",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS10Elf64_Move"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "si_boundto",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "si_flags",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "Elf64_Syminfo",
   "name" : "Elf64_Syminfo",
   "referenced_type" : "type-5411",
   "self_type" : "type-5411",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Syminfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vda_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vda_next",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf64_Verdaux",
   "name" : "Elf64_Verdaux",
   "referenced_type" : "type-5416",
   "self_type" : "type-5416",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verdaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vd_version",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_flags",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_ndx",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_cnt",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vd_hash",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vd_aux",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vd_next",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf64_Verdef",
   "name" : "Elf64_Verdef",
   "referenced_type" : "type-5414",
   "self_type" : "type-5414",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_Verdef"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vna_hash",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vna_flags",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vna_other",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vna_name",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vna_next",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf64_Vernaux",
   "name" : "Elf64_Vernaux",
   "referenced_type" : "type-5420",
   "self_type" : "type-5420",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Vernaux"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vn_version",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vn_cnt",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "vn_file",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vn_aux",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "vn_next",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "Elf64_Verneed",
   "name" : "Elf64_Verneed",
   "referenced_type" : "type-5419",
   "self_type" : "type-5419",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS13Elf64_Verneed"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_type",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "a_un",
     "field_offset" : 64,
     "referenced_type" : "type-5400"
    }
   ],
   "linker_set_key" : "Elf64_auxv_t",
   "name" : "Elf64_auxv_t",
   "referenced_type" : "type-5399",
   "self_type" : "type-5399",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTS12Elf64_auxv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "a_val",
     "referenced_type" : "type-848"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "name" : "Elf64_auxv_t::(anonymous union at out/soong/ndk/sysroot/usr/include/elf.h:56:3) at out/soong/ndk/sysroot/usr/include/elf.h:56:3",
   "record_kind" : "union",
   "referenced_type" : "type-5400",
   "self_type" : "type-5400",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/elf.h",
   "unique_id" : "_ZTSN12Elf64_auxv_tUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "method_cache_",
     "referenced_type" : "type-2186"
    },
    {
     "access" : "private",
     "field_name" : "class_def_index_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "dex_file_",
     "field_offset" : 128,
     "referenced_type" : "type-1084"
    }
   ],
   "linker_set_key" : "ExtDexFile",
   "name" : "ExtDexFile",
   "referenced_type" : "type-2185",
   "self_type" : "type-2185",
   "size" : 20,
   "source_file" : "/art/libdexfile/external/dex_file_ext.cc",
   "unique_id" : "ExtDexFile"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "type-865"
    }
   ],
   "linker_set_key" : "ExtDexFileMethodInfo",
   "name" : "ExtDexFileMethodInfo",
   "referenced_type" : "type-1703",
   "self_type" : "type-1703",
   "size" : 12,
   "source_file" : "/art/libdexfile/external/include/art_api/dex_file_external.h",
   "unique_id" : "ExtDexFileMethodInfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "str_",
     "referenced_type" : "type-46"
    }
   ],
   "linker_set_key" : "ExtDexFileString",
   "name" : "ExtDexFileString",
   "referenced_type" : "type-867",
   "self_type" : "type-867",
   "size" : 12,
   "source_file" : "/art/libdexfile/external/dex_file_ext.cc",
   "unique_id" : "ExtDexFileString"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "type-4615"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "type-4617"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "type-4615"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "type-4620"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "type-4617"
    }
   ],
   "linker_set_key" : "JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "type-4614",
   "self_type" : "type-4614",
   "size" : 32,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNIInvokeInterface"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "type-4139"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "type-4145"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "type-4148"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "type-4150"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "type-4154"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "type-4158"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "type-4160"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "type-4162"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "type-4164"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "type-4166"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "type-4169"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "type-4171"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "type-4173"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "type-4173"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "type-4175"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "type-4177"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "type-4179"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "type-4179"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "type-4181"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "type-4181"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "type-4183"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "type-4179"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "type-4177"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "type-4185"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "type-4187"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "type-4189"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "type-4192"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "type-4196"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "type-4198"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "type-4200"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "type-4202"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "type-4204"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "type-4207"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "type-4209"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "type-4211"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "type-4214"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "type-4216"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "type-4218"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "type-4221"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "type-4223"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "type-4225"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "type-4228"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "type-4230"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "type-4232"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "type-4235"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "type-4237"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "type-4239"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "type-4242"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "type-4244"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "type-4246"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "type-4249"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "type-4251"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "type-4253"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "type-4256"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "type-4258"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "type-4260"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "type-4263"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "type-4265"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "type-4267"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "type-4270"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "type-4272"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "type-4274"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "type-4277"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "type-4279"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "type-4281"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "type-4284"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "type-4286"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "type-4288"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "type-4291"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "type-4293"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "type-4295"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "type-4298"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "type-4300"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "type-4302"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "type-4305"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "type-4307"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "type-4309"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "type-4312"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "type-4314"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "type-4316"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "type-4319"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "type-4321"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "type-4323"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "type-4326"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "type-4328"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "type-4330"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "type-4333"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "type-4335"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "type-4337"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "type-4340"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "type-4342"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "type-4344"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "type-4346"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "type-4348"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "type-4350"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "type-4352"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "type-4354"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "type-4356"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "type-4358"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "type-4360"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "type-4362"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "type-4364"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "type-4366"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "type-4368"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "type-4370"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "type-4372"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "type-4374"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "type-4376"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "type-4378"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "type-4200"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "type-4187"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "type-4189"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "type-4192"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "type-4380"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "type-4382"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "type-4385"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "type-4387"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "type-4389"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "type-4392"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "type-4394"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "type-4396"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "type-4399"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "type-4401"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "type-4403"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "type-4406"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "type-4408"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "type-4410"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "type-4413"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "type-4415"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "type-4417"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "type-4420"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "type-4422"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "type-4424"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "type-4427"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "type-4429"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "type-4431"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "type-4434"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "type-4436"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "type-4438"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "type-4441"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "type-4342"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "type-4443"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "type-4445"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "type-4447"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "type-4449"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "type-4451"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "type-4453"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "type-4455"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "type-4457"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "type-4459"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "type-4461"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "type-4463"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "type-4465"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "type-4467"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "type-4469"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "type-4471"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "type-4473"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "type-4475"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "type-4477"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "type-4479"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "type-4482"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "type-4484"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "type-4486"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "type-4488"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "type-4482"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "type-4490"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "type-4492"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "type-4494"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "type-4497"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "type-4500"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "type-4502"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "type-4504"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "type-4507"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "type-4510"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "type-4513"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "type-4516"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "type-4519"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "type-4522"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "type-4525"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "type-4528"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "type-4530"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "type-4532"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "type-4535"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "type-4538"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "type-4540"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "type-4542"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "type-4544"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "type-4546"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "type-4548"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "type-4550"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "type-4552"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "type-4554"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "type-4556"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "type-4558"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "type-4560"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "type-4562"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "type-4564"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "type-4566"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "type-4568"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "type-4570"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "type-4572"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "type-4574"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "type-4576"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "type-4578"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "type-4580"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "type-4582"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "type-4584"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "type-4588"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "type-4590"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "type-4593"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "type-4597"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "type-4599"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "type-4603"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "type-4605"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "type-4605"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "type-4607"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "type-4622"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "type-4624"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "type-4626"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "type-4628"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "type-4484"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "type-4486"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "type-4179"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "type-4181"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "type-4630"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "type-4632"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "type-4634"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "type-4636"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "type-4638"
    }
   ],
   "linker_set_key" : "JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "type-4138",
   "self_type" : "type-4138",
   "size" : 932,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS18JNINativeInterface"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "type-4137",
   "self_type" : "type-4137",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS15JNINativeMethod"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "type-4135"
    }
   ],
   "linker_set_key" : "JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "type-4723",
   "self_type" : "type-4723",
   "size" : 12,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS16JavaVMAttachArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "type-4726"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "type-4725",
   "self_type" : "type-4725",
   "size" : 16,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14JavaVMInitArgs"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "type-4724",
   "self_type" : "type-4724",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12JavaVMOption"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-4143"
    }
   ],
   "linker_set_key" : "_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "type-4142",
   "self_type" : "type-4142",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JNIEnv"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "type-4612"
    }
   ],
   "linker_set_key" : "_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "type-4611",
   "self_type" : "type-4611",
   "size" : 4,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_JavaVM"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-5580"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-5583"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-5584"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-5292"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-5295"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-5579",
   "self_type" : "type-5579",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTS21_Unwind_Control_Block"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "exception_class",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "exception_cleanup",
     "field_offset" : 64,
     "referenced_type" : "type-5598"
    },
    {
     "field_name" : "unwinder_cache",
     "field_offset" : 96,
     "referenced_type" : "type-5600"
    },
    {
     "field_name" : "barrier_cache",
     "field_offset" : 256,
     "referenced_type" : "type-5601"
    },
    {
     "field_name" : "cleanup_cache",
     "field_offset" : 448,
     "referenced_type" : "type-5602"
    },
    {
     "field_name" : "pr_cache",
     "field_offset" : 576,
     "referenced_type" : "type-5603"
    },
    {
     "field_offset" : 704,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "_Unwind_Control_Block",
   "name" : "_Unwind_Control_Block",
   "referenced_type" : "type-5597",
   "self_type" : "type-5597",
   "size" : 88,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-5583",
   "self_type" : "type-5583",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved1",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved4",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved5",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3) at external/libunwind_llvm/include/unwind.h:79:3",
   "referenced_type" : "type-5600",
   "self_type" : "type-5600",
   "size" : 20,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:79:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-3792"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-5584",
   "self_type" : "type-5584",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sp",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "bitpattern",
     "field_offset" : 32,
     "referenced_type" : "type-3792"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3) at external/libunwind_llvm/include/unwind.h:88:3",
   "referenced_type" : "type-5601",
   "self_type" : "type-5601",
   "size" : 24,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:88:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-5293"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-5292",
   "self_type" : "type-5292",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "bitpattern",
     "referenced_type" : "type-5293"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3) at external/libunwind_llvm/include/unwind.h:94:3",
   "referenced_type" : "type-5602",
   "self_type" : "type-5602",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:94:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-5295",
   "self_type" : "type-5295",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_ZTSN21_Unwind_Control_BlockUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fnstart",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ehtp",
     "field_offset" : 32,
     "referenced_type" : "type-205"
    },
    {
     "field_name" : "additional",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "name" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3) at external/libunwind_llvm/include/unwind.h:99:3",
   "referenced_type" : "type-5603",
   "self_type" : "type-5603",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "_Unwind_Control_Block::(anonymous struct at external/libunwind_llvm/include/unwind.h:99:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2998"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-2997",
   "self_type" : "type-2997",
   "size" : 128,
   "source_file" : "/bionic/libc/kernel/uapi/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2998"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-5454",
   "self_type" : "type-5454",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2998"
    }
   ],
   "linker_set_key" : "__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "type-5605",
   "self_type" : "type-5605",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/posix_types.h",
   "unique_id" : "__kernel_fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-756"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-4960",
   "self_type" : "type-4960",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-756"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-5480",
   "self_type" : "type-5480",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "_ZTS15__kernel_fsid_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "type-756"
    }
   ],
   "linker_set_key" : "__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "type-5606",
   "self_type" : "type-5606",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/posix_types.h",
   "unique_id" : "__kernel_fsid_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-4715"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-4715"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-4728",
   "self_type" : "type-4728",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-5448"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "type-5448"
    }
   ],
   "linker_set_key" : "__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "referenced_type" : "type-5449",
   "self_type" : "type-5449",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time_types.h",
   "unique_id" : "_ZTS19__kernel_itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-4828",
   "self_type" : "type-4828",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 32,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "__kernel_old_timeval",
   "name" : "__kernel_old_timeval",
   "referenced_type" : "type-5450",
   "self_type" : "type-5450",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time_types.h",
   "unique_id" : "_ZTS20__kernel_old_timeval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-4901"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-4900",
   "self_type" : "type-4900",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_u",
     "referenced_type" : "type-5460"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "referenced_type" : "type-5459",
   "self_type" : "type-5459",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTS18__kernel_sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3) at bionic/libc/kernel/uapi/asm-arm/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-4901",
   "self_type" : "type-4901",
   "size" : 4,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "_sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "name" : "__kernel_sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3) at out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h:77:3",
   "record_kind" : "union",
   "referenced_type" : "type-5460",
   "self_type" : "type-5460",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/arm-linux-androideabi/asm/signal.h",
   "unique_id" : "_ZTSN18__kernel_sigactionUt_E"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "type-4852",
   "self_type" : "type-4852",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h",
   "unique_id" : "_ZTS21__kernel_sock_timeval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "referenced_type" : "type-5451",
   "self_type" : "type-5451",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time_types.h",
   "unique_id" : "_ZTS21__kernel_sock_timeval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-4715",
   "self_type" : "type-4715",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time_types.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "__kernel_timespec",
   "name" : "__kernel_timespec",
   "referenced_type" : "type-5448",
   "self_type" : "type-5448",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time_types.h",
   "unique_id" : "_ZTS17__kernel_timespec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-3399"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-258"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-3398",
   "self_type" : "type-3398",
   "size" : 12,
   "source_file" : "/bionic/libc/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "type-5510"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 32,
     "referenced_type" : "type-258"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "referenced_type" : "type-5509",
   "self_type" : "type-5509",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/pthread.h",
   "unique_id" : "__pthread_cleanup_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-5534"
    }
   ],
   "linker_set_key" : "__sFILE",
   "name" : "__sFILE",
   "referenced_type" : "type-5533",
   "self_type" : "type-5533",
   "size" : 84,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/struct_file.h",
   "unique_id" : "__sFILE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-422"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-423"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-425"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-426"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-427"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-433"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-434"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-421",
   "self_type" : "type-421",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "type-5465"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "type-5466"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "type-5468"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "type-5469"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "type-5470"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "type-5474"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "type-5475"
    }
   ],
   "linker_set_key" : "__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "referenced_type" : "type-5464",
   "self_type" : "type-5464",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTS10__sifields"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-422",
   "self_type" : "type-422",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-424"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-423",
   "self_type" : "type-423",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-424"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-245"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-426",
   "self_type" : "type-426",
   "size" : 20,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-226"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-428"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-427",
   "self_type" : "type-427",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-430"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-432"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-428",
   "self_type" : "type-428",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-430",
   "self_type" : "type-430",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:60:3)::(anonymous union at bionic/libc/kernel/uapi/asm-generic/siginfo.h:71:5)::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-432",
   "self_type" : "type-432",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-433",
   "self_type" : "type-433",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3) at bionic/libc/kernel/uapi/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:38:3",
   "referenced_type" : "type-5465",
   "self_type" : "type-5465",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-5467"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:42:3",
   "referenced_type" : "type-5466",
   "self_type" : "type-5466",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "type-5467"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:48:3",
   "referenced_type" : "type-5468",
   "self_type" : "type-5468",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt1_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 96,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 128,
     "referenced_type" : "type-245"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:53:3",
   "referenced_type" : "type-5469",
   "self_type" : "type-5469",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt2_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "type-226"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "type-5471"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3",
   "referenced_type" : "type-5470",
   "self_type" : "type-5470",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "type-5472"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "type-5473"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5",
   "record_kind" : "union",
   "referenced_type" : "type-5471",
   "self_type" : "type-5471",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 64,
     "referenced_type" : "type-226"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:73:7",
   "referenced_type" : "type-5472",
   "self_type" : "type-5472",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "type-431"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:60:3)::(anonymous union at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:71:5)::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:78:7",
   "referenced_type" : "type-5473",
   "self_type" : "type-5473",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt3_Ut_Ut0_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:84:3",
   "referenced_type" : "type-5474",
   "self_type" : "type-5474",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt4_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3",
   "name" : "__sifields::(anonymous struct at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3) at out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h:88:3",
   "referenced_type" : "type-5475",
   "self_type" : "type-5475",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/asm-generic/siginfo.h",
   "unique_id" : "_ZTSN10__sifieldsUt5_E"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4116"
    }
   ],
   "linker_set_key" : "_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "type-4119",
   "self_type" : "type-4119",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jarray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "type-4121",
   "self_type" : "type-4121",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS14_jbooleanArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "type-4123",
   "self_type" : "type-4123",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jbyteArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "type-4124",
   "self_type" : "type-4124",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jcharArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4116"
    }
   ],
   "linker_set_key" : "_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "type-4117",
   "self_type" : "type-4117",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS7_jclass"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "type-4131",
   "self_type" : "type-4131",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jdoubleArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "type-4130",
   "self_type" : "type-4130",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jfloatArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "type-4126",
   "self_type" : "type-4126",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS10_jintArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "type-4129",
   "self_type" : "type-4129",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jlongArray"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "type-4116",
   "self_type" : "type-4116",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jobject"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "type-4120",
   "self_type" : "type-4120",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS13_jobjectArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4119"
    }
   ],
   "linker_set_key" : "_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "type-4125",
   "self_type" : "type-4125",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS12_jshortArray"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4116"
    }
   ],
   "linker_set_key" : "_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "type-4118",
   "self_type" : "type-4118",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS8_jstring"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4116"
    }
   ],
   "linker_set_key" : "_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "type-4132",
   "self_type" : "type-4132",
   "size" : 1,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS11_jthrowable"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::DefaultCloser",
   "name" : "android::base::DefaultCloser",
   "referenced_type" : "type-3733",
   "self_type" : "type-3733",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base13DefaultCloserE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 8,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<bool, bool>",
   "name" : "android::base::EagerEvaluator<bool, bool>",
   "referenced_type" : "type-3653",
   "self_type" : "type-3653",
   "size" : 2,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-14", "type-14" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIbbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, char *>",
   "name" : "android::base::EagerEvaluator<char *, char *>",
   "referenced_type" : "type-3682",
   "self_type" : "type-3682",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-16", "type-16" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<char *, const char *>",
   "name" : "android::base::EagerEvaluator<char *, const char *>",
   "referenced_type" : "type-3680",
   "self_type" : "type-3680",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-16", "type-253" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPcPKcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::DexFile *, const art::DexFile *>",
   "name" : "android::base::EagerEvaluator<const art::DexFile *, const art::DexFile *>",
   "referenced_type" : "type-3657",
   "self_type" : "type-3657",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-122", "type-122" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art7DexFileES5_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-95"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-95"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "name" : "android::base::EagerEvaluator<const art::dex::ClassDef *, const art::dex::ClassDef *>",
   "referenced_type" : "type-3668",
   "self_type" : "type-3668",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-95", "type-95" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex8ClassDefES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-79"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-79"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "name" : "android::base::EagerEvaluator<const art::dex::FieldId *, const art::dex::FieldId *>",
   "referenced_type" : "type-3663",
   "self_type" : "type-3663",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-79", "type-79" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex7FieldIdES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-86"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-86"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "name" : "android::base::EagerEvaluator<const art::dex::MethodId *, const art::dex::MethodId *>",
   "referenced_type" : "type-3666",
   "self_type" : "type-3666",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-86", "type-86" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex8MethodIdES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-91"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-91"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "name" : "android::base::EagerEvaluator<const art::dex::ProtoId *, const art::dex::ProtoId *>",
   "referenced_type" : "type-3670",
   "self_type" : "type-3670",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-91", "type-91" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex7ProtoIdES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-69"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-69"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "name" : "android::base::EagerEvaluator<const art::dex::StringId *, const art::dex::StringId *>",
   "referenced_type" : "type-3659",
   "self_type" : "type-3659",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-69", "type-69" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex8StringIdES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-73"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "name" : "android::base::EagerEvaluator<const art::dex::TypeId *, const art::dex::TypeId *>",
   "referenced_type" : "type-3661",
   "self_type" : "type-3661",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-73", "type-73" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKN3art3dex6TypeIdES6_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, char *>",
   "name" : "android::base::EagerEvaluator<const char *, char *>",
   "referenced_type" : "type-3678",
   "self_type" : "type-3678",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-253", "type-16" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcPcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const char *, const char *>",
   "name" : "android::base::EagerEvaluator<const char *, const char *>",
   "referenced_type" : "type-3676",
   "self_type" : "type-3676",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-253", "type-253" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKcS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, const signed char *>",
   "referenced_type" : "type-3693",
   "self_type" : "type-3693",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3694", "type-3694" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<const signed char *, signed char *>",
   "referenced_type" : "type-3700",
   "self_type" : "type-3700",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3694", "type-3701" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKaPaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, const unsigned char *>",
   "referenced_type" : "type-3684",
   "self_type" : "type-3684",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-42", "type-42" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<const unsigned char *, unsigned char *>",
   "referenced_type" : "type-3687",
   "self_type" : "type-3687",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-42", "type-257" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKhPhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-1928"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-1928"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<const unsigned short *, const unsigned short *>",
   "name" : "android::base::EagerEvaluator<const unsigned short *, const unsigned short *>",
   "referenced_type" : "type-3672",
   "self_type" : "type-3672",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-1928", "type-1928" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPKtS3_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<int, int>",
   "name" : "android::base::EagerEvaluator<int, int>",
   "referenced_type" : "type-3655",
   "self_type" : "type-3655",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-7", "type-7" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIiiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, const signed char *>",
   "referenced_type" : "type-3703",
   "self_type" : "type-3703",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3701", "type-3694" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaPKaEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "name" : "android::base::EagerEvaluator<signed char *, signed char *>",
   "referenced_type" : "type-3705",
   "self_type" : "type-3705",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-3701", "type-3701" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPaS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, const unsigned char *>",
   "referenced_type" : "type-3689",
   "self_type" : "type-3689",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-257", "type-42" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhPKhEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-2100"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-2100"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "name" : "android::base::EagerEvaluator<unsigned char *, unsigned char *>",
   "referenced_type" : "type-3691",
   "self_type" : "type-3691",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-257", "type-257" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIPhS2_EE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "name" : "android::base::EagerEvaluator<unsigned int, unsigned int>",
   "referenced_type" : "type-3651",
   "self_type" : "type-3651",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-11", "type-11" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIjjEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned short, unsigned int>",
   "name" : "android::base::EagerEvaluator<unsigned short, unsigned int>",
   "referenced_type" : "type-3649",
   "self_type" : "type-3649",
   "size" : 8,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-84", "type-11" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorItjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "lhs",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "rhs",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "android::base::EagerEvaluator<unsigned short, unsigned short>",
   "name" : "android::base::EagerEvaluator<unsigned short, unsigned short>",
   "referenced_type" : "type-3647",
   "self_type" : "type-3647",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "template_args" : [ "type-84", "type-84" ],
   "unique_id" : "_ZTSN7android4base14EagerEvaluatorIttEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "saved_errno_",
     "referenced_type" : "type-37"
    }
   ],
   "linker_set_key" : "android::base::ErrnoRestorer",
   "name" : "android::base::ErrnoRestorer",
   "record_kind" : "class",
   "referenced_type" : "type-3642",
   "self_type" : "type-3642",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base13ErrnoRestorerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-3708"
    }
   ],
   "linker_set_key" : "android::base::LogMessage",
   "name" : "android::base::LogMessage",
   "record_kind" : "class",
   "referenced_type" : "type-3707",
   "self_type" : "type-3707",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogMessageE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "default_log_id_",
     "referenced_type" : "type-328"
    }
   ],
   "linker_set_key" : "android::base::LogdLogger",
   "name" : "android::base::LogdLogger",
   "record_kind" : "class",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base10LogdLoggerE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "base_",
     "referenced_type" : "type-16"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "android::base::MappedFile",
   "name" : "android::base::MappedFile",
   "record_kind" : "class",
   "referenced_type" : "type-15",
   "self_type" : "type-15",
   "size" : 12,
   "source_file" : "/system/core/base/include/android-base/mapped_file.h",
   "unique_id" : "_ZTSN7android4base10MappedFileE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::base::ScopedLockAssertion",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "referenced_type" : "type-3747",
   "self_type" : "type-3747",
   "size" : 1,
   "source_file" : "/system/core/base/include/android-base/thread_annotations.h",
   "unique_id" : "_ZTSN7android4base19ScopedLockAssertionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "old_",
     "referenced_type" : "type-336"
    }
   ],
   "linker_set_key" : "android::base::ScopedLogSeverity",
   "name" : "android::base::ScopedLogSeverity",
   "record_kind" : "class",
   "referenced_type" : "type-3710",
   "self_type" : "type-3710",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/logging.h",
   "unique_id" : "_ZTSN7android4base17ScopedLogSeverityE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::base::borrowed_fd",
   "name" : "android::base::borrowed_fd",
   "referenced_type" : "type-3739",
   "self_type" : "type-3739",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "unique_id" : "_ZTSN7android4base11borrowed_fdE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fd_",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "name" : "android::base::unique_fd_impl<android::base::DefaultCloser>",
   "record_kind" : "class",
   "referenced_type" : "type-3734",
   "self_type" : "type-3734",
   "size" : 4,
   "source_file" : "/system/core/base/include/android-base/unique_fd.h",
   "template_args" : [ "type-3733" ],
   "unique_id" : "_ZTSN7android4base14unique_fd_implINS0_13DefaultCloserEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::Arc4RandomGenerator",
   "name" : "art::Arc4RandomGenerator",
   "referenced_type" : "type-4075",
   "self_type" : "type-4075",
   "size" : 1,
   "source_file" : "/art/libartbase/base/utils.h",
   "unique_id" : "_ZTSN3art19Arc4RandomGeneratorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4779"
    }
   ],
   "linker_set_key" : "art::CallSiteArrayValueIterator",
   "name" : "art::CallSiteArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "type-4786",
   "self_type" : "type-4786",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art26CallSiteArrayValueIteratorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "class_def_index_",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_pos_",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_ptr_pos_",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "access" : "protected",
     "field_name" : "num_static_fields_",
     "field_offset" : 128,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "num_instance_fields_",
     "field_offset" : 160,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "num_direct_methods_",
     "field_offset" : 192,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "num_virtual_methods_",
     "field_offset" : 224,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "art::ClassAccessor",
   "name" : "art::ClassAccessor",
   "record_kind" : "class",
   "referenced_type" : "type-3859",
   "self_type" : "type-3859",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "unique_id" : "_ZTSN3art13ClassAccessorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_pos_",
     "field_offset" : 32,
     "referenced_type" : "type-42"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_ptr_pos_",
     "field_offset" : 64,
     "referenced_type" : "type-42"
    },
    {
     "access" : "protected",
     "field_name" : "index_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "access_flags_",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_flags_",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::ClassAccessor::BaseItem",
   "name" : "art::ClassAccessor::BaseItem",
   "record_kind" : "class",
   "referenced_type" : "type-2000",
   "self_type" : "type-2000",
   "size" : 24,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "unique_id" : "_ZTSN3art13ClassAccessor8BaseItemE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2362"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-1999"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "partition_pos_",
     "field_offset" : 256,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "iterator_end_",
     "field_offset" : 288,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Field>",
   "name" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Field>",
   "record_kind" : "class",
   "referenced_type" : "type-2361",
   "self_type" : "type-2361",
   "size" : 40,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "template_args" : [ "type-1999" ],
   "unique_id" : "_ZTSN3art13ClassAccessor12DataIteratorINS0_5FieldEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2366"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_",
     "referenced_type" : "type-2070"
    },
    {
     "access" : "private",
     "field_name" : "position_",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "partition_pos_",
     "field_offset" : 288,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "iterator_end_",
     "field_offset" : 320,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Method>",
   "name" : "art::ClassAccessor::DataIterator<art::ClassAccessor::Method>",
   "record_kind" : "class",
   "referenced_type" : "type-2365",
   "self_type" : "type-2365",
   "size" : 44,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "template_args" : [ "type-2070" ],
   "unique_id" : "_ZTSN3art13ClassAccessor12DataIteratorINS0_6MethodEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2000"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "is_static_",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "art::ClassAccessor::Field",
   "name" : "art::ClassAccessor::Field",
   "record_kind" : "class",
   "referenced_type" : "type-1999",
   "self_type" : "type-1999",
   "size" : 28,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "unique_id" : "_ZTSN3art13ClassAccessor5FieldE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2000"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "is_static_or_direct_",
     "field_offset" : 192,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "code_off_",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::ClassAccessor::Method",
   "name" : "art::ClassAccessor::Method",
   "record_kind" : "class",
   "referenced_type" : "type-2070",
   "self_type" : "type-2070",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/class_accessor.h",
   "unique_id" : "_ZTSN3art13ClassAccessor6MethodE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2355"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "type-1863"
    }
   ],
   "linker_set_key" : "art::ClassIterator",
   "name" : "art::ClassIterator",
   "record_kind" : "class",
   "referenced_type" : "type-2354",
   "self_type" : "type-2354",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/class_iterator.h",
   "unique_id" : "_ZTSN3art13ClassIteratorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "class_def_idx_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::ClassIteratorData",
   "name" : "art::ClassIteratorData",
   "record_kind" : "class",
   "referenced_type" : "type-1863",
   "self_type" : "type-1863",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/class_iterator.h",
   "unique_id" : "_ZTSN3art17ClassIteratorDataE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3817"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "field_offset" : 64,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 80,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 96,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 112,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "art::CodeItemDataAccessor",
   "name" : "art::CodeItemDataAccessor",
   "record_kind" : "class",
   "referenced_type" : "type-3823",
   "self_type" : "type-3823",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/code_item_accessors.h",
   "unique_id" : "_ZTSN3art20CodeItemDataAccessorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3823"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "field_offset" : 128,
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offset_",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::CodeItemDebugInfoAccessor",
   "name" : "art::CodeItemDebugInfoAccessor",
   "record_kind" : "class",
   "referenced_type" : "type-3827",
   "self_type" : "type-3827",
   "size" : 24,
   "source_file" : "/art/libdexfile/dex/code_item_accessors.h",
   "unique_id" : "_ZTSN3art25CodeItemDebugInfoAccessorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "type-1928"
    }
   ],
   "linker_set_key" : "art::CodeItemInstructionAccessor",
   "name" : "art::CodeItemInstructionAccessor",
   "record_kind" : "class",
   "referenced_type" : "type-3817",
   "self_type" : "type-3817",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/code_item_accessors.h",
   "unique_id" : "_ZTSN3art27CodeItemInstructionAccessorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_",
     "field_offset" : 768,
     "referenced_type" : "type-1199"
    }
   ],
   "linker_set_key" : "art::CompactDexFile",
   "name" : "art::CompactDexFile",
   "record_kind" : "class",
   "referenced_type" : "type-1198",
   "self_type" : "type-1198",
   "size" : 108,
   "source_file" : "/art/libdexfile/dex/compact_dex_file.h",
   "unique_id" : "_ZTSN3art14CompactDexFileE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art14CompactDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art14CompactDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art14CompactDexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1132"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "fields_",
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "insns_count_and_flags_",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 32,
     "referenced_type" : "type-1131"
    }
   ],
   "linker_set_key" : "art::CompactDexFile::CodeItem",
   "name" : "art::CompactDexFile::CodeItem",
   "referenced_type" : "type-1130",
   "self_type" : "type-1130",
   "size" : 6,
   "source_file" : "/art/libdexfile/dex/compact_dex_file.h",
   "unique_id" : "_ZTSN3art14CompactDexFile8CodeItemE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-65"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "feature_flags_",
     "field_offset" : 896,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_pos_",
     "field_offset" : 928,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_offsets_table_offset_",
     "field_offset" : 960,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_base_",
     "field_offset" : 992,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_begin_",
     "field_offset" : 1024,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "owned_data_end_",
     "field_offset" : 1056,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::CompactDexFile::Header",
   "name" : "art::CompactDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "type-1124",
   "self_type" : "type-1124",
   "size" : 136,
   "source_file" : "/art/libdexfile/dex/compact_dex_file.h",
   "unique_id" : "_ZTSN3art14CompactDexFile6HeaderE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::CompactOffsetTable",
   "name" : "art::CompactOffsetTable",
   "record_kind" : "class",
   "referenced_type" : "type-4790",
   "self_type" : "type-4790",
   "size" : 1,
   "source_file" : "/art/libdexfile/dex/compact_offset_table.h",
   "unique_id" : "_ZTSN3art18CompactOffsetTableE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "table_",
     "referenced_type" : "type-1200"
    },
    {
     "access" : "private",
     "field_name" : "minimum_offset_",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "data_begin_",
     "field_offset" : 64,
     "referenced_type" : "type-41"
    }
   ],
   "linker_set_key" : "art::CompactOffsetTable::Accessor",
   "name" : "art::CompactOffsetTable::Accessor",
   "record_kind" : "class",
   "referenced_type" : "type-1199",
   "self_type" : "type-1199",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/compact_offset_table.h",
   "unique_id" : "_ZTSN3art18CompactOffsetTable8AccessorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "begin_",
     "field_offset" : 32,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "data_begin_",
     "field_offset" : 96,
     "referenced_type" : "type-41"
    },
    {
     "access" : "protected",
     "field_name" : "data_size_",
     "field_offset" : 128,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "location_",
     "field_offset" : 160,
     "referenced_type" : "type-46"
    },
    {
     "access" : "protected",
     "field_name" : "location_checksum_",
     "field_offset" : 256,
     "referenced_type" : "type-45"
    },
    {
     "access" : "protected",
     "field_name" : "header_",
     "field_offset" : 288,
     "referenced_type" : "type-62"
    },
    {
     "access" : "protected",
     "field_name" : "string_ids_",
     "field_offset" : 320,
     "referenced_type" : "type-68"
    },
    {
     "access" : "protected",
     "field_name" : "type_ids_",
     "field_offset" : 352,
     "referenced_type" : "type-72"
    },
    {
     "access" : "protected",
     "field_name" : "field_ids_",
     "field_offset" : 384,
     "referenced_type" : "type-78"
    },
    {
     "access" : "protected",
     "field_name" : "method_ids_",
     "field_offset" : 416,
     "referenced_type" : "type-85"
    },
    {
     "access" : "protected",
     "field_name" : "proto_ids_",
     "field_offset" : 448,
     "referenced_type" : "type-90"
    },
    {
     "access" : "protected",
     "field_name" : "class_defs_",
     "field_offset" : 480,
     "referenced_type" : "type-94"
    },
    {
     "access" : "protected",
     "field_name" : "method_handles_",
     "field_offset" : 512,
     "referenced_type" : "type-98"
    },
    {
     "access" : "protected",
     "field_name" : "num_method_handles_",
     "field_offset" : 544,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "call_site_ids_",
     "field_offset" : 576,
     "referenced_type" : "type-8"
    },
    {
     "access" : "protected",
     "field_name" : "num_call_site_ids_",
     "field_offset" : 608,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_class_data_",
     "field_offset" : 640,
     "referenced_type" : "type-101"
    },
    {
     "access" : "protected",
     "field_name" : "oat_dex_file_",
     "field_offset" : 672,
     "referenced_type" : "type-105"
    },
    {
     "access" : "protected",
     "field_name" : "container_",
     "field_offset" : 704,
     "referenced_type" : "type-108"
    },
    {
     "access" : "protected",
     "field_name" : "is_compact_dex_",
     "field_offset" : 736,
     "referenced_type" : "type-115"
    },
    {
     "access" : "protected",
     "field_name" : "hiddenapi_domain_",
     "field_offset" : 744,
     "referenced_type" : "type-116"
    }
   ],
   "linker_set_key" : "art::DexFile",
   "name" : "art::DexFile",
   "record_kind" : "class",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 96,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art7DexFileE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art7DexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art7DexFileD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile12IsMagicValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile14IsVersionValidEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile22SupportsDefaultMethodsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile18GetDequickenedSizeEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art7DexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic_",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "checksum_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 96,
     "referenced_type" : "type-67"
    },
    {
     "field_name" : "file_size_",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "header_size_",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "endian_tag_",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "link_size_",
     "field_offset" : 352,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "link_off_",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "map_off_",
     "field_offset" : 416,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "string_ids_size_",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "string_ids_off_",
     "field_offset" : 480,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "type_ids_size_",
     "field_offset" : 512,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "type_ids_off_",
     "field_offset" : 544,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "proto_ids_size_",
     "field_offset" : 576,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "proto_ids_off_",
     "field_offset" : 608,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "field_ids_size_",
     "field_offset" : 640,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "field_ids_off_",
     "field_offset" : 672,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "method_ids_size_",
     "field_offset" : 704,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "method_ids_off_",
     "field_offset" : 736,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "class_defs_size_",
     "field_offset" : 768,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "class_defs_off_",
     "field_offset" : 800,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "data_size_",
     "field_offset" : 832,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "data_off_",
     "field_offset" : 864,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::DexFile::Header",
   "name" : "art::DexFile::Header",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 112,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art7DexFile6HeaderE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name_",
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "descriptor_",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "signature_",
     "field_offset" : 64,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "start_address_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "end_address_",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "reg_",
     "field_offset" : 160,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "is_live_",
     "field_offset" : 176,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "art::DexFile::LocalInfo",
   "name" : "art::DexFile::LocalInfo",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 24,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art7DexFile9LocalInfoE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "address_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "line_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "source_file_",
     "field_offset" : 64,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "prologue_end_",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    },
    {
     "field_name" : "epilogue_begin_",
     "field_offset" : 104,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "art::DexFile::PositionInfo",
   "name" : "art::DexFile::PositionInfo",
   "referenced_type" : "type-4747",
   "self_type" : "type-4747",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art7DexFile12PositionInfoE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "art::DexFileContainer",
   "name" : "art::DexFileContainer",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art16DexFileContainerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art16DexFileContainerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art16DexFileContainerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer14GetPermissionsEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer10IsReadOnlyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer11EnableWriteEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN3art16DexFileContainer12DisableWriteEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "art::DexFileLoader",
   "name" : "art::DexFileLoader",
   "record_kind" : "class",
   "referenced_type" : "type-4842",
   "self_type" : "type-4842",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_loader.h",
   "unique_id" : "_ZTSN3art13DexFileLoaderE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art13DexFileLoaderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art13DexFileLoaderD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader20GetMultiDexChecksumsEPKcPNSt3__16vectorIjNS3_9allocatorIjEEEEPNS3_12basic_stringIcNS3_11char_traitsIcEENS5_IcEEEEiPb"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader4OpenEPKhjRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_NS3_10unique_ptrINS_16DexFileContainerENS3_14default_deleteISH_EEEE"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader19OpenWithDataSectionEPKhjS2_jRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEjPKNS_10OatDexFileEbbPS9_"
    },
    {
     "mangled_component_name" : "_ZNK3art13DexFileLoader7OpenAllEPKhjRKNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEbbPNS_22DexFileLoaderErrorCodeEPS9_PNS3_6vectorINS3_10unique_ptrIKNS_7DexFileENS3_14default_deleteISI_EEEENS7_ISL_EEEE"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "type_list_",
     "field_offset" : 32,
     "referenced_type" : "type-4097"
    },
    {
     "access" : "private",
     "field_name" : "size_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "pos_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::DexFileParameterIterator",
   "name" : "art::DexFileParameterIterator",
   "record_kind" : "class",
   "referenced_type" : "type-4775",
   "self_type" : "type-4775",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art24DexFileParameterIteratorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "dex_file",
     "referenced_type" : "type-122"
    },
    {
     "field_name" : "index",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::DexFileReference",
   "name" : "art::DexFileReference",
   "record_kind" : "class",
   "referenced_type" : "type-3867",
   "self_type" : "type-3867",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_reference.h",
   "unique_id" : "_ZTSN3art16DexFileReferenceE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::DexFileReference::Comparator",
   "name" : "art::DexFileReference::Comparator",
   "referenced_type" : "type-4826",
   "self_type" : "type-4826",
   "size" : 1,
   "source_file" : "/art/libdexfile/dex/dex_file_reference.h",
   "unique_id" : "_ZTSN3art16DexFileReference10ComparatorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2358"
    }
   ],
   "linker_set_key" : "art::DexInstructionIterator",
   "name" : "art::DexInstructionIterator",
   "record_kind" : "class",
   "referenced_type" : "type-2357",
   "self_type" : "type-2357",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction_iterator.h",
   "unique_id" : "_ZTSN3art22DexInstructionIteratorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2359"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "data_",
     "referenced_type" : "type-1927"
    }
   ],
   "linker_set_key" : "art::DexInstructionIteratorBase",
   "name" : "art::DexInstructionIteratorBase",
   "record_kind" : "class",
   "referenced_type" : "type-2358",
   "self_type" : "type-2358",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction_iterator.h",
   "unique_id" : "_ZTSN3art26DexInstructionIteratorBaseE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "instructions_",
     "referenced_type" : "type-1928"
    },
    {
     "access" : "protected",
     "field_name" : "dex_pc_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::DexInstructionPcPair",
   "name" : "art::DexInstructionPcPair",
   "record_kind" : "class",
   "referenced_type" : "type-1927",
   "self_type" : "type-1927",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction_iterator.h",
   "unique_id" : "_ZTSN3art20DexInstructionPcPairE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "value_",
     "referenced_type" : "type-3327"
    }
   ],
   "linker_set_key" : "art::Dumpable<art::hiddenapi::ApiList>",
   "name" : "art::Dumpable<art::hiddenapi::ApiList>",
   "record_kind" : "class",
   "referenced_type" : "type-3326",
   "self_type" : "type-3326",
   "size" : 4,
   "source_file" : "/art/libartbase/base/dumpable.h",
   "template_args" : [ "type-3329" ],
   "unique_id" : "_ZTSN3art8DumpableINS_9hiddenapi7ApiListEEE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "dex_file_",
     "referenced_type" : "type-498"
    },
    {
     "access" : "protected",
     "field_name" : "array_size_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "pos_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "protected",
     "field_name" : "ptr_",
     "field_offset" : 96,
     "referenced_type" : "type-42"
    },
    {
     "access" : "protected",
     "field_name" : "type_",
     "field_offset" : 128,
     "referenced_type" : "type-4780"
    },
    {
     "access" : "protected",
     "field_name" : "jval_",
     "field_offset" : 192,
     "referenced_type" : "type-4134"
    }
   ],
   "linker_set_key" : "art::EncodedArrayValueIterator",
   "name" : "art::EncodedArrayValueIterator",
   "record_kind" : "class",
   "referenced_type" : "type-4779",
   "self_type" : "type-4779",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art25EncodedArrayValueIteratorE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4779"
    }
   ],
   "linker_set_key" : "art::EncodedStaticFieldValueIterator",
   "name" : "art::EncodedStaticFieldValueIterator",
   "record_kind" : "class",
   "referenced_type" : "type-4784",
   "self_type" : "type-4784",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/dex_file.h",
   "unique_id" : "_ZTSN3art31EncodedStaticFieldValueIteratorE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::Identity<unsigned int>",
   "name" : "art::Identity<unsigned int>",
   "referenced_type" : "type-3891",
   "self_type" : "type-3891",
   "size" : 1,
   "source_file" : "/art/libartbase/base/stl_util_identity.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN3art8IdentityIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::Instruction",
   "name" : "art::Instruction",
   "record_kind" : "class",
   "referenced_type" : "type-3758",
   "self_type" : "type-3758",
   "size" : 1,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art11InstructionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "element_width",
     "field_offset" : 16,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "element_count",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "type-3767"
    }
   ],
   "linker_set_key" : "art::Instruction::ArrayDataPayload",
   "name" : "art::Instruction::ArrayDataPayload",
   "referenced_type" : "type-3766",
   "self_type" : "type-3766",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art11Instruction16ArrayDataPayloadE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "verify_flags",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "format",
     "field_offset" : 32,
     "referenced_type" : "type-3770"
    },
    {
     "field_name" : "index_type",
     "field_offset" : 40,
     "referenced_type" : "type-3771"
    },
    {
     "field_name" : "flags",
     "field_offset" : 48,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "size_in_code_units",
     "field_offset" : 56,
     "referenced_type" : "type-1865"
    }
   ],
   "linker_set_key" : "art::Instruction::InstructionDescriptor",
   "name" : "art::Instruction::InstructionDescriptor",
   "referenced_type" : "type-3775",
   "self_type" : "type-3775",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art11Instruction21InstructionDescriptorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "case_count",
     "field_offset" : 16,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "first_key",
     "field_offset" : 32,
     "referenced_type" : "type-37"
    },
    {
     "field_name" : "targets",
     "field_offset" : 64,
     "referenced_type" : "type-3761"
    }
   ],
   "linker_set_key" : "art::Instruction::PackedSwitchPayload",
   "name" : "art::Instruction::PackedSwitchPayload",
   "referenced_type" : "type-3760",
   "self_type" : "type-3760",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art11Instruction19PackedSwitchPayloadE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ident",
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "case_count",
     "field_offset" : 16,
     "referenced_type" : "type-1929"
    },
    {
     "field_name" : "keys_and_targets",
     "field_offset" : 32,
     "referenced_type" : "type-3761"
    }
   ],
   "linker_set_key" : "art::Instruction::SparseSwitchPayload",
   "name" : "art::Instruction::SparseSwitchPayload",
   "referenced_type" : "type-3763",
   "self_type" : "type-3763",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art11Instruction19SparseSwitchPayloadE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_operands_",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "art::InstructionOperands",
   "name" : "art::InstructionOperands",
   "record_kind" : "class",
   "referenced_type" : "type-3783",
   "self_type" : "type-3783",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art19InstructionOperandsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art19InstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art19InstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art19InstructionOperandsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK3art19InstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "type-2361"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 320,
     "referenced_type" : "type-2361"
    }
   ],
   "linker_set_key" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Field> >",
   "name" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Field> >",
   "record_kind" : "class",
   "referenced_type" : "type-3805",
   "self_type" : "type-3805",
   "size" : 80,
   "source_file" : "/art/libartbase/base/iteration_range.h",
   "template_args" : [ "type-2361" ],
   "unique_id" : "_ZTSN3art14IterationRangeINS_13ClassAccessor12DataIteratorINS1_5FieldEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "type-2365"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 352,
     "referenced_type" : "type-2365"
    }
   ],
   "linker_set_key" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Method> >",
   "name" : "art::IterationRange<art::ClassAccessor::DataIterator<art::ClassAccessor::Method> >",
   "record_kind" : "class",
   "referenced_type" : "type-3809",
   "self_type" : "type-3809",
   "size" : 88,
   "source_file" : "/art/libartbase/base/iteration_range.h",
   "template_args" : [ "type-2365" ],
   "unique_id" : "_ZTSN3art14IterationRangeINS_13ClassAccessor12DataIteratorINS1_6MethodEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "type-2354"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "type-2354"
    }
   ],
   "linker_set_key" : "art::IterationRange<art::ClassIterator>",
   "name" : "art::IterationRange<art::ClassIterator>",
   "record_kind" : "class",
   "referenced_type" : "type-3813",
   "self_type" : "type-3813",
   "size" : 16,
   "source_file" : "/art/libartbase/base/iteration_range.h",
   "template_args" : [ "type-2354" ],
   "unique_id" : "_ZTSN3art14IterationRangeINS_13ClassIteratorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "type-2357"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 64,
     "referenced_type" : "type-2357"
    }
   ],
   "linker_set_key" : "art::IterationRange<art::DexInstructionIterator>",
   "name" : "art::IterationRange<art::DexInstructionIterator>",
   "record_kind" : "class",
   "referenced_type" : "type-3799",
   "self_type" : "type-3799",
   "size" : 16,
   "source_file" : "/art/libartbase/base/iteration_range.h",
   "template_args" : [ "type-2357" ],
   "unique_id" : "_ZTSN3art14IterationRangeINS_22DexInstructionIteratorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "first_",
     "referenced_type" : "type-2391"
    },
    {
     "access" : "protected",
     "field_name" : "last_",
     "field_offset" : 32,
     "referenced_type" : "type-2391"
    }
   ],
   "linker_set_key" : "art::IterationRange<const art::dex::TryItem *>",
   "name" : "art::IterationRange<const art::dex::TryItem *>",
   "record_kind" : "class",
   "referenced_type" : "type-3801",
   "self_type" : "type-3801",
   "size" : 8,
   "source_file" : "/art/libartbase/base/iteration_range.h",
   "template_args" : [ "type-2391" ],
   "unique_id" : "_ZTSN3art14IterationRangeIPKNS_3dex7TryItemEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3867"
    }
   ],
   "linker_set_key" : "art::MethodReference",
   "name" : "art::MethodReference",
   "record_kind" : "class",
   "referenced_type" : "type-3866",
   "self_type" : "type-3866",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/method_reference.h",
   "unique_id" : "_ZTSN3art15MethodReferenceE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::MethodReferenceValueComparator",
   "name" : "art::MethodReferenceValueComparator",
   "referenced_type" : "type-4835",
   "self_type" : "type-4835",
   "size" : 1,
   "source_file" : "/art/libdexfile/dex/method_reference.h",
   "unique_id" : "_ZTSN3art30MethodReferenceValueComparatorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3783"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "inner_",
     "field_offset" : 64,
     "referenced_type" : "type-3797"
    }
   ],
   "linker_set_key" : "art::NoReceiverInstructionOperands",
   "name" : "art::NoReceiverInstructionOperands",
   "record_kind" : "class",
   "referenced_type" : "type-3796",
   "self_type" : "type-3796",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art29NoReceiverInstructionOperandsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art29NoReceiverInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art29NoReceiverInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art29NoReceiverInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art29NoReceiverInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3783"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "first_operand_",
     "field_offset" : 64,
     "referenced_type" : "type-45"
    }
   ],
   "linker_set_key" : "art::RangeInstructionOperands",
   "name" : "art::RangeInstructionOperands",
   "record_kind" : "class",
   "referenced_type" : "type-3787",
   "self_type" : "type-3787",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art24RangeInstructionOperandsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art24RangeInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art24RangeInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art24RangeInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art24RangeInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-2358"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "num_code_units_",
     "field_offset" : 64,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "error_state_",
     "field_offset" : 96,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "art::SafeDexInstructionIterator",
   "name" : "art::SafeDexInstructionIterator",
   "record_kind" : "class",
   "referenced_type" : "type-4809",
   "self_type" : "type-4809",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/dex_instruction_iterator.h",
   "unique_id" : "_ZTSN3art26SafeDexInstructionIteratorE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-4083"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_file_",
     "referenced_type" : "type-2895"
    },
    {
     "access" : "private",
     "field_name" : "proto_id_",
     "field_offset" : 32,
     "referenced_type" : "type-90"
    }
   ],
   "linker_set_key" : "art::Signature",
   "name" : "art::Signature",
   "record_kind" : "class",
   "referenced_type" : "type-4741",
   "self_type" : "type-4741",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/signature.h",
   "unique_id" : "_ZTSN3art9SignatureE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "art::StandardDexFile",
   "name" : "art::StandardDexFile",
   "record_kind" : "class",
   "referenced_type" : "type-1204",
   "self_type" : "type-1204",
   "size" : 96,
   "source_file" : "/art/libdexfile/dex/standard_dex_file.h",
   "unique_id" : "_ZTSN3art15StandardDexFileE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art15StandardDexFileE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art15StandardDexFileD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile12IsMagicValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile14IsVersionValidEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile22SupportsDefaultMethodsEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile18GetDequickenedSizeEv"
    },
    {
     "mangled_component_name" : "_ZNK3art15StandardDexFile15GetCodeItemSizeERKNS_3dex8CodeItemE"
    },
    {
     "mangled_component_name" : "_ZNK3art7DexFile17CalculateChecksumEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-1132"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "registers_size_",
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "ins_size_",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "outs_size_",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "tries_size_",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "access" : "private",
     "field_name" : "debug_info_off_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "insns_size_in_code_units_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "insns_",
     "field_offset" : 128,
     "referenced_type" : "type-1131"
    }
   ],
   "linker_set_key" : "art::StandardDexFile::CodeItem",
   "name" : "art::StandardDexFile::CodeItem",
   "referenced_type" : "type-1136",
   "self_type" : "type-1136",
   "size" : 20,
   "source_file" : "/art/libdexfile/dex/standard_dex_file.h",
   "unique_id" : "_ZTSN3art15StandardDexFile8CodeItemE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-65"
    }
   ],
   "linker_set_key" : "art::StandardDexFile::Header",
   "name" : "art::StandardDexFile::Header",
   "record_kind" : "class",
   "referenced_type" : "type-4819",
   "self_type" : "type-4819",
   "size" : 112,
   "source_file" : "/art/libdexfile/dex/standard_dex_file.h",
   "unique_id" : "_ZTSN3art15StandardDexFile6HeaderE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::ValueObject",
   "name" : "art::ValueObject",
   "record_kind" : "class",
   "referenced_type" : "type-4083",
   "self_type" : "type-4083",
   "size" : 1,
   "source_file" : "/art/libartbase/base/value_object.h",
   "unique_id" : "_ZTSN3art11ValueObjectE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-3783"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "operands_",
     "field_offset" : 64,
     "referenced_type" : "type-3790"
    }
   ],
   "linker_set_key" : "art::VarArgsInstructionOperands",
   "name" : "art::VarArgsInstructionOperands",
   "record_kind" : "class",
   "referenced_type" : "type-3789",
   "self_type" : "type-3789",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_instruction.h",
   "unique_id" : "_ZTSN3art26VarArgsInstructionOperandsE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN3art26VarArgsInstructionOperandsE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN3art26VarArgsInstructionOperandsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN3art26VarArgsInstructionOperandsD0Ev"
    },
    {
     "mangled_component_name" : "_ZNK3art26VarArgsInstructionOperands10GetOperandEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::VoidFunctor",
   "name" : "art::VoidFunctor",
   "record_kind" : "class",
   "referenced_type" : "type-3888",
   "self_type" : "type-3888",
   "size" : 1,
   "source_file" : "/art/libartbase/base/utils.h",
   "unique_id" : "_ZTSN3art11VoidFunctorE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "visibility_",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "annotation_",
     "field_offset" : 8,
     "referenced_type" : "type-4114"
    }
   ],
   "linker_set_key" : "art::dex::AnnotationItem",
   "name" : "art::dex::AnnotationItem",
   "referenced_type" : "type-4113",
   "self_type" : "type-4113",
   "size" : 2,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex14AnnotationItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "entries_",
     "field_offset" : 32,
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "art::dex::AnnotationSetItem",
   "name" : "art::dex::AnnotationSetItem",
   "referenced_type" : "type-4112",
   "self_type" : "type-4112",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex17AnnotationSetItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "annotations_off_",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::AnnotationSetRefItem",
   "name" : "art::dex::AnnotationSetRefItem",
   "referenced_type" : "type-4108",
   "self_type" : "type-4108",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex20AnnotationSetRefItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "type-4110"
    }
   ],
   "linker_set_key" : "art::dex::AnnotationSetRefList",
   "name" : "art::dex::AnnotationSetRefList",
   "referenced_type" : "type-4109",
   "self_type" : "type-4109",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex20AnnotationSetRefListE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_annotations_off_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "fields_size_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "methods_size_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "parameters_size_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::AnnotationsDirectoryItem",
   "name" : "art::dex::AnnotationsDirectoryItem",
   "referenced_type" : "type-4102",
   "self_type" : "type-4102",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex24AnnotationsDirectoryItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_off_",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::CallSiteIdItem",
   "name" : "art::dex::CallSiteIdItem",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex14CallSiteIdItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "pad1_",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "access_flags_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "superclass_idx_",
     "field_offset" : 64,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "pad2_",
     "field_offset" : 80,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "interfaces_off_",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "source_file_idx_",
     "field_offset" : 128,
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "class_data_off_",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "static_values_off_",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::ClassDef",
   "name" : "art::dex::ClassDef",
   "referenced_type" : "type-97",
   "self_type" : "type-97",
   "size" : 32,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8ClassDefE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::dex::CodeItem",
   "name" : "art::dex::CodeItem",
   "referenced_type" : "type-1132",
   "self_type" : "type-1132",
   "size" : 1,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8CodeItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::DexIndex<unsigned int>",
   "name" : "art::dex::DexIndex<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-77",
   "self_type" : "type-77",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "type-11" ],
   "unique_id" : "_ZTSN3art3dex8DexIndexIjEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "index_",
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "art::dex::DexIndex<unsigned short>",
   "name" : "art::dex::DexIndex<unsigned short>",
   "record_kind" : "class",
   "referenced_type" : "type-83",
   "self_type" : "type-83",
   "size" : 2,
   "source_file" : "/art/libdexfile/dex/dex_file_types.h",
   "template_args" : [ "type-84" ],
   "unique_id" : "_ZTSN3art3dex8DexIndexItEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "field_idx_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::FieldAnnotationsItem",
   "name" : "art::dex::FieldAnnotationsItem",
   "referenced_type" : "type-4103",
   "self_type" : "type-4103",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex20FieldAnnotationsItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "type_idx_",
     "field_offset" : 16,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "art::dex::FieldId",
   "name" : "art::dex::FieldId",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex7FieldIdE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "flags_offset_",
     "field_offset" : 32,
     "referenced_type" : "type-104"
    }
   ],
   "linker_set_key" : "art::dex::HiddenapiClassData",
   "name" : "art::dex::HiddenapiClassData",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex18HiddenapiClassDataE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type_",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "unused_",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "size_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "offset_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::MapItem",
   "name" : "art::dex::MapItem",
   "referenced_type" : "type-4086",
   "self_type" : "type-4086",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex7MapItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "size_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "type-4088"
    }
   ],
   "linker_set_key" : "art::dex::MapList",
   "name" : "art::dex::MapList",
   "referenced_type" : "type-4087",
   "self_type" : "type-4087",
   "size" : 16,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex7MapListE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::MethodAnnotationsItem",
   "name" : "art::dex::MethodAnnotationsItem",
   "referenced_type" : "type-4104",
   "self_type" : "type-4104",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex21MethodAnnotationsItemE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "method_handle_type_",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "reserved1_",
     "field_offset" : 16,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "field_or_method_idx_",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "reserved2_",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "art::dex::MethodHandleItem",
   "name" : "art::dex::MethodHandleItem",
   "referenced_type" : "type-100",
   "self_type" : "type-100",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex16MethodHandleItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "class_idx_",
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "proto_idx_",
     "field_offset" : 16,
     "referenced_type" : "type-89"
    },
    {
     "field_name" : "name_idx_",
     "field_offset" : 32,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "art::dex::MethodId",
   "name" : "art::dex::MethodId",
   "referenced_type" : "type-88",
   "self_type" : "type-88",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8MethodIdE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "method_idx_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "annotations_off_",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::ParameterAnnotationsItem",
   "name" : "art::dex::ParameterAnnotationsItem",
   "referenced_type" : "type-4105",
   "self_type" : "type-4105",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex24ParameterAnnotationsItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shorty_idx_",
     "referenced_type" : "type-76"
    },
    {
     "field_name" : "return_type_idx_",
     "field_offset" : 32,
     "referenced_type" : "type-82"
    },
    {
     "field_name" : "pad_",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "parameters_off_",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::ProtoId",
   "name" : "art::dex::ProtoId",
   "referenced_type" : "type-93",
   "self_type" : "type-93",
   "size" : 12,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex7ProtoIdE"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "art::dex::ProtoIndex",
   "name" : "art::dex::ProtoIndex",
   "record_kind" : "class",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 2,
   "source_file" : "/art/libdexfile/dex/dex_file_types.h",
   "unique_id" : "_ZTSN3art3dex10ProtoIndexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "string_data_off_",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::dex::StringId",
   "name" : "art::dex::StringId",
   "referenced_type" : "type-71",
   "self_type" : "type-71",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8StringIdE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-77"
    }
   ],
   "linker_set_key" : "art::dex::StringIndex",
   "name" : "art::dex::StringIndex",
   "record_kind" : "class",
   "referenced_type" : "type-76",
   "self_type" : "type-76",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_types.h",
   "unique_id" : "_ZTSN3art3dex11StringIndexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "start_addr_",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "insn_count_",
     "field_offset" : 32,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "handler_off_",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "art::dex::TryItem",
   "name" : "art::dex::TryItem",
   "referenced_type" : "type-2393",
   "self_type" : "type-2393",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex7TryItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "descriptor_idx_",
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "art::dex::TypeId",
   "name" : "art::dex::TypeId",
   "referenced_type" : "type-75",
   "self_type" : "type-75",
   "size" : 4,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex6TypeIdE"
  },
  {
   "alignment" : 2,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "art::dex::TypeIndex",
   "name" : "art::dex::TypeIndex",
   "record_kind" : "class",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 2,
   "source_file" : "/art/libdexfile/dex/dex_file_types.h",
   "unique_id" : "_ZTSN3art3dex9TypeIndexE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "type_idx_",
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "art::dex::TypeItem",
   "name" : "art::dex::TypeItem",
   "referenced_type" : "type-4093",
   "self_type" : "type-4093",
   "size" : 2,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8TypeItemE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "size_",
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "list_",
     "field_offset" : 32,
     "referenced_type" : "type-4095"
    }
   ],
   "linker_set_key" : "art::dex::TypeList",
   "name" : "art::dex::TypeList",
   "record_kind" : "class",
   "referenced_type" : "type-4094",
   "self_type" : "type-4094",
   "size" : 8,
   "source_file" : "/art/libdexfile/dex/dex_file_structs.h",
   "unique_id" : "_ZTSN3art3dex8TypeListE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "dex_flags_",
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "art::hiddenapi::ApiList",
   "name" : "art::hiddenapi::ApiList",
   "record_kind" : "class",
   "referenced_type" : "type-3329",
   "self_type" : "type-3329",
   "size" : 4,
   "source_file" : "/art/libartbase/base/hiddenapi_flags.h",
   "unique_id" : "_ZTSN3art9hiddenapi7ApiListE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "art::hiddenapi::ApiStubs",
   "name" : "art::hiddenapi::ApiStubs",
   "record_kind" : "class",
   "referenced_type" : "type-3897",
   "self_type" : "type-3897",
   "size" : 1,
   "source_file" : "/art/libartbase/base/hiddenapi_stubs.h",
   "unique_id" : "_ZTSN3art9hiddenapi8ApiStubsE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<libunwind::Registers_arm>",
   "referenced_type" : "type-5559",
   "self_type" : "type-5559",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5351" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5560",
   "self_type" : "type-5560",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_armE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<libunwind::Registers_arm64>",
   "referenced_type" : "type-5556",
   "self_type" : "type-5556",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5342" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_arm64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5557",
   "self_type" : "type-5557",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_arm64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<libunwind::Registers_mips_newabi>",
   "referenced_type" : "type-5569",
   "self_type" : "type-5569",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5368" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_newabi, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5570",
   "self_type" : "type-5570",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<libunwind::Registers_mips_o32>",
   "referenced_type" : "type-5566",
   "self_type" : "type-5566",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5363" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_mips_o32, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5567",
   "self_type" : "type-5567",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<libunwind::Registers_or1k>",
   "referenced_type" : "type-5562",
   "self_type" : "type-5562",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5358" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_or1k, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5563",
   "self_type" : "type-5563",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind14Registers_or1kE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<libunwind::Registers_ppc>",
   "referenced_type" : "type-5549",
   "self_type" : "type-5549",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5324" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5550",
   "self_type" : "type-5550",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_ppcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<libunwind::Registers_ppc64>",
   "referenced_type" : "type-5552",
   "self_type" : "type-5552",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5336" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_ppc64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5553",
   "self_type" : "type-5553",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<libunwind::Registers_sparc>",
   "referenced_type" : "type-5572",
   "self_type" : "type-5572",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5374" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_sparc, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5573",
   "self_type" : "type-5573",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind15Registers_sparcE13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<libunwind::Registers_x86>",
   "referenced_type" : "type-5542",
   "self_type" : "type-5542",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5306" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5544",
   "self_type" : "type-5544",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind13Registers_x86E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<libunwind::Registers_x86_64>",
   "referenced_type" : "type-5546",
   "self_type" : "type-5546",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5315" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS1_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "name" : "check_fit<Registers_x86_64, unw_context_t>::blk_count<unw_context_t>",
   "referenced_type" : "type-5547",
   "self_type" : "type-5547",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5327" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE9blk_countIS2_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm> >",
   "referenced_type" : "type-5575",
   "self_type" : "type-5575",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5520" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS4_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "name" : "check_fit<UnwindCursor<LocalAddressSpace, Registers_arm>, unw_cursor_t>::blk_count<unw_cursor_t>",
   "referenced_type" : "type-5576",
   "self_type" : "type-5576",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5311" ],
   "unique_id" : "_ZTSN9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE9blk_countIS5_EE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm, unw_context_t>",
   "referenced_type" : "type-5558",
   "self_type" : "type-5558",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5351", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_armE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_arm64, unw_context_t>",
   "referenced_type" : "type-5555",
   "self_type" : "type-5555",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5342", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_arm64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_newabi, unw_context_t>",
   "referenced_type" : "type-5568",
   "self_type" : "type-5568",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5368", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind21Registers_mips_newabiE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_mips_o32, unw_context_t>",
   "referenced_type" : "type-5564",
   "self_type" : "type-5564",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5363", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind18Registers_mips_o32E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_or1k, unw_context_t>",
   "referenced_type" : "type-5561",
   "self_type" : "type-5561",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5358", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind14Registers_or1kE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc, unw_context_t>",
   "referenced_type" : "type-5548",
   "self_type" : "type-5548",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5324", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_ppcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_ppc64, unw_context_t>",
   "referenced_type" : "type-5551",
   "self_type" : "type-5551",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5336", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_ppc64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_sparc, unw_context_t>",
   "referenced_type" : "type-5571",
   "self_type" : "type-5571",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5374", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind15Registers_sparcE13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86, unw_context_t>",
   "referenced_type" : "type-5541",
   "self_type" : "type-5541",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5306", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind13Registers_x86E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "name" : "check_fit<libunwind::Registers_x86_64, unw_context_t>",
   "referenced_type" : "type-5545",
   "self_type" : "type-5545",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5315", "type-5327" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind16Registers_x86_64E13unw_context_tE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "name" : "check_fit<libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>, unw_cursor_t>",
   "referenced_type" : "type-5574",
   "self_type" : "type-5574",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/config.h",
   "template_args" : [ "type-5520", "type-5311" ],
   "unique_id" : "_ZTS9check_fitIN9libunwind12UnwindCursorINS0_17LocalAddressSpaceENS0_13Registers_armEEE12unw_cursor_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "cmsg_len",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "cmsg_level",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "cmsg_type",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "cmsghdr",
   "name" : "cmsghdr",
   "referenced_type" : "type-3728",
   "self_type" : "type-3728",
   "size" : 12,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "cmsghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-3397"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-3396",
   "self_type" : "type-3396",
   "size" : 4,
   "source_file" : "/bionic/libc/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "type-3397"
    }
   ],
   "linker_set_key" : "cpu_set_t",
   "name" : "cpu_set_t",
   "referenced_type" : "type-5446",
   "self_type" : "type-5446",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "cpu_set_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "type-3712"
    }
   ],
   "linker_set_key" : "dirent",
   "name" : "dirent",
   "referenced_type" : "type-3711",
   "self_type" : "type-3711",
   "size" : 280,
   "source_file" : "/bionic/libc/include/dirent.h",
   "unique_id" : "dirent"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "type-3712"
    }
   ],
   "linker_set_key" : "dirent64",
   "name" : "dirent64",
   "referenced_type" : "type-3713",
   "self_type" : "type-3713",
   "size" : 280,
   "source_file" : "/bionic/libc/include/dirent.h",
   "unique_id" : "dirent64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-2113",
   "self_type" : "type-2113",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "div_t",
   "name" : "div_t",
   "referenced_type" : "type-5538",
   "self_type" : "type-5538",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "div_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "addressSpace",
     "referenced_type" : "type-5431"
    },
    {
     "field_name" : "sects",
     "field_offset" : 32,
     "referenced_type" : "type-5434"
    },
    {
     "field_name" : "targetAddr",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "dl_iterate_cb_data",
   "name" : "dl_iterate_cb_data",
   "referenced_type" : "type-5433",
   "self_type" : "type-5433",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSZN9libunwind17LocalAddressSpace18findUnwindSectionsEjRNS_18UnwindInfoSectionsEE18dl_iterate_cb_data"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dlpi_addr",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "dlpi_name",
     "field_offset" : 32,
     "referenced_type" : "type-253"
    },
    {
     "field_name" : "dlpi_phdr",
     "field_offset" : 64,
     "referenced_type" : "type-5422"
    },
    {
     "field_name" : "dlpi_phnum",
     "field_offset" : 96,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "dlpi_adds",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "dlpi_subs",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "dlpi_tls_modid",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "dlpi_tls_data",
     "field_offset" : 288,
     "referenced_type" : "type-226"
    }
   ],
   "linker_set_key" : "dl_phdr_info",
   "name" : "dl_phdr_info",
   "referenced_type" : "type-5421",
   "self_type" : "type-5421",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "dl_phdr_info"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tbase",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "dbase",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "func",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "dwarf_eh_bases",
   "name" : "dwarf_eh_bases",
   "referenced_type" : "type-5299",
   "self_type" : "type-5299",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/include/unwind.h",
   "unique_id" : "dwarf_eh_bases"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_tag",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "d_un",
     "field_offset" : 32,
     "referenced_type" : "type-5378"
    }
   ],
   "linker_set_key" : "dynamic",
   "name" : "dynamic",
   "referenced_type" : "type-5377",
   "self_type" : "type-5377",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS7dynamic"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "d_val",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "d_ptr",
     "referenced_type" : "type-11"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "name" : "dynamic::(anonymous union at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3) at out/soong/ndk/sysroot/usr/include/linux/elf.h:119:3",
   "record_kind" : "union",
   "referenced_type" : "type-5378",
   "self_type" : "type-5378",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTSN7dynamicUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 320,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 336,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 352,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 368,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 384,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 400,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "elf32_hdr",
   "name" : "elf32_hdr",
   "referenced_type" : "type-5388",
   "self_type" : "type-5388",
   "size" : 52,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "elf32_note",
   "name" : "elf32_note",
   "referenced_type" : "type-5395",
   "self_type" : "type-5395",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_note"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "elf32_phdr",
   "name" : "elf32_phdr",
   "referenced_type" : "type-5390",
   "self_type" : "type-5390",
   "size" : 32,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_phdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "elf32_rel",
   "name" : "elf32_rel",
   "referenced_type" : "type-5381",
   "self_type" : "type-5381",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_rel"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "elf32_rela",
   "name" : "elf32_rela",
   "referenced_type" : "type-5384",
   "self_type" : "type-5384",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_rela"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "elf32_shdr",
   "name" : "elf32_shdr",
   "referenced_type" : "type-5392",
   "self_type" : "type-5392",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf32_shdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 96,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 104,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 112,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "elf32_sym",
   "name" : "elf32_sym",
   "referenced_type" : "type-5386",
   "self_type" : "type-5386",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf32_sym"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e_ident",
     "referenced_type" : "type-332"
    },
    {
     "field_name" : "e_type",
     "field_offset" : 128,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_machine",
     "field_offset" : 144,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_version",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_entry",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "e_phoff",
     "field_offset" : 256,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "e_shoff",
     "field_offset" : 320,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "e_flags",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "e_ehsize",
     "field_offset" : 416,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_phentsize",
     "field_offset" : 432,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_phnum",
     "field_offset" : 448,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shentsize",
     "field_offset" : 464,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shnum",
     "field_offset" : 480,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "e_shstrndx",
     "field_offset" : 496,
     "referenced_type" : "type-84"
    }
   ],
   "linker_set_key" : "elf64_hdr",
   "name" : "elf64_hdr",
   "referenced_type" : "type-5389",
   "self_type" : "type-5389",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_hdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "n_namesz",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "n_descsz",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "n_type",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "elf64_note",
   "name" : "elf64_note",
   "referenced_type" : "type-5396",
   "self_type" : "type-5396",
   "size" : 12,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_note"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "p_type",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_flags",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "p_offset",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "p_vaddr",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "p_paddr",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "p_filesz",
     "field_offset" : 256,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "p_memsz",
     "field_offset" : 320,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "p_align",
     "field_offset" : 384,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "elf64_phdr",
   "name" : "elf64_phdr",
   "referenced_type" : "type-5391",
   "self_type" : "type-5391",
   "size" : 56,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_phdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "elf64_rel",
   "name" : "elf64_rel",
   "referenced_type" : "type-5382",
   "self_type" : "type-5382",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_rel"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r_offset",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "r_info",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "r_addend",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "elf64_rela",
   "name" : "elf64_rela",
   "referenced_type" : "type-5385",
   "self_type" : "type-5385",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_rela"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sh_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_type",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_flags",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "sh_addr",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "sh_offset",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "sh_size",
     "field_offset" : 256,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "sh_link",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_info",
     "field_offset" : 352,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sh_addralign",
     "field_offset" : 384,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "sh_entsize",
     "field_offset" : 448,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "elf64_shdr",
   "name" : "elf64_shdr",
   "referenced_type" : "type-5394",
   "self_type" : "type-5394",
   "size" : 64,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS10elf64_shdr"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "st_name",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "st_info",
     "field_offset" : 32,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "st_other",
     "field_offset" : 40,
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "st_shndx",
     "field_offset" : 48,
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "st_value",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "st_size",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "elf64_sym",
   "name" : "elf64_sym",
   "referenced_type" : "type-5387",
   "self_type" : "type-5387",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/elf.h",
   "unique_id" : "_ZTS9elf64_sym"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "f_owner_ex",
   "name" : "f_owner_ex",
   "referenced_type" : "type-3714",
   "self_type" : "type-3714",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS10f_owner_ex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2998"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-4771",
   "self_type" : "type-4771",
   "size" : 128,
   "source_file" : "/bionic/libc/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "type-2998"
    }
   ],
   "linker_set_key" : "fd_set",
   "name" : "fd_set",
   "referenced_type" : "type-5507",
   "self_type" : "type-5507",
   "size" : 128,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sys/select.h",
   "unique_id" : "fd_set"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 32,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 64,
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "flock",
   "name" : "flock",
   "referenced_type" : "type-3715",
   "self_type" : "type-3715",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS5flock"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "l_type",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "l_whence",
     "field_offset" : 16,
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "l_start",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_len",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "l_pid",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "flock64",
   "name" : "flock64",
   "referenced_type" : "type-3716",
   "self_type" : "type-3716",
   "size" : 32,
   "source_file" : "/bionic/libc/kernel/uapi/asm-generic/fcntl.h",
   "unique_id" : "_ZTS7flock64"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-3207",
   "self_type" : "type-3207",
   "size" : 16,
   "source_file" : "/bionic/libc/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-5302",
   "self_type" : "type-5302",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "_ZTS9imaxdiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "imaxdiv_t",
   "name" : "imaxdiv_t",
   "referenced_type" : "type-5604",
   "self_type" : "type-5604",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/inttypes.h",
   "unique_id" : "imaxdiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "iov_base",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "iov_len",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "iovec",
   "name" : "iovec",
   "referenced_type" : "type-3717",
   "self_type" : "type-3717",
   "size" : 8,
   "source_file" : "/bionic/libc/kernel/uapi/linux/uio.h",
   "unique_id" : "_ZTS5iovec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-3335"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-3335"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-4877",
   "self_type" : "type-4877",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-5444"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-5444"
    }
   ],
   "linker_set_key" : "itimerspec",
   "name" : "itimerspec",
   "referenced_type" : "type-5455",
   "self_type" : "type-5455",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS10itimerspec"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-4860"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-4860"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-4885",
   "self_type" : "type-4885",
   "size" : 16,
   "source_file" : "/bionic/libc/kernel/uapi/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "type-5452"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 64,
     "referenced_type" : "type-5452"
    }
   ],
   "linker_set_key" : "itimerval",
   "name" : "itimerval",
   "referenced_type" : "type-5457",
   "self_type" : "type-5457",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/linux/time.h",
   "unique_id" : "_ZTS9itimerval"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "type-44"
    },
    {
     "field_name" : "b",
     "referenced_type" : "type-1865"
    },
    {
     "field_name" : "c",
     "referenced_type" : "type-84"
    },
    {
     "field_name" : "s",
     "referenced_type" : "type-429"
    },
    {
     "field_name" : "i",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "j",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "f",
     "referenced_type" : "type-2251"
    },
    {
     "field_name" : "d",
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "l",
     "referenced_type" : "type-4135"
    }
   ],
   "linker_set_key" : "jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "type-4134",
   "self_type" : "type-4134",
   "size" : 8,
   "source_file" : "/libnativehelper/include_jni/jni.h",
   "unique_id" : "_ZTS6jvalue"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 64,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 96,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 128,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 160,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 192,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 224,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 256,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 288,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 320,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 328,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 336,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 344,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 352,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 360,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 368,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 376,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 384,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 392,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 400,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 408,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 416,
     "referenced_type" : "type-17"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 424,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "lconv",
   "name" : "lconv",
   "referenced_type" : "type-3432",
   "self_type" : "type-3432",
   "size" : 56,
   "source_file" : "/bionic/libc/include/locale.h",
   "unique_id" : "lconv"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-2114",
   "self_type" : "type-2114",
   "size" : 8,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-245"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "type-245"
    }
   ],
   "linker_set_key" : "ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "type-5539",
   "self_type" : "type-5539",
   "size" : 8,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "ldiv_t"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "libunwind::AbstractUnwindCursor",
   "name" : "libunwind::AbstractUnwindCursor",
   "record_kind" : "class",
   "referenced_type" : "type-5516",
   "self_type" : "type-5516",
   "size" : 4,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind20AbstractUnwindCursorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind20AbstractUnwindCursorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind20AbstractUnwindCursor10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functionOffset",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::EHABIIndexEntry",
   "name" : "libunwind::EHABIIndexEntry",
   "referenced_type" : "type-5524",
   "self_type" : "type-5524",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "unique_id" : "_ZTSN9libunwind15EHABIIndexEntryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_i",
     "referenced_type" : "type-11"
    },
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-5431"
    },
    {
     "access" : "private",
     "field_name" : "_sects",
     "field_offset" : 64,
     "referenced_type" : "type-5526"
    }
   ],
   "linker_set_key" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "name" : "libunwind::EHABISectionIterator<libunwind::LocalAddressSpace>",
   "referenced_type" : "type-5525",
   "self_type" : "type-5525",
   "size" : 12,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-5430" ],
   "unique_id" : "_ZTSN9libunwind20EHABISectionIteratorINS_17LocalAddressSpaceEEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "libunwind::LocalAddressSpace",
   "name" : "libunwind::LocalAddressSpace",
   "record_kind" : "class",
   "referenced_type" : "type-5430",
   "self_type" : "type-5430",
   "size" : 1,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind17LocalAddressSpaceE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_lock",
     "referenced_type" : "type-5513"
    }
   ],
   "linker_set_key" : "libunwind::RWMutex",
   "name" : "libunwind::RWMutex",
   "record_kind" : "class",
   "referenced_type" : "type-5512",
   "self_type" : "type-5512",
   "size" : 40,
   "source_file" : "/external/libunwind_llvm/src/RWMutex.hpp",
   "unique_id" : "_ZTSN9libunwind7RWMutexE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5346"
    },
    {
     "access" : "private",
     "field_name" : "_use_X_for_vfp_save",
     "field_offset" : 512,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d0_d15",
     "field_offset" : 520,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_saved_vfp_d16_d31",
     "field_offset" : 528,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d0_d15_pad",
     "field_offset" : 576,
     "referenced_type" : "type-5348"
    },
    {
     "access" : "private",
     "field_name" : "_vfp_d16_d31",
     "field_offset" : 1664,
     "referenced_type" : "type-5349"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm",
   "name" : "libunwind::Registers_arm",
   "record_kind" : "class",
   "referenced_type" : "type-5351",
   "self_type" : "type-5351",
   "size" : 336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_armE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5339"
    },
    {
     "access" : "private",
     "field_name" : "_vectorHalfRegisters",
     "field_offset" : 2176,
     "referenced_type" : "type-5320"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64",
   "name" : "libunwind::Registers_arm64",
   "record_kind" : "class",
   "referenced_type" : "type-5342",
   "self_type" : "type-5342",
   "size" : 528,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__x",
     "referenced_type" : "type-5340"
    },
    {
     "field_name" : "__fp",
     "field_offset" : 1856,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1920,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 1984,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__ra_sign_state",
     "field_offset" : 2112,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm64::GPRs",
   "name" : "libunwind::Registers_arm64::GPRs",
   "referenced_type" : "type-5339",
   "self_type" : "type-5339",
   "size" : 272,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_arm644GPRsE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-5347"
    },
    {
     "field_name" : "__sp",
     "field_offset" : 416,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 480,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_arm::GPRs",
   "name" : "libunwind::Registers_arm::GPRs",
   "referenced_type" : "type-5346",
   "self_type" : "type-5346",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_arm4GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5366"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi",
   "name" : "libunwind::Registers_mips_newabi",
   "record_kind" : "class",
   "referenced_type" : "type-5368",
   "self_type" : "type-5368",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabiE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-2591"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 2048,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 2112,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 2176,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "name" : "libunwind::Registers_mips_newabi::mips_newabi_thread_state_t",
   "referenced_type" : "type-5366",
   "self_type" : "type-5366",
   "size" : 280,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind21Registers_mips_newabi26mips_newabi_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5361"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32",
   "name" : "libunwind::Registers_mips_o32",
   "record_kind" : "class",
   "referenced_type" : "type-5363",
   "self_type" : "type-5363",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o32E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-5356"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__hi",
     "field_offset" : 1056,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__lo",
     "field_offset" : 1088,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "name" : "libunwind::Registers_mips_o32::mips_o32_thread_state_t",
   "referenced_type" : "type-5361",
   "self_type" : "type-5361",
   "size" : 140,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind18Registers_mips_o3223mips_o32_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5355"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k",
   "name" : "libunwind::Registers_or1k",
   "record_kind" : "class",
   "referenced_type" : "type-5358",
   "self_type" : "type-5358",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1kE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__r",
     "referenced_type" : "type-5356"
    },
    {
     "field_name" : "__pc",
     "field_offset" : 1024,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__epcr",
     "field_offset" : 1056,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "name" : "libunwind::Registers_or1k::or1k_thread_state_t",
   "referenced_type" : "type-5355",
   "self_type" : "type-5355",
   "size" : 136,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind14Registers_or1k19or1k_thread_state_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5318"
    },
    {
     "access" : "private",
     "field_name" : "_floatRegisters",
     "field_offset" : 1280,
     "referenced_type" : "type-5319"
    },
    {
     "access" : "private",
     "field_name" : "_vectorRegisters",
     "field_offset" : 3392,
     "referenced_type" : "type-5322"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc",
   "name" : "libunwind::Registers_ppc",
   "record_kind" : "class",
   "referenced_type" : "type-5324",
   "self_type" : "type-5324",
   "size" : 936,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppcE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5330"
    },
    {
     "access" : "private",
     "field_name" : "_vectorScalarRegisters",
     "field_offset" : 2496,
     "referenced_type" : "type-5334"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64",
   "name" : "libunwind::Registers_ppc64",
   "record_kind" : "class",
   "referenced_type" : "type-5336",
   "self_type" : "type-5336",
   "size" : 1336,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 256,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 320,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 384,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 448,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 512,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 576,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 640,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 704,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 768,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 832,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 896,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 960,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 1024,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 1088,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 1152,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 1216,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 1280,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 1344,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 1408,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 1472,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 1536,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 1600,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 1664,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 1728,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 1792,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 1856,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 1920,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 1984,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 2048,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 2112,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 2176,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 2240,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 2304,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 2368,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 2432,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "name" : "libunwind::Registers_ppc64::ppc64_thread_state_t",
   "referenced_type" : "type-5330",
   "self_type" : "type-5330",
   "size" : 312,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6420ppc64_thread_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "asfloat",
     "referenced_type" : "type-5333"
    },
    {
     "field_name" : "v",
     "referenced_type" : "type-5303"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t",
   "record_kind" : "union",
   "referenced_type" : "type-5332",
   "self_type" : "type-5332",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_tE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "type-140"
    },
    {
     "field_name" : "v2",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "name" : "libunwind::Registers_ppc64::ppc64_vsr_t::asfloat_s",
   "referenced_type" : "type-5333",
   "self_type" : "type-5333",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_ppc6411ppc64_vsr_t9asfloat_sE"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__fpregs",
     "referenced_type" : "type-5320"
    },
    {
     "field_name" : "__fpscr_pad",
     "field_offset" : 2048,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__fpscr",
     "field_offset" : 2080,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_float_state_t",
   "name" : "libunwind::Registers_ppc::ppc_float_state_t",
   "referenced_type" : "type-5319",
   "self_type" : "type-5319",
   "size" : 264,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc17ppc_float_state_tE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__srr0",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__srr1",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r0",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r1",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r2",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r3",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r4",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r5",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r6",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r7",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 352,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 416,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 480,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 512,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 544,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r16",
     "field_offset" : 576,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r17",
     "field_offset" : 608,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r18",
     "field_offset" : 640,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r19",
     "field_offset" : 672,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r20",
     "field_offset" : 704,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r21",
     "field_offset" : 736,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r22",
     "field_offset" : 768,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r23",
     "field_offset" : 800,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r24",
     "field_offset" : 832,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r25",
     "field_offset" : 864,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r26",
     "field_offset" : 896,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r27",
     "field_offset" : 928,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r28",
     "field_offset" : 960,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r29",
     "field_offset" : 992,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r30",
     "field_offset" : 1024,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__r31",
     "field_offset" : 1056,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__cr",
     "field_offset" : 1088,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__xer",
     "field_offset" : 1120,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__lr",
     "field_offset" : 1152,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ctr",
     "field_offset" : 1184,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__mq",
     "field_offset" : 1216,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__vrsave",
     "field_offset" : 1248,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "name" : "libunwind::Registers_ppc::ppc_thread_state_t",
   "referenced_type" : "type-5318",
   "self_type" : "type-5318",
   "size" : 160,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_ppc18ppc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5371"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc",
   "name" : "libunwind::Registers_sparc",
   "record_kind" : "class",
   "referenced_type" : "type-5374",
   "self_type" : "type-5374",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparcE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__regs",
     "referenced_type" : "type-5356"
    }
   ],
   "linker_set_key" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "name" : "libunwind::Registers_sparc::sparc_thread_state_t",
   "referenced_type" : "type-5371",
   "self_type" : "type-5371",
   "size" : 128,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind15Registers_sparc20sparc_thread_state_tE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5304"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86",
   "name" : "libunwind::Registers_x86",
   "record_kind" : "class",
   "referenced_type" : "type-5306",
   "self_type" : "type-5306",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x86E"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__eax",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ebx",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ecx",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__edx",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__edi",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__esi",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ebp",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__esp",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ss",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__eflags",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__eip",
     "field_offset" : 320,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 352,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__ds",
     "field_offset" : 384,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__es",
     "field_offset" : 416,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 448,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 480,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86::GPRs",
   "name" : "libunwind::Registers_x86::GPRs",
   "referenced_type" : "type-5304",
   "self_type" : "type-5304",
   "size" : 64,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind13Registers_x864GPRsE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_registers",
     "referenced_type" : "type-5313"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64",
   "name" : "libunwind::Registers_x86_64",
   "record_kind" : "class",
   "referenced_type" : "type-5315",
   "self_type" : "type-5315",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_64E"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__rax",
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rbx",
     "field_offset" : 64,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rcx",
     "field_offset" : 128,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rdx",
     "field_offset" : 192,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rdi",
     "field_offset" : 256,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rsi",
     "field_offset" : 320,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rbp",
     "field_offset" : 384,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rsp",
     "field_offset" : 448,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r8",
     "field_offset" : 512,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r9",
     "field_offset" : 576,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r10",
     "field_offset" : 640,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r11",
     "field_offset" : 704,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r12",
     "field_offset" : 768,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r13",
     "field_offset" : 832,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r14",
     "field_offset" : 896,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__r15",
     "field_offset" : 960,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rip",
     "field_offset" : 1024,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__rflags",
     "field_offset" : 1088,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__cs",
     "field_offset" : 1152,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__fs",
     "field_offset" : 1216,
     "referenced_type" : "type-848"
    },
    {
     "field_name" : "__gs",
     "field_offset" : 1280,
     "referenced_type" : "type-848"
    }
   ],
   "linker_set_key" : "libunwind::Registers_x86_64::GPRs",
   "name" : "libunwind::Registers_x86_64::GPRs",
   "referenced_type" : "type-5313",
   "self_type" : "type-5313",
   "size" : 168,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind16Registers_x86_644GPRsE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-5516"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_addressSpace",
     "field_offset" : 32,
     "referenced_type" : "type-5518"
    },
    {
     "access" : "private",
     "field_name" : "_registers",
     "field_offset" : 64,
     "referenced_type" : "type-5351"
    },
    {
     "access" : "private",
     "field_name" : "_info",
     "field_offset" : 2752,
     "referenced_type" : "type-5409"
    },
    {
     "access" : "private",
     "field_name" : "_unwindInfoMissing",
     "field_offset" : 3072,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "_isSignalFrame",
     "field_offset" : 3080,
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "name" : "libunwind::UnwindCursor<libunwind::LocalAddressSpace, libunwind::Registers_arm>",
   "record_kind" : "class",
   "referenced_type" : "type-5520",
   "self_type" : "type-5520",
   "size" : 392,
   "source_file" : "/external/libunwind_llvm/src/UnwindCursor.hpp",
   "template_args" : [ "type-5430", "type-5351" ],
   "unique_id" : "_ZTSN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE8validRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6getRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6setRegEij"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13validFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11getFloatRegEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE11setFloatRegEiy"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE4stepEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE7getInfoEP15unw_proc_info_t"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE6jumptoEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE13isSignalFrameEv"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getFunctionNameEPcjPj"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE24setInfoBasedOnIPRegisterEb"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE15getRegisterNameEi"
    },
    {
     "mangled_component_name" : "_ZN9libunwind12UnwindCursorINS_17LocalAddressSpaceENS_13Registers_armEE10saveVFPAsXEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arm_section",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "arm_section_length",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "libunwind::UnwindInfoSections",
   "name" : "libunwind::UnwindInfoSections",
   "referenced_type" : "type-5429",
   "self_type" : "type-5429",
   "size" : 8,
   "source_file" : "/external/libunwind_llvm/src/AddressSpace.hpp",
   "unique_id" : "_ZTSN9libunwind18UnwindInfoSectionsE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "vec",
     "referenced_type" : "type-5293"
    }
   ],
   "linker_set_key" : "libunwind::v128",
   "name" : "libunwind::v128",
   "referenced_type" : "type-5303",
   "self_type" : "type-5303",
   "size" : 16,
   "source_file" : "/external/libunwind_llvm/src/Registers.hpp",
   "unique_id" : "_ZTSN9libunwind4v128E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_onoff",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "l_linger",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "linger",
   "name" : "linger",
   "referenced_type" : "type-3724",
   "self_type" : "type-3724",
   "size" : 8,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "linger"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "l_addr",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "l_name",
     "field_offset" : 32,
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "l_ld",
     "field_offset" : 64,
     "referenced_type" : "type-5425"
    },
    {
     "field_name" : "l_next",
     "field_offset" : 96,
     "referenced_type" : "type-5426"
    },
    {
     "field_name" : "l_prev",
     "field_offset" : 128,
     "referenced_type" : "type-5426"
    }
   ],
   "linker_set_key" : "link_map",
   "name" : "link_map",
   "referenced_type" : "type-5424",
   "self_type" : "type-5424",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "link_map"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-2115",
   "self_type" : "type-2115",
   "size" : 16,
   "source_file" : "/bionic/libc/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "type-5540",
   "self_type" : "type-5540",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/stdlib.h",
   "unique_id" : "lldiv_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-2097",
   "self_type" : "type-2097",
   "size" : 40,
   "source_file" : "/bionic/libc/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "type-5537",
   "self_type" : "type-5537",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/malloc.h",
   "unique_id" : "mallinfo"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    }
   ],
   "linker_set_key" : "max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 16,
   "source_file" : "/prebuilts/clang-tools/linux-x86/lib64/clang/9.0.4/include/__stddef_max_align_t.h",
   "unique_id" : "_ZTS11max_align_t"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "type-3473"
    }
   ],
   "linker_set_key" : "mbstate_t",
   "name" : "mbstate_t",
   "referenced_type" : "type-3472",
   "self_type" : "type-3472",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/mbstate_t.h",
   "unique_id" : "_ZTS9mbstate_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_hdr",
     "referenced_type" : "type-3725"
    },
    {
     "field_name" : "msg_len",
     "field_offset" : 224,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "mmsghdr",
   "name" : "mmsghdr",
   "referenced_type" : "type-3727",
   "self_type" : "type-3727",
   "size" : 32,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "mmsghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "msg_name",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "msg_namelen",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "msg_iov",
     "field_offset" : 64,
     "referenced_type" : "type-3726"
    },
    {
     "field_name" : "msg_iovlen",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "msg_control",
     "field_offset" : 128,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "msg_controllen",
     "field_offset" : 160,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "msg_flags",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "msghdr",
   "name" : "msghdr",
   "referenced_type" : "type-3725",
   "self_type" : "type-3725",
   "size" : 28,
   "source_file" : "/bionic/libc/include/sys/socket.h",
   "unique_id" : "msghdr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-3458",
   "self_type" : "type-3458",
   "size" : 24,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-5496",
   "self_type" : "type-5496",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "type-5608",
   "self_type" : "type-5608",
   "size" : 24,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_attr_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-3090"
    }
   ],
   "linker_set_key" : "pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "type-5706",
   "self_type" : "type-5706",
   "size" : 32,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS17pthread_barrier_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-3403",
   "self_type" : "type-3403",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-5511",
   "self_type" : "type-5511",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS14pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "type-5609",
   "self_type" : "type-5609",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_cond_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-2009",
   "self_type" : "type-2009",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-5532",
   "self_type" : "type-5532",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS15pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-2010"
    }
   ],
   "linker_set_key" : "pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "type-5611",
   "self_type" : "type-5611",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_mutex_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-523",
   "self_type" : "type-523",
   "size" : 40,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-5513",
   "self_type" : "type-5513",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "_ZTS16pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-524"
    }
   ],
   "linker_set_key" : "pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "type-5612",
   "self_type" : "type-5612",
   "size" : 40,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/pthread_types.h",
   "unique_id" : "pthread_rwlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "type-756"
    }
   ],
   "linker_set_key" : "pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "type-755",
   "self_type" : "type-755",
   "size" : 8,
   "source_file" : "/bionic/libc/include/bits/pthread_types.h",
   "unique_id" : "_ZTS18pthread_spinlock_t"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r_version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "r_map",
     "field_offset" : 32,
     "referenced_type" : "type-5426"
    },
    {
     "field_name" : "r_brk",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "r_state",
     "field_offset" : 96,
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "r_ldbase",
     "field_offset" : 128,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "r_debug",
   "name" : "r_debug",
   "referenced_type" : "type-5428",
   "self_type" : "type-5428",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/link.h",
   "unique_id" : "r_debug"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-3395",
   "self_type" : "type-3395",
   "size" : 4,
   "source_file" : "/bionic/libc/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "sched_param",
   "name" : "sched_param",
   "referenced_type" : "type-5445",
   "self_type" : "type-5445",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/sched.h",
   "unique_id" : "sched_param"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-5277"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-5276",
   "self_type" : "type-5276",
   "size" : 16,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-5487"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 32,
     "referenced_type" : "type-658"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 96,
     "referenced_type" : "type-654"
    }
   ],
   "linker_set_key" : "sigaction",
   "name" : "sigaction",
   "referenced_type" : "type-5486",
   "self_type" : "type-5486",
   "size" : 16,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS9sigaction"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-5489"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-654"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-5485"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-5488",
   "self_type" : "type-5488",
   "size" : 20,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-653"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 64,
     "referenced_type" : "type-654"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 96,
     "referenced_type" : "type-656"
    }
   ],
   "linker_set_key" : "sigaction64",
   "name" : "sigaction64",
   "referenced_type" : "type-652",
   "self_type" : "type-652",
   "size" : 20,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTS11sigaction64"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at bionic/libc/include/bits/signal_types.h:116:3) at bionic/libc/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-653",
   "self_type" : "type-653",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "name" : "sigaction64::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:116:3",
   "record_kind" : "union",
   "referenced_type" : "type-5489",
   "self_type" : "type-5489",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN11sigaction64Ut_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at bionic/libc/include/bits/signal_types.h:105:3) at bionic/libc/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-5277",
   "self_type" : "type-5277",
   "size" : 4,
   "source_file" : "/bionic/libc/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "type-4"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "type-415"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "name" : "sigaction::(anonymous union at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3) at out/soong/ndk/sysroot/usr/include/bits/signal_types.h:105:3",
   "record_kind" : "union",
   "referenced_type" : "type-5487",
   "self_type" : "type-5487",
   "size" : 4,
   "source_file" : "/out/soong/ndk/sysroot/usr/include/bits/signal_types.h",
   "unique_id" : "_ZTSN9sigactionUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
    }
   ],
   "linker_set_key" : "sigaltstack",
   "name" : "sigaltstack",
   "referenced_type" : "type-3752",
   "self_type" : "type-3752",
   "size" : 12,
   "source_file" : "/bionic/libc/kernel/uapi/asm-arm/asm/signal.h",
   "unique_id" : "_ZTS11sigaltstack"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "type-226"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 64,
     "referenced_type" : "type-11"
