{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "type-6",
   "self_type" : "type-6",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 8
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIe",
   "name" : "long double",
   "referenced_type" : "type-58",
   "self_type" : "type-58",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "type-9",
   "self_type" : "type-9",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "type-2",
   "self_type" : "type-2",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",

   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-43",
   "self_type" : "type-42",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-64",
   "self_type" : "type-63",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-79",
   "self_type" : "type-78",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "const std::basic_string<char, std::char_traits<char>, std::allocator<char> >",
   "referenced_type" : "type-94",
   "self_type" : "type-93",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-107",
   "self_type" : "type-106",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-125",
   "self_type" : "type-124",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-140",
   "self_type" : "type-139",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-29",
   "self_type" : "type-28",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-50",
   "self_type" : "type-49",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__14pairIxxEE",
   "name" : "const std::pair<long long, long long>",
   "referenced_type" : "type-72",
   "self_type" : "type-71",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKc",
   "name" : "const char *const",
   "referenced_type" : "type-39",
   "self_type" : "type-38",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPc",
   "name" : "char *const",
   "referenced_type" : "type-5",
   "self_type" : "type-31",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "type-6",
   "self_type" : "type-40",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "type-11",
   "self_type" : "type-136",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "type-9",
   "self_type" : "type-128",
   "size" : 4,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "type-10",
   "self_type" : "type-134",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "int32Value",
     "referenced_type" : "type-9"
    },
    {
     "field_name" : "int64Value",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "doubleValue",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "CStringValue",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "rate",
     "referenced_type" : "type-12"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem4Prop3u__E",
   "name" : "android::MediaAnalyticsItem::Prop::u__",
   "record_kind" : "union",
   "referenced_type" : "type-8",
   "self_type" : "type-8",
   "size" : 16,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mName",
     "referenced_type" : "type-5"
    },
    {
     "field_name" : "mType",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "u",
     "field_offset" : 64,
     "referenced_type" : "type-8"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem4PropE",
   "name" : "android::MediaAnalyticsItem::Prop",
   "record_kind" : "class",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem6none_tE",
   "name" : "android::MediaAnalyticsItem::none_t",
   "referenced_type" : "type-34",
   "self_type" : "type-34",
   "size" : 1,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "i",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "item",
     "field_offset" : 32,
     "referenced_type" : "type-70"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItem8iteratorE",
   "name" : "android::MediaAnalyticsItem::iterator",
   "record_kind" : "class",
   "referenced_type" : "type-145",
   "self_type" : "type-145",
   "size" : 8,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mPropCount",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mPropSize",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mProps",
     "field_offset" : 64,
     "referenced_type" : "type-3"
    },
    {
     "access" : "private",
     "field_name" : "mPid",
     "field_offset" : 96,
     "referenced_type" : "type-9"
    },
    {
     "access" : "private",
     "field_name" : "mUid",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mPkgName",
     "field_offset" : 160,
     "referenced_type" : "type-13"
    },
    {
     "access" : "private",
     "field_name" : "mPkgVersionCode",
     "field_offset" : 256,
     "referenced_type" : "type-10"
    },
    {
     "access" : "private",
     "field_name" : "mKey",
     "field_offset" : 320,
     "referenced_type" : "type-14"
    },
    {
     "access" : "private",
     "field_name" : "mTimestamp",
     "field_offset" : 448,
     "referenced_type" : "type-10"
    }
   ],
   "linker_set_key" : "_ZTIN7android18MediaAnalyticsItemE",
   "name" : "android::MediaAnalyticsItem",
   "record_kind" : "class",
   "referenced_type" : "type-1",
   "self_type" : "type-1",
   "size" : 64,
   "source_file" : "/frameworks/av/media/libmediametrics/include/MediaAnalyticsItem.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-151"
    }
   ],
   "linker_set_key" : "_ZTIN7android22IMediaAnalyticsServiceE",
   "name" : "android::IMediaAnalyticsService",
   "record_kind" : "class",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 12,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android10IInterface10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android22IMediaAnalyticsService22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService6submitEPNS_18MediaAnalyticsItemE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android22IMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android22IMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-165"
    }
   ],
   "linker_set_key" : "_ZTIN7android23BnMediaAnalyticsServiceE",
   "name" : "android::BnMediaAnalyticsService",
   "record_kind" : "class",
   "referenced_type" : "type-164",
   "self_type" : "type-164",
   "size" : 24,
   "source_file" : "/frameworks/av/media/libmediametrics/include/IMediaAnalyticsService.h",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android23BnMediaAnalyticsServiceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnMediaAnalyticsServiceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android23BnMediaAnalyticsServiceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11BnInterfaceINS_22IMediaAnalyticsServiceEE10onAsBinderEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11BnInterfaceINS_22IMediaAnalyticsServiceEE22getInterfaceDescriptorEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android22IMediaAnalyticsService6submitEPNS_18MediaAnalyticsItemE"
    },
