{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int[10]",
   "referenced_type" : "_ZTIi",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA11_Ds",
   "name" : "char16_t[11]",
   "referenced_type" : "_ZTIDs",
   "size" : 22,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char[120]",
   "referenced_type" : "_ZTIc",
   "size" : 120,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA12_i",
   "name" : "int[12]",
   "referenced_type" : "_ZTIi",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA14_i",
   "name" : "int[14]",
   "referenced_type" : "_ZTIi",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_c",
   "name" : "char[16]",
   "referenced_type" : "_ZTIc",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA16_m",
   "name" : "unsigned long[16]",
   "referenced_type" : "_ZTIm",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA1_m",

   "referenced_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt13exception_ptr",
   "name" : "const std::exception_ptr",
   "referenced_type" : "_ZTISt13exception_ptr",
   "size" : 8,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt16nested_exception",
   "name" : "const std::nested_exception",
   "referenced_type" : "_ZTISt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "bionic/libc/include/signal.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "size" : 8,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "size" : 8,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKn",
   "name" : "const __int128",
   "referenced_type" : "_ZTIn",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "bionic/libc/include/string.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI10za_context",
   "name" : "za_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "nregs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI10zt_context",
   "name" : "zt_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flags",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA2_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "tpidr2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI14tpidr2_context",
   "name" : "tpidr2_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "size" : 272,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "size" : 528,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "instance_",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI24AsynchronousCloseMonitor",
   "name" : "AsynchronousCloseMonitor",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "libcore/luni/src/main/native/AsynchronousCloseMonitor.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "size" : 56,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/timespec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "size" : 4560,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "size" : 128,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI9mallinfo2",
   "name" : "mallinfo2",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(unnamed)",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(unnamed)",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(unnamed)",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_trapno",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    },
    {
     "field_name" : "_perf",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_data",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous)",
   "record_kind" : "union",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous)::(anonymous)",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(unnamed)",
   "record_kind" : "union",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(unnamed)::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl2629746ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl31556952ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<31556952, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl3600ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl3600ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl60ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl60ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl86400ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<86400, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl86400ELl1EEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDuEE",
   "name" : "std::is_trivial<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__m_",
     "referenced_type" : "_ZTIRNSt3__15mutexE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110lock_guardINS_5mutexEEE",
   "name" : "std::lock_guard<std::mutex>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/__mutex_base",
   "template_args" :
   [
    "_ZTINSt3__15mutexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000EEE",
    "_ZTINSt3__15ratioILl1ELl1000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl2629746ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<2629746, 1>, std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl2629746ELl1EEE",
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl31556952ELl1EEENS1_ILl2629746ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<31556952, 1>, std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl31556952ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<31556952, 1>, std::ratio<31556952, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl31556952ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl3600ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl3600ELl1EEE",
    "_ZTINSt3__15ratioILl3600ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl60ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl60ELl1EEE",
    "_ZTINSt3__15ratioILl60ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl86400ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<86400, 1>, std::ratio<86400, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl86400ELl1EEE",
    "_ZTINSt3__15ratioILl86400ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDiEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDsEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDuEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char8_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDuEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIcEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIwEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::add_pointer<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerINS_4pairImmEEEE",
   "name" : "std::add_pointer<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIeEE",
   "name" : "std::add_pointer<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIiEE",
   "name" : "std::add_pointer<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIlEE",
   "name" : "std::add_pointer<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerInEE",
   "name" : "std::add_pointer<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIxEE",
   "name" : "std::add_pointer<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__a_",
     "referenced_type" : "_ZTIU7_Atomicb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111atomic_flagE",
   "name" : "std::atomic_flag",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDiEE",
   "name" : "std::char_traits<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDsEE",
   "name" : "std::char_traits<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIDuEE",
   "name" : "std::char_traits<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIcEE",
   "name" : "std::char_traits<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111char_traitsIwEE",
   "name" : "std::char_traits<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__string",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000000>>, duration<long double, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000000>>, duration<long double, ratio<1, 1000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<1, 1000>>, duration<long double, ratio<1, 1000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long double>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl1ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double>, duration<long double>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl3600ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl3600ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<3600>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl3600ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<3600>>, duration<long double, ratio<3600>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl60ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl60ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long double, ratio<60>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIeNS_5ratioILl60ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long double, ratio<60>>, duration<long double, ratio<60>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl2629746ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl2629746ELl1EEEEEEEE",
   "name" : "std::common_type<duration<int, ratio<2629746>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl2629746ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<int, ratio<2629746>>, duration<int, ratio<2629746>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEEEEE",
   "name" : "std::common_type<duration<int, ratio<31556952>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEENS2_IiNS3_ILl2629746ELl1EEEEEEEE",
   "name" : "std::common_type<duration<int, ratio<31556952>>, duration<int, ratio<2629746>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<int, ratio<31556952>>, duration<int, ratio<31556952>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl86400ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl86400ELl1EEEEEEEE",
   "name" : "std::common_type<duration<int, ratio<86400>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIiNS_5ratioILl86400ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<int, ratio<86400>>, duration<int, ratio<86400>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl3600ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl3600ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<3600>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl3600ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<3600>>, duration<long, ratio<3600>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl60ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl60ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long, ratio<60>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIlNS_5ratioILl60ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long, ratio<60>>, duration<long, ratio<60>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1000000000EEEEEEEE",
   "name" : "std::common_type<duration<__int128, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<__int128, ratio<1, 1000000000>>, duration<__int128, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1EEEEEEEE",
   "name" : "std::common_type<duration<__int128>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationInNS_5ratioILl1ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<__int128>, duration<__int128>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEENS2_IxNS3_ILl1ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>, duration<long long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000000>>, duration<long long, ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000000>>, duration<long long, ratio<1, 1000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000EEEEEEEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1000EEEEES5_EEE",
   "name" : "std::common_type<duration<long long, ratio<1, 1000>>, duration<long long, ratio<1, 1000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1EEEEES5_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1EEEEEEEE",
   "name" : "std::common_type<duration<long long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111common_typeIJNS_6chrono8durationIxNS_5ratioILl1ELl1EEEEES5_EEE",
   "name" : "std::common_type<duration<long long>, duration<long long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIeevEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJeeEEE",
   "name" : "std::common_type<long double, long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIiivEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJiiEEE",
   "name" : "std::common_type<int, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type_implINS_14__common_typesIJiilEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJiilEEE",
   "name" : "std::common_type<int, int, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIilvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJilEEE",
   "name" : "std::common_type<int, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIllvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJllEEE",
   "name" : "std::common_type<long, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impInlvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJnlEEE",
   "name" : "std::common_type<__int128, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impInnvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJnnEEE",
   "name" : "std::common_type<__int128, __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type_implINS_14__common_typesIJnnlEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJnnlEEE",
   "name" : "std::common_type<__int128, __int128, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIxlvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxlEEE",
   "name" : "std::common_type<long long, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type2_impIxxvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxEEE",
   "name" : "std::common_type<long long, long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__118__common_type_implINS_14__common_typesIJxxlEEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111common_typeIJxxlEEE",
   "name" : "std::common_type<long long, long long, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDiE5__natEDiEE",
   "name" : "std::conditional<false, std::pointer_traits<char32_t *>::__nat, char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDiE5__natE",
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDsE5__natEDsEE",
   "name" : "std::conditional<false, std::pointer_traits<char16_t *>::__nat, char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDsE5__natE",
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPDuE5__natEDuEE",
   "name" : "std::conditional<false, std::pointer_traits<char8_t *>::__nat, char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPDuE5__natE",
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPcE5__natEcEE",
   "name" : "std::conditional<false, std::pointer_traits<char *>::__nat, char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPcE5__natE",
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_14pointer_traitsIPwE5__natEwEE",
   "name" : "std::conditional<false, std::pointer_traits<wchar_t *>::__nat, wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114pointer_traitsIPwE5__natE",
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0ENS_4pairImmE26_CheckTupleLikeConstructorENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long>::_CheckTupleLikeConstructor, std::__check_tuple_constructor_fail>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE26_CheckTupleLikeConstructorE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEES9_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false> *, std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<char>, 1, true> *, std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEES4_EE",
   "name" : "std::conditional<false, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true> *, std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE",
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPNS_4pairImmEES2_EE",
   "name" : "std::conditional<false, std::pair<unsigned long, unsigned long> *, std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__14pairImmEE",
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPeeEE",
   "name" : "std::conditional<false, long double *, long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPe",
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPiiEE",
   "name" : "std::conditional<false, int *, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPllEE",
   "name" : "std::conditional<false, long *, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPl",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPnnEE",
   "name" : "std::conditional<false, __int128 *, __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPn",
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb0EPxxEE",
   "name" : "std::conditional<false, long long *, long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPx",
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIeevEENS_11common_typeIJeeEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long double, long double, void>, std::common_type<long double, long double>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIeevEE",
    "_ZTINSt3__111common_typeIJeeEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIiivEENS_11common_typeIJiiEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<int, int, void>, std::common_type<int, int>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIiivEE",
    "_ZTINSt3__111common_typeIJiiEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIilvEENS_11common_typeIJilEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<int, long, void>, std::common_type<int, long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIilvEE",
    "_ZTINSt3__111common_typeIJilEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIllvEENS_11common_typeIJllEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long, long, void>, std::common_type<long, long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIllvEE",
    "_ZTINSt3__111common_typeIJllEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impInlvEENS_11common_typeIJnlEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<__int128, long, void>, std::common_type<__int128, long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impInlvEE",
    "_ZTINSt3__111common_typeIJnlEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impInnvEENS_11common_typeIJnnEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<__int128, __int128, void>, std::common_type<__int128, __int128>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impInnvEE",
    "_ZTINSt3__111common_typeIJnnEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxlvEENS_11common_typeIJxlEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long long, long, void>, std::common_type<long long, long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIxlvEE",
    "_ZTINSt3__111common_typeIJxlEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_18__common_type2_impIxxvEENS_11common_typeIJxxEEEEE",
   "name" : "std::conditional<true, std::__common_type2_imp<long long, long long, void>, std::common_type<long long, long long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__118__common_type2_impIxxvEE",
    "_ZTINSt3__111common_typeIJxxEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmE10_CheckArgsENS_30__check_tuple_constructor_failEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>::_CheckArgs, std::__check_tuple_constructor_fail>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmE10_CheckArgsE",
    "_ZTINSt3__130__check_tuple_constructor_failE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111conditionalILb1ENS_4pairImmEENS_5__natEEE",
   "name" : "std::conditional<true, std::pair<unsigned long, unsigned long>, std::__nat>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE",
    "_ZTINSt3__15__natE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIDuNS_11char_traitsIDuEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char8_t, std::char_traits<char8_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117basic_string_viewIDuNS_11char_traitsIDuEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<char, std::char_traits<char>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_abstract<std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractINS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEEEE",
   "name" : "std::is_abstract<std::chrono::duration<long double, std::ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIeNS_5ratioILl1ELl1000000000EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDiEE",
   "name" : "std::is_abstract<const char32_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDsEE",
   "name" : "std::is_abstract<const char16_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKDuEE",
   "name" : "std::is_abstract<const char8_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKDu"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKcEE",
   "name" : "std::is_abstract<const char *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIPKwEE",
   "name" : "std::is_abstract<const wchar_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPKw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIeEE",
   "name" : "std::is_abstract<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIiEE",
   "name" : "std::is_abstract<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIlEE",
   "name" : "std::is_abstract<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractImEE",
   "name" : "std::is_abstract<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractInEE",
   "name" : "std::is_abstract<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_abstractIxEE",
   "name" : "std::is_abstract<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_function<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionINS_4pairImmEELb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionINS_4pairImmEEEE",
   "name" : "std::is_function<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIeLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIeEE",
   "name" : "std::is_function<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIiLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIiEE",
   "name" : "std::is_function<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIlLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIlEE",
   "name" : "std::is_function<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionImLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionImEE",
   "name" : "std::is_function<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionInLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionInEE",
   "name" : "std::is_function<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_functionIxLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_functionIxEE",
   "name" : "std::is_function<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIiEE",
   "name" : "std::is_integral<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIjEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIjEE",
   "name" : "std::is_integral<unsigned int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIlEE",
   "name" : "std::is_integral<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralImEE",
   "name" : "std::is_integral<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__120__libcpp_is_integralIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111is_integralIxEE",
   "name" : "std::is_integral<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_andIvEE",
   "name" : "std::logical_and<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111logical_notIvEE",
   "name" : "std::logical_not<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111scoped_lockIJEEE",
   "name" : "std::scoped_lock<>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/mutex"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__m_",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "__cv_",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "access" : "private",
     "field_name" : "__locked_",
     "field_offset" : 704,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111timed_mutexE",
   "name" : "std::timed_mutex",
   "record_kind" : "class",
   "size" : 92,
   "source_file" : "external/libcxx/include/mutex"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__m_",
     "referenced_type" : "_ZTIPNSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "__owns_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111unique_lockINS_5mutexEEE",
   "name" : "std::unique_lock<std::mutex>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/__mutex_base",
   "template_args" :
   [
    "_ZTINSt3__15mutexE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_15__struct_doubleEEE",
   "name" : "std::__align_type<std::__struct_double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__115__struct_doubleE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeINS_16__struct_double4EEE",
   "name" : "std::__align_type<std::__struct_double4>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__116__struct_double4E"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIPiEE",
   "name" : "std::__align_type<int *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIdEE",
   "name" : "std::__align_type<double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIeEE",
   "name" : "std::__align_type<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIhEE",
   "name" : "std::__align_type<unsigned char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIjEE",
   "name" : "std::__align_type<unsigned int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeImEE",
   "name" : "std::__align_type<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeItEE",
   "name" : "std::__align_type<unsigned short>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__align_typeIyEE",
   "name" : "std::__align_type<unsigned long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__size_",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__destruct_nE",
   "name" : "std::__destruct_n",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__do_messageE",
   "name" : "std::__do_message",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112__do_messageE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112__do_messageD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112__do_message7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__second_tagE",
   "name" : "std::__second_tag",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__select_2ndIRmNS_17integral_constantIbLb1EEEEE",
   "name" : "std::__select_2nd<unsigned long &, std::integral_constant<bool, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRm",
    "_ZTINSt3__117integral_constantIbLb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl1000000000EEE",
   "name" : "std::__static_abs<1000000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl1000000EEE",
   "name" : "std::__static_abs<1000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl1000EEE",
   "name" : "std::__static_abs<1000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl12EEE",
   "name" : "std::__static_abs<12>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl146097EEE",
   "name" : "std::__static_abs<146097>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl1600EEE",
   "name" : "std::__static_abs<1600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl1EEE",
   "name" : "std::__static_abs<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl216EEE",
   "name" : "std::__static_abs<216>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl24EEE",
   "name" : "std::__static_abs<24>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl2629746EEE",
   "name" : "std::__static_abs<2629746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl31556952EEE",
   "name" : "std::__static_abs<31556952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl3600EEE",
   "name" : "std::__static_abs<3600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl400EEE",
   "name" : "std::__static_abs<400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl48699EEE",
   "name" : "std::__static_abs<48699>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl604800EEE",
   "name" : "std::__static_abs<604800>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl60EEE",
   "name" : "std::__static_abs<60>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl7EEE",
   "name" : "std::__static_abs<7>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_absILl86400EEE",
   "name" : "std::__static_abs<86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl0ELl0EEE",
   "name" : "std::__static_gcd<0, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000000ELl0EEE",
   "name" : "std::__static_gcd<1000000000, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000000ELl1000000000EEE",
   "name" : "std::__static_gcd<1000000000, 1000000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000000ELl1EEE",
   "name" : "std::__static_gcd<1000000000, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000ELl0EEE",
   "name" : "std::__static_gcd<1000000, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000ELl1000000EEE",
   "name" : "std::__static_gcd<1000000, 1000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000000ELl1EEE",
   "name" : "std::__static_gcd<1000000, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000ELl0EEE",
   "name" : "std::__static_gcd<1000, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000ELl1000EEE",
   "name" : "std::__static_gcd<1000, 1000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1000ELl1EEE",
   "name" : "std::__static_gcd<1000, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl10908ELl5022EEE",
   "name" : "std::__static_gcd<10908, 5022>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl12ELl0EEE",
   "name" : "std::__static_gcd<12, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl12ELl1EEE",
   "name" : "std::__static_gcd<12, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl13ELl3EEE",
   "name" : "std::__static_gcd<13, 3>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl146097ELl1EEE",
   "name" : "std::__static_gcd<146097, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl146097ELl400EEE",
   "name" : "std::__static_gcd<146097, 400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1600ELl48699EEE",
   "name" : "std::__static_gcd<1600, 48699>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1600ELl699EEE",
   "name" : "std::__static_gcd<1600, 699>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl162ELl54EEE",
   "name" : "std::__static_gcd<162, 54>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl16ELl13EEE",
   "name" : "std::__static_gcd<16, 13>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl0EEE",
   "name" : "std::__static_gcd<1, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl1000000000EEE",
   "name" : "std::__static_gcd<1, 1000000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl1000000EEE",
   "name" : "std::__static_gcd<1, 1000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl1000EEE",
   "name" : "std::__static_gcd<1, 1000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl12EEE",
   "name" : "std::__static_gcd<1, 12>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl1EEE",
   "name" : "std::__static_gcd<1, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl3600EEE",
   "name" : "std::__static_gcd<1, 3600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl1ELl86400EEE",
   "name" : "std::__static_gcd<1, 86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl202ELl93EEE",
   "name" : "std::__static_gcd<202, 93>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl20952ELl2592EEE",
   "name" : "std::__static_gcd<20952, 2592>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl216ELl0EEE",
   "name" : "std::__static_gcd<216, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl24ELl1EEE",
   "name" : "std::__static_gcd<24, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2592ELl216EEE",
   "name" : "std::__static_gcd<2592, 216>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2629746ELl0EEE",
   "name" : "std::__static_gcd<2629746, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2629746ELl1EEE",
   "name" : "std::__static_gcd<2629746, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2629746ELl2629746EEE",
   "name" : "std::__static_gcd<2629746, 2629746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2629746ELl31556952EEE",
   "name" : "std::__static_gcd<2629746, 31556952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl2629746ELl86400EEE",
   "name" : "std::__static_gcd<2629746, 86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl0EEE",
   "name" : "std::__static_gcd<31556952, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl12EEE",
   "name" : "std::__static_gcd<31556952, 12>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl1EEE",
   "name" : "std::__static_gcd<31556952, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl2629746EEE",
   "name" : "std::__static_gcd<31556952, 2629746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl31556952EEE",
   "name" : "std::__static_gcd<31556952, 31556952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl31556952ELl86400EEE",
   "name" : "std::__static_gcd<31556952, 86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl3600ELl0EEE",
   "name" : "std::__static_gcd<3600, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl3600ELl1EEE",
   "name" : "std::__static_gcd<3600, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl3600ELl3600EEE",
   "name" : "std::__static_gcd<3600, 3600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl37746ELl10908EEE",
   "name" : "std::__static_gcd<37746, 10908>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl3ELl1EEE",
   "name" : "std::__static_gcd<3, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl400ELl0EEE",
   "name" : "std::__static_gcd<400, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl400ELl146097EEE",
   "name" : "std::__static_gcd<400, 146097>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl400ELl86400EEE",
   "name" : "std::__static_gcd<400, 86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl400ELl97EEE",
   "name" : "std::__static_gcd<400, 97>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl48699ELl1600EEE",
   "name" : "std::__static_gcd<48699, 1600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl5022ELl864EEE",
   "name" : "std::__static_gcd<5022, 864>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl54ELl0EEE",
   "name" : "std::__static_gcd<54, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl604800ELl1EEE",
   "name" : "std::__static_gcd<604800, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl60ELl0EEE",
   "name" : "std::__static_gcd<60, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl60ELl1EEE",
   "name" : "std::__static_gcd<60, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl60ELl60EEE",
   "name" : "std::__static_gcd<60, 60>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl699ELl202EEE",
   "name" : "std::__static_gcd<699, 202>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl702ELl162EEE",
   "name" : "std::__static_gcd<702, 162>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl7ELl1EEE",
   "name" : "std::__static_gcd<7, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl0EEE",
   "name" : "std::__static_gcd<86400, 0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl1EEE",
   "name" : "std::__static_gcd<86400, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl20952EEE",
   "name" : "std::__static_gcd<86400, 20952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl2629746EEE",
   "name" : "std::__static_gcd<86400, 2629746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl31556952EEE",
   "name" : "std::__static_gcd<86400, 31556952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl37746EEE",
   "name" : "std::__static_gcd<86400, 37746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl400EEE",
   "name" : "std::__static_gcd<86400, 400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl86400ELl86400EEE",
   "name" : "std::__static_gcd<86400, 86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl864ELl702EEE",
   "name" : "std::__static_gcd<864, 702>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl93ELl16EEE",
   "name" : "std::__static_gcd<93, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_gcdILl97ELl12EEE",
   "name" : "std::__static_gcd<97, 12>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_lcmILl1000000000ELl1000000000EEE",
   "name" : "std::__static_lcm<1000000000, 1000000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_lcmILl1000000000ELl1EEE",
   "name" : "std::__static_lcm<1000000000, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_lcmILl1000000ELl1000000EEE",
   "name" : "std::__static_lcm<1000000, 1000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_lcmILl1000ELl1000EEE",
   "name" : "std::__static_lcm<1000, 1000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__static_lcmILl1ELl1EEE",
   "name" : "std::__static_lcm<1, 1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112__tuple_lessILm0EEE",
   "name" : "std::__tuple_less<0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112__tuple_likeINS_4pairImmEEEE",
   "name" : "std::__tuple_like<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112adopt_lock_tE",
   "name" : "std::adopt_lock_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/__mutex_base"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_15__struct_doubleEEE",
   "name" : "std::alignment_of<std::__struct_double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__115__struct_doubleE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofINS_16__struct_double4EEE",
   "name" : "std::alignment_of<std::__struct_double4>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__116__struct_double4E"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIPiEE",
   "name" : "std::alignment_of<int *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIdEE",
   "name" : "std::alignment_of<double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm16EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIeEE",
   "name" : "std::alignment_of<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIhEE",
   "name" : "std::alignment_of<unsigned char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm4EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIjEE",
   "name" : "std::alignment_of<unsigned int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofImEE",
   "name" : "std::alignment_of<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofItEE",
   "name" : "std::alignment_of<unsigned short>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm8EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112alignment_ofIyEE",
   "name" : "std::alignment_of<unsigned long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt9exception"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112bad_weak_ptrE",
   "name" : "std::bad_weak_ptr",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112bad_weak_ptrE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112bad_weak_ptrD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt3__112bad_weak_ptr4whatEv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__raw",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repUt_E",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__ulxE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__ulx",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPDi"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE6__longE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__long",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_Di"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__short",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE7__shortUt_E",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__short::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEEE",
   "name" : "std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTINSt3__111char_traitsIDiEE",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__raw",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repUt_E",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__ulxE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__ulx",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPDs"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE6__longE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__long",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 2,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 16,
     "referenced_type" : "_ZTIA11_Ds"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__short",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDs"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE7__shortUt_E",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__short::(anonymous)",
   "record_kind" : "union",
   "size" : 2,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEEE",
   "name" : "std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDs",
    "_ZTINSt3__111char_traitsIDsEE",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__rawE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__raw",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repUt_E",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__ulxE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__ulx",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPDu"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE6__longE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__long",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA23_Du"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE7__shortE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__short",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIDu"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE7__shortUt_E",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__short::(anonymous)",
   "record_kind" : "union",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEEE",
   "name" : "std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIDu",
    "_ZTINSt3__111char_traitsIDuEE",
    "_ZTINSt3__19allocatorIDuEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__raw",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repUt_E",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__ulxE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__ulx",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6__longE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__long",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 1,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 8,
     "referenced_type" : "_ZTIA23_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__short",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIc"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7__shortUt_E",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__short::(anonymous)",
   "record_kind" : "union",
   "size" : 1,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__111char_traitsIcEE",
    "_ZTINSt3__19allocatorIcEE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__words",
     "referenced_type" : "_ZTIA3_m"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__raw",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__l",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__s",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    },
    {
     "field_name" : "__r",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__rawE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repUt_E",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE"
    },
    {
     "field_name" : "__lxx",
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__ulxE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__ulx",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cap_",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__size_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPw"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE6__longE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__long",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E"
    },
    {
     "field_name" : "__data_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA5_w"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__short",
   "size" : 24,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__size_",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "__lx",
     "referenced_type" : "_ZTIw"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE7__shortUt_E",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__short::(anonymous)",
   "record_kind" : "union",
   "size" : 4,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__121__basic_string_commonILb1EEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__r_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repES5_EE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEEE",
   "name" : "std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/string",
   "template_args" :
   [
    "_ZTIw",
    "_ZTINSt3__111char_traitsIwEE",
    "_ZTINSt3__19allocatorIwEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112defer_lock_tE",
   "name" : "std::defer_lock_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/__mutex_base"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::is_reference<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_4pairImmEEEE",
   "name" : "std::is_reference<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceINS_5mutexEEE",
   "name" : "std::is_reference<std::mutex>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__15mutexE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIeEE",
   "name" : "std::is_reference<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIiEE",
   "name" : "std::is_reference<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIlEE",
   "name" : "std::is_reference<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceImEE",
   "name" : "std::is_reference<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceInEE",
   "name" : "std::is_reference<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112is_referenceIxEE",
   "name" : "std::is_reference<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112not_equal_toIvEE",
   "name" : "std::not_equal_to<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi10EEE",
   "name" : "std::placeholders::__ph<10>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi1EEE",
   "name" : "std::placeholders::__ph<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi2EEE",
   "name" : "std::placeholders::__ph<2>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi3EEE",
   "name" : "std::placeholders::__ph<3>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi4EEE",
   "name" : "std::placeholders::__ph<4>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi5EEE",
   "name" : "std::placeholders::__ph<5>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi6EEE",
   "name" : "std::placeholders::__ph<6>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi7EEE",
   "name" : "std::placeholders::__ph<7>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi8EEE",
   "name" : "std::placeholders::__ph<8>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112placeholders4__phILi9EEE",
   "name" : "std::placeholders::__ph<9>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDiEE",
   "name" : "std::remove_const<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDsEE",
   "name" : "std::remove_const<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIDuEE",
   "name" : "std::remove_const<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_const<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_4pairImmEEEE",
   "name" : "std::remove_const<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<long double, std::ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIeNS_5ratioILl1ELl1000000000EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIiNS_5ratioILl2629746ELl1EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<int, std::ratio<2629746, 1>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl2629746ELl1EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<int, std::ratio<31556952, 1>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl31556952ELl1EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIiNS_5ratioILl86400ELl1EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<int, std::ratio<86400, 1>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl86400ELl1EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationInNS_5ratioILl1ELl1000000000EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<__int128, std::ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationInNS_5ratioILl1ELl1000000000EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<long long, std::ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1000000000EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constINS_6chrono8durationIxNS_5ratioILl1ELl1EEEEEEE",
   "name" : "std::remove_const<std::chrono::duration<long long, std::ratio<1, 1>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIOmEE",
   "name" : "std::remove_const<unsigned long &&>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIOm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRKmEE",
   "name" : "std::remove_const<const unsigned long &>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIRmEE",
   "name" : "std::remove_const<unsigned long &>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIcEE",
   "name" : "std::remove_const<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIeEE",
   "name" : "std::remove_const<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIiEE",
   "name" : "std::remove_const<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIjEE",
   "name" : "std::remove_const<unsigned int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIlEE",
   "name" : "std::remove_const<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constImEE",
   "name" : "std::remove_const<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constInEE",
   "name" : "std::remove_const<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIwEE",
   "name" : "std::remove_const<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__112remove_constIxEE",
   "name" : "std::remove_const<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTISt13runtime_error"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ec_",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__110error_codeE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__112system_errorE",
   "name" : "std::system_error",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__112system_errorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112system_errorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__112system_errorD0Ev"
    },
    {
     "mangled_component_name" : "_ZNKSt13runtime_error4whatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<false, false, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<false, false, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<false, true, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb0ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<false, true, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb0EEE",
   "name" : "std::__apply_cv_mf<true, false, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb0ELb1EEE",
   "name" : "std::__apply_cv_mf<true, false, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb0EEE",
   "name" : "std::__apply_cv_mf<true, true, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__apply_cv_mfILb1ELb1ELb1EEE",
   "name" : "std::__apply_cv_mf<true, true, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIbLb1EEE",
   "name" : "std::__make_signed<bool, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIiLb1EEE",
   "name" : "std::__make_signed<int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIjLb1EEE",
   "name" : "std::__make_signed<unsigned int, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIlLb1EEE",
   "name" : "std::__make_signed<long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedImLb1EEE",
   "name" : "std::__make_signed<unsigned long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedInLb1EEE",
   "name" : "std::__make_signed<__int128_t, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIoLb1EEE",
   "name" : "std::__make_signed<__uint128_t, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIsLb1EEE",
   "name" : "std::__make_signed<short, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedItLb1EEE",
   "name" : "std::__make_signed<unsigned short, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIxLb1EEE",
   "name" : "std::__make_signed<long long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__make_signedIyLb1EEE",
   "name" : "std::__make_signed<unsigned long long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionINS_6_PairTEmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashINS_6_PairTELm2EEE",
   "name" : "std::__scalar_hash<std::_PairT, 2>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__16_PairTE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIdmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIdLm1EEE",
   "name" : "std::__scalar_hash<double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIemEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIeLm2EEE",
   "name" : "std::__scalar_hash<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIfmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIfLm0EEE",
   "name" : "std::__scalar_hash<float>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionInmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashInLm2EEE",
   "name" : "std::__scalar_hash<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIomEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIoLm2EEE",
   "name" : "std::__scalar_hash<unsigned __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIo"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIxmEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIxLm1EEE",
   "name" : "std::__scalar_hash<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIymEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113__scalar_hashIyLm1EEE",
   "name" : "std::__scalar_hash<unsigned long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl1000000000EEE",
   "name" : "std::__static_sign<1000000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl1000000EEE",
   "name" : "std::__static_sign<1000000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl1000EEE",
   "name" : "std::__static_sign<1000>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl12EEE",
   "name" : "std::__static_sign<12>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl146097EEE",
   "name" : "std::__static_sign<146097>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl1600EEE",
   "name" : "std::__static_sign<1600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl1EEE",
   "name" : "std::__static_sign<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl24EEE",
   "name" : "std::__static_sign<24>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl2629746EEE",
   "name" : "std::__static_sign<2629746>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl31556952EEE",
   "name" : "std::__static_sign<31556952>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl3600EEE",
   "name" : "std::__static_sign<3600>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl400EEE",
   "name" : "std::__static_sign<400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl48699EEE",
   "name" : "std::__static_sign<48699>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl604800EEE",
   "name" : "std::__static_sign<604800>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl60EEE",
   "name" : "std::__static_sign<60>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl7EEE",
   "name" : "std::__static_sign<7>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__static_signILl86400EEE",
   "name" : "std::__static_sign<86400>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_equalILm0EEE",
   "name" : "std::__tuple_equal<0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113__tuple_typesIJEEE",
   "name" : "std::__tuple_types<>",
   "size" : 1,
   "source_file" : "external/libcxx/include/__tuple"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113greater_equalIvEE",
   "name" : "std::greater_equal<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIiEE",
   "name" : "std::is_arithmetic<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIjEE",
   "name" : "std::is_arithmetic<unsigned int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIlEE",
   "name" : "std::is_arithmetic<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticImEE",
   "name" : "std::is_arithmetic<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_arithmeticIxEE",
   "name" : "std::is_arithmetic<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmOmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmOmEE",
   "name" : "std::is_assignable<unsigned long &, unsigned long &&>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRm",
    "_ZTIOm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_assignable_impIRmRKmLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__113is_assignableIRmRKmEE",
   "name" : "std::is_assignable<unsigned long &, const unsigned long &>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRm",
    "_ZTIRKm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::remove_extent<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentINS_4pairImmEEEE",
   "name" : "std::remove_extent<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIeEE",
   "name" : "std::remove_extent<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIiEE",
   "name" : "std::remove_extent<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIlEE",
   "name" : "std::remove_extent<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentInEE",
   "name" : "std::remove_extent<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113remove_extentIxEE",
   "name" : "std::remove_extent<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__113try_to_lock_tE",
   "name" : "std::try_to_lock_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/__mutex_base"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDiEEEE",
   "name" : "std::__has_max_size<const std::allocator<char32_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIKNSt3__19allocatorIDiEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDsEEEE",
   "name" : "std::__has_max_size<const std::allocator<char16_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIKNSt3__19allocatorIDsEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIDuEEEE",
   "name" : "std::__has_max_size<const std::allocator<char8_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIKNSt3__19allocatorIDuEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIcEEEE",
   "name" : "std::__has_max_size<const std::allocator<char>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIKNSt3__19allocatorIcEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__has_max_sizeIKNS_9allocatorIwEEEE",
   "name" : "std::__has_max_size<const std::allocator<wchar_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIKNSt3__19allocatorIwEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDiEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char32_t>, void, void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDiEE",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDsEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char16_t>, void, void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDsEE",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIDuEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char8_t>, void, void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDuEE",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIcEEvvEE",
   "name" : "std::__is_allocator<std::allocator<char>, void, void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIcEE",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_allocatorINS_9allocatorIwEEvvEE",
   "name" : "std::__is_allocator<std::allocator<wchar_t>, void, void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIwEE",
    "_ZTIv",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__is_construct5__natE",
   "name" : "std::__is_construct::__nat",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIKNS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<const std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char32_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDiEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char16_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDsEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char8_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIDuEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<char>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIcEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_22__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEEEE",
   "name" : "std::__is_nullptr_t<std::__compressed_pair_elem<std::allocator<wchar_t>, 1, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__compressed_pair_elemINS_9allocatorIwEELi1ELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implINS_4pairImmEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tINS_4pairImmEEEE",
   "name" : "std::__is_nullptr_t<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIeEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIeEE",
   "name" : "std::__is_nullptr_t<long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIiEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIiEE",
   "name" : "std::__is_nullptr_t<int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIlEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIlEE",
   "name" : "std::__is_nullptr_t<long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implImEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tImEE",
   "name" : "std::__is_nullptr_t<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implInEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tInEE",
   "name" : "std::__is_nullptr_t<__int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__is_nullptr_t_implIxEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__is_nullptr_tIxEE",
   "name" : "std::__is_nullptr_t<long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__lazy_or_implILb0EJEEE",
   "name" : "std::__lazy_or_impl<false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__numeric_typeIvEE",
   "name" : "std::__numeric_type<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDiNS_9allocatorIDiEEEE",
   "name" : "std::__pointer_type<char32_t, std::allocator<char32_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIDi",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDsNS_9allocatorIDsEEEE",
   "name" : "std::__pointer_type<char16_t, std::allocator<char16_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIDs",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIDuNS_9allocatorIDuEEEE",
   "name" : "std::__pointer_type<char8_t, std::allocator<char8_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIDu",
    "_ZTINSt3__19allocatorIDuEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIcNS_9allocatorIcEEEE",
   "name" : "std::__pointer_type<char, std::allocator<char>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIc",
    "_ZTINSt3__19allocatorIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__pointer_typeIwNS_9allocatorIwEEEE",
   "name" : "std::__pointer_type<wchar_t, std::allocator<wchar_t>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIw",
    "_ZTINSt3__19allocatorIwEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__ratio_divideINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "name" : "std::__ratio_divide<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__ratio_divideINS_5ratioILl1ELl1000000000EEES2_EE",
   "name" : "std::__ratio_divide<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__ratio_divideINS_5ratioILl1ELl1EEENS1_ILl1ELl1000000000EEEEE",
   "name" : "std::__ratio_divide<std::ratio<1, 1>, std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1EEE",
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__ratio_divideINS_5ratioILl31556952ELl1EEENS1_ILl12ELl1EEEEE",
   "name" : "std::__ratio_divide<std::ratio<31556952, 1>, std::ratio<12, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl12ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__ratio_divideINS_5ratioILl31556952ELl1EEENS1_ILl2629746ELl1EEEEE",
   "name" : "std::__ratio_divide<std::ratio<31556952, 1>, std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm16EEE",
   "name" : "std::__select_align<24, 16, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm16ELm8EEE",
   "name" : "std::__select_align<24, 16, 8>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm1ELm16EEE",
   "name" : "std::__select_align<24, 1, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm2ELm16EEE",
   "name" : "std::__select_align<24, 2, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm4ELm16EEE",
   "name" : "std::__select_align<24, 4, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm16EEE",
   "name" : "std::__select_align<24, 8, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm24ELm8ELm8EEE",
   "name" : "std::__select_align<24, 8, 8>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm16EEE",
   "name" : "std::__select_align<32, 16, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm16ELm8EEE",
   "name" : "std::__select_align<32, 16, 8>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm1ELm16EEE",
   "name" : "std::__select_align<32, 1, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm2ELm16EEE",
   "name" : "std::__select_align<32, 2, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm4ELm16EEE",
   "name" : "std::__select_align<32, 4, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm16EEE",
   "name" : "std::__select_align<32, 8, 16>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__select_alignILm32ELm8ELm8EEE",
   "name" : "std::__select_align<32, 8, 8>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__shared_owners_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114__shared_countE",
   "name" : "std::__shared_count",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114__shared_countE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114__shared_countD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__114__shared_count16__on_zero_sharedEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDiNS_9allocatorIDiEELb0EEE",
   "name" : "std::__void_pointer<char32_t *, std::allocator<char32_t>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPDi",
    "_ZTINSt3__19allocatorIDiEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDsNS_9allocatorIDsEELb0EEE",
   "name" : "std::__void_pointer<char16_t *, std::allocator<char16_t>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPDs",
    "_ZTINSt3__19allocatorIDsEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPDuNS_9allocatorIDuEELb0EEE",
   "name" : "std::__void_pointer<char8_t *, std::allocator<char8_t>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPDu",
    "_ZTINSt3__19allocatorIDuEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPcNS_9allocatorIcEELb0EEE",
   "name" : "std::__void_pointer<char *, std::allocator<char>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPc",
    "_ZTINSt3__19allocatorIcEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__114__void_pointerIPwNS_9allocatorIwEELb0EEE",
   "name" : "std::__void_pointer<wchar_t *, std::allocator<wchar_t>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIPw",
    "_ZTINSt3__19allocatorIwEE"
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__114error_categoryE",
   "name" : "std::error_category",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/system_error",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__114error_categoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114error_categoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__114error_categoryD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category4nameEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category23default_error_conditionEi"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentEiRKNS_15error_conditionE"
    },
    {
     "mangled_component_name" : "_ZNKSt3__114error_category10equivalentERKNS_10error_codeEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__114error_category7messageEi"
    }
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIeNS_5ratioILl1ELl1000000000EEEEEeEE",
   "name" : "std::is_convertible<std::chrono::duration<long double, std::ratio<1, 1000000000>>, long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIeNS_5ratioILl1ELl1000000000EEEEE",
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIiNS_5ratioILl2629746ELl1EEEEEiEE",
   "name" : "std::is_convertible<std::chrono::duration<int, std::ratio<2629746, 1>>, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl2629746ELl1EEEEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIiNS_5ratioILl31556952ELl1EEEEEiEE",
   "name" : "std::is_convertible<std::chrono::duration<int, std::ratio<31556952, 1>>, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl31556952ELl1EEEEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIiNS_5ratioILl86400ELl1EEEEEiEE",
   "name" : "std::is_convertible<std::chrono::duration<int, std::ratio<86400, 1>>, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIiNS_5ratioILl86400ELl1EEEEE",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationInNS_5ratioILl1ELl1000000000EEEEEnEE",
   "name" : "std::is_convertible<std::chrono::duration<__int128, std::ratio<1, 1000000000>>, __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationInNS_5ratioILl1ELl1000000000EEEEE",
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEENS2_IeS4_EEEE",
   "name" : "std::is_convertible<std::chrono::duration<long long, std::ratio<1, 1000000000>>, std::chrono::duration<long double, std::ratio<1, 1000000000>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1000000000EEEEE",
    "_ZTINSt3__16chrono8durationIeNS_5ratioILl1ELl1000000000EEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEEeEE",
   "name" : "std::is_convertible<std::chrono::duration<long long, std::ratio<1, 1000000000>>, long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1000000000EEEEE",
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIxNS_5ratioILl1ELl1000000000EEEEExEE",
   "name" : "std::is_convertible<std::chrono::duration<long long, std::ratio<1, 1000000000>>, long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1000000000EEEEE",
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleINS_6chrono8durationIxNS_5ratioILl1ELl1EEEEExEE",
   "name" : "std::is_convertible<std::chrono::duration<long long, std::ratio<1, 1>>, long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__16chrono8durationIxNS_5ratioILl1ELl1EEEEE",
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiNS_17basic_string_viewIDiNS_11char_traitsIDiEEEEEE",
   "name" : "std::is_convertible<const char32_t *const &, std::basic_string_view<char32_t, std::char_traits<char32_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDi",
    "_ZTINSt3__117basic_string_viewIDiNS_11char_traitsIDiEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDiS2_EE",
   "name" : "std::is_convertible<const char32_t *const &, const char32_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDi",
    "_ZTIPKDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsNS_17basic_string_viewIDsNS_11char_traitsIDsEEEEEE",
   "name" : "std::is_convertible<const char16_t *const &, std::basic_string_view<char16_t, std::char_traits<char16_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDs",
    "_ZTINSt3__117basic_string_viewIDsNS_11char_traitsIDsEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDsS2_EE",
   "name" : "std::is_convertible<const char16_t *const &, const char16_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDs",
    "_ZTIPKDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDuNS_17basic_string_viewIDuNS_11char_traitsIDuEEEEEE",
   "name" : "std::is_convertible<const char8_t *const &, std::basic_string_view<char8_t, std::char_traits<char8_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDu",
    "_ZTINSt3__117basic_string_viewIDuNS_11char_traitsIDuEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKDuS2_EE",
   "name" : "std::is_convertible<const char8_t *const &, const char8_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKDu",
    "_ZTIPKDu"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcNS_17basic_string_viewIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_convertible<const char *const &, std::basic_string_view<char, std::char_traits<char>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKc",
    "_ZTINSt3__117basic_string_viewIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKcS2_EE",
   "name" : "std::is_convertible<const char *const &, const char *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKc",
    "_ZTIPKc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwNS_17basic_string_viewIwNS_11char_traitsIwEEEEEE",
   "name" : "std::is_convertible<const wchar_t *const &, std::basic_string_view<wchar_t, std::char_traits<wchar_t>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKw",
    "_ZTINSt3__117basic_string_viewIwNS_11char_traitsIwEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKPKwS2_EE",
   "name" : "std::is_convertible<const wchar_t *const &, const wchar_t *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKPKw",
    "_ZTIPKw"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIRKmmEE",
   "name" : "std::is_convertible<const unsigned long &, unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIRKm",
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIeeEE",
   "name" : "std::is_convertible<long double, long double>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIe",
    "_ZTIe"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIiiEE",
   "name" : "std::is_convertible<int, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIjiEE",
   "name" : "std::is_convertible<unsigned int, int>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIllEE",
   "name" : "std::is_convertible<long, long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIlnEE",
   "name" : "std::is_convertible<long, __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIl",
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleImmEE",
   "name" : "std::is_convertible<unsigned long, unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm",
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleInnEE",
   "name" : "std::is_convertible<__int128, __int128>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIn",
    "_ZTIn"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114is_convertibleIxxEE",
   "name" : "std::is_convertible<long long, long long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIiLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIiEE",
   "name" : "std::numeric_limits<int>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIjLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIjEE",
   "name" : "std::numeric_limits<unsigned int>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__123__libcpp_numeric_limitsIlLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__114numeric_limitsIlEE",
   "name" : "std::numeric_limits<long>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/limits",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
